{
    "section": [
        "Default",
        "Environment",
        "General",
        "MYSQLD DEFAULT",
        "MyBadDSN",
        "MySQL",
        "MySQL ODBC 8.0 Driver",
        "MySQL ODBC 8.0 Unicode Driver",
        "MySQLD",
        "MySQLDSN",
        "MySQLProduction",
        "MySQLTest",
        "NDBD",
        "NDBD DEFAULT",
        "NDB_MGMD",
        "NDB_MGMD DEFAULT",
        "ODBC",
        "ODBC Connection Pooling",
        "ODBC Data Sources",
        "ODBC Drivers",
        "TCP DEFAULT",
        "WinMySQLAdmin",
        "WinMySQLadmin",
        "client",
        "client-server",
        "client2",
        "clinet",
        "embedded",
        "isamchk",
        "manager",
        "mariadb",
        "mariadb-5.5",
        "my.cnf defaults",
        "myisam",
        "myisamchk",
        "myisampack",
        "mysql",
        "mysql.server",
        "mysql_cluster",
        "mysql_hotbackup",
        "mysql_hotcopy",
        "mysql_upgrade",
        "mysqladmin",
        "mysqlcheck",
        "mysqld",
        "mysqld-5.5",
        "mysqld-safe",
        "mysqld.server",
        "mysqld1",
        "mysqld2",
        "mysqld_multi",
        "mysqld_safe",
        "mysqld_safe-ssl",
        "mysqldump",
        "mysqldump_testing",
        "mysqlhotcopy",
        "mysqlimport",
        "mysqlshow",
        "ndb_mgm",
        "ndbd",
        "odbc",
        "root@host backup",
        "safe_mysqld",
        "server",
        "wampmysqld"
    ],
    "key": [
        "- MYSQL_DATABASE",
        "- MYSQL_ROOT_PASSWORD",
        "- VITE_API_URL",
        "APILevel",
        "CHARSET",
        "CPReuse",
        "CPTimeout",
        "CharSet",
        "CommLog",
        "ConnectFunctions",
        "DATABASE",
        "DataDir",
        "DataMemory",
        "Database",
        "Debug",
        "Description",
        "Diskcheckpointspeed",
        "Diskcheckpointspeedinrestart",
        "DontDLClose",
        "DontOptimizeColWidths",
        "Driver",
        "DriverManagerEncoding",
        "DriverODBCVer",
        "EnableDynamicCursor",
        "ErrorMessagesPath",
        "ErrorMode",
        "FileUsage",
        "ForceTrace",
        "HostName",
        "IANAAppCodePage",
        "IANAAppCodes",
        "IndexMemory",
        "InstallDir",
        "LockExecuteThreadToCPU",
        "LockMaintThreadsToCPU",
        "MaxNoOfAttributes",
        "MaxNoOfConcurrentOperations",
        "MaxNoOfConcurrentTransactions",
        "MaxNoOfOrderedIndexes",
        "MyBadDSN",
        "MySQL ODBC 8.0 Driver",
        "MySQLDSN",
        "MySQLProduction",
        "MySQLTest",
        "NoCatalogDB",
        "NoDefaultFolder",
        "NoOfFragmentLogFiles",
        "NoOfReplicas",
        "ODBCINI",
        "ODBCINST",
        "ODBCInst",
        "ODirect",
        "OPTION",
        "Option",
        "PASSWORD",
        "PORT",
        "Password",
        "Pooling",
        "Port",
        "QueryInterval",
        "RealtimeScheduler",
        "ReceiveBufferMemory",
        "RecycleTime",
        "RedoBuffer",
        "SERVER",
        "SET GLOBAL group_concat_max_len",
        "SOCKET",
        "SQLLevel",
        "SSLMode",
        "SchedulerExecutionTimer",
        "SchedulerSpinTimer",
        "SendBufferMemory",
        "Server",
        "Socket",
        "StopOnError",
        "TIMEOUT",
        "TimeBetweenGlobalCheckpoints",
        "TimeBetweenLocalCheckpoints",
        "Trace",
        "TraceFile",
        "TransactionDeadlockDetectionTimeout",
        "TranslationDLL",
        "TranslationOption",
        "USER",
        "UndoIndexBuffer",
        "UsageCount",
        "User",
        "add-drop-table",
        "add-locks",
        "audit-log",
        "audit-log-connection-policy",
        "audit-log-error-policy",
        "audit-log-exclude-user",
        "audit-log-file",
        "audit-log-flush",
        "audit-log-format",
        "audit-log-include-user",
        "audit-log-query-policy",
        "audit-log-strategy",
        "audit_log_buffer_size",
        "audit_log_events",
        "audit_log_exclude_accounts",
        "audit_log_exclude_users",
        "audit_log_file",
        "audit_log_flush",
        "audit_log_format",
        "audit_log_include_accounts",
        "audit_log_include_databases",
        "audit_log_policy",
        "audit_log_strategy",
        "auto-increment-increment",
        "auto-increment-offset",
        "auto_increment_increment",
        "auto_increment_offset",
        "autocommit",
        "back-log",
        "back_log",
        "basedir",
        "bind-address",
        "bind_address",
        "binlog-cache-size",
        "binlog-do-db",
        "binlog-format",
        "binlog-ignore-db",
        "binlog-row-image",
        "binlog_cache_size",
        "binlog_do_db",
        "binlog_expire_logs_seconds",
        "binlog_format",
        "binlog_row_event_max_size",
        "binlog_row_image",
        "bulk_insert_buffer_size",
        "character-set",
        "character-set-client",
        "character-set-client-handshake",
        "character-set-connection",
        "character-set-filesystem",
        "character-set-server",
        "character-sets-dir",
        "character_set_client",
        "character_set_connection",
        "character_set_database",
        "character_set_filesystem",
        "character_set_results",
        "character_set_server",
        "chroot",
        "collation-server",
        "collation_server",
        "comments",
        "compress",
        "concurrent_insert",
        "connect-string",
        "connect-timeout",
        "connect_timeout",
        "database",
        "datadir",
        "default-authentication-plugin",
        "default-character-set",
        "default-collation",
        "default-mysqld-path",
        "default-storage-engine",
        "default-table-type",
        "default-time-zone",
        "default_authentication_plugin",
        "default_character_set",
        "default_storage_engine",
        "default_table_type",
        "default_time_zone",
        "default_tmp_storage_engine",
        "defaults-extra-file",
        "defaults-file",
        "delay-key-write",
        "delay_key_write",
        "delayed_insert_timeout",
        "delayed_queue_size",
        "disable-keys",
        "div_precision_increment",
        "enable-named-pipe",
        "enforce-gtid-consistency",
        "enforce_gtid_consistency",
        "engine-condition-pushdown",
        "err-log",
        "err_log",
        "event-scheduler",
        "event_scheduler",
        "expire-logs-days",
        "expire_logs_days",
        "explicit-defaults-for-timestamp",
        "explicit_defaults_for_timestamp",
        "extended-insert",
        "fake_option",
        "flush_time",
        "ft_max_word_len",
        "ft_min_word_len",
        "ft_stopword_file",
        "general-log",
        "general-log-file",
        "general_log",
        "general_log_file",
        "group_concat_max_len",
        "gtid-mode",
        "gtid_mode",
        "host",
        "id",
        "init-connect",
        "init_connect",
        "innodb",
        "innodb-buffer-pool-instances",
        "innodb-buffer-pool-size",
        "innodb-data-home-dir",
        "innodb-file-per-table",
        "innodb-flush-log-at-trx-commit",
        "innodb-flush-method",
        "innodb-lock-wait-timeout",
        "innodb-log-buffer-size",
        "innodb-log-file-size",
        "innodb-log-files-in-group",
        "innodb-log-group-home-dir",
        "innodb-open-files",
        "innodb-stats-on-metadata",
        "innodb-strict-mode",
        "innodb-thread-concurrency",
        "innodb_adaptive_flushing",
        "innodb_adaptive_hash_index",
        "innodb_additional_mem_pool_size",
        "innodb_autoextend_increment",
        "innodb_autoinc_lock_mode",
        "innodb_buffer_pool_instances",
        "innodb_buffer_pool_size",
        "innodb_change_buffering",
        "innodb_checksum_algorithm",
        "innodb_commit_concurrency",
        "innodb_concurrency_tickets",
        "innodb_data_file_path",
        "innodb_data_home_dir",
        "innodb_doublewrite",
        "innodb_fast_shutdown",
        "innodb_file_format",
        "innodb_file_io_threads",
        "innodb_file_per_table",
        "innodb_flush_log_at_trx_commit",
        "innodb_flush_method",
        "innodb_flush_neighbors",
        "innodb_force_recovery",
        "innodb_ft_cache_size",
        "innodb_index_key_size",
        "innodb_io_capacity",
        "innodb_io_capacity_max",
        "innodb_large_prefix",
        "innodb_lock_wait_timeout",
        "innodb_locks_unsafe_for_binlog",
        "innodb_log_arch_dir",
        "innodb_log_archive",
        "innodb_log_buffer_size",
        "innodb_log_file_size",
        "innodb_log_files_in_group",
        "innodb_log_group_home_dir",
        "innodb_max_dirty_pages_pct",
        "innodb_max_purge_lag",
        "innodb_mirrored_log_files",
        "innodb_mirrored_log_groups",
        "innodb_monitor_enable",
        "innodb_old_blocks_time",
        "innodb_open_files",
        "innodb_page_cleaners",
        "innodb_page_size",
        "innodb_purge_threads",
        "innodb_read_io_threads",
        "innodb_replication_delay",
        "innodb_rollback_on_timeout",
        "innodb_stats_on_metadata",
        "innodb_strict_mode",
        "innodb_support_xa",
        "innodb_sync_spin_loops",
        "innodb_table_locks",
        "innodb_temp_data_file_path",
        "innodb_thread_concurrency",
        "innodb_thread_sleep_delay",
        "innodb_use_sys_malloc",
        "innodb_write_io_threads",
        "integrated-security",
        "interactive-timeout",
        "interactive_timeout",
        "internal_tmp_disk_storage_engine",
        "invalid_option",
        "invalid_startup_option",
        "join-buffer-size",
        "join_buffer",
        "join_buffer_size",
        "key-buffer",
        "key-buffer-size",
        "key_buffer",
        "key_buffer_size",
        "language",
        "lc-messages",
        "lc-messages-dir",
        "lc_messages",
        "lc_messages_dir",
        "local-infile",
        "local_infile",
        "lock-tables",
        "lock_wait_timeout",
        "log",
        "log-bin",
        "log-bin-index",
        "log-bin-trust-function-creators",
        "log-error",
        "log-error-verbosity",
        "log-output",
        "log-queries-not-using-indexes",
        "log-slave-updates",
        "log-slow-queries",
        "log-warnings",
        "log_bin",
        "log_bin_index",
        "log_bin_trust_function_creators",
        "log_error",
        "log_error_verbosity",
        "log_output",
        "log_queries_not_using_indexes",
        "log_slave_updates",
        "log_slow_admin_statements",
        "log_slow_querie",
        "log_slow_queries",
        "log_slow_slave_statements",
        "log_throttle_queries_not_using_indexes",
        "log_timestamps",
        "log_warning",
        "log_warnings",
        "logging.file.name",
        "logging.level.com.example",
        "logging.level.org.hibernate",
        "logging.level.org.springframework",
        "logging.pattern.console",
        "logging.pattern.file",
        "long-query-time",
        "long_query_time",
        "loose-default-storage-engine",
        "loose-local-infile",
        "loose-plugin-dir",
        "low-priority-updates",
        "low_priority_updates",
        "lower-case-table-name",
        "lower-case-table-names",
        "lower_case_table_names",
        "malloc-lib",
        "management.endpoint.health.show-components",
        "management.endpoint.health.show-details",
        "management.endpoints.web.exposure.include",
        "master-connect-retry",
        "master-host",
        "master-info-repository",
        "master-password",
        "master-port",
        "master-retry-count",
        "master-user",
        "master_info_repository",
        "max-allowed-packet",
        "max-binlog-cache-size",
        "max-binlog-size",
        "max-connect-errors",
        "max-connections",
        "max-heap-table-size",
        "max_allowed_packet",
        "max_binlog_cache_size",
        "max_binlog_size",
        "max_connect_errors",
        "max_connections",
        "max_delayed_threads",
        "max_error_count",
        "max_execution_time",
        "max_heap_table_size",
        "max_join_size",
        "max_length_for_sort_data",
        "max_seeks_for_key",
        "max_sort_length",
        "max_sp_recursion_depth",
        "max_tmp_table",
        "max_tmp_tables",
        "max_user_connections",
        "min-examined-row-limit",
        "min_examined_row_limit",
        "monitoring-interval",
        "myisam-recover",
        "myisam-recover-options",
        "myisam-sort-buffer-size",
        "myisam_max_extra_sort_file_size",
        "myisam_max_sort_file_size",
        "myisam_recover",
        "myisam_recover_options",
        "myisam_repair_threads",
        "myisam_sort_buffer_size",
        "myisam_use_mmap",
        "mysqladmin",
        "mysqld",
        "named_pipe",
        "ndb-cluster-connection-pool",
        "ndb-connectstring",
        "ndb-force-send",
        "ndb-use-exact-count",
        "ndb_force_send",
        "net_buffer_length",
        "net_buffer_size",
        "net_read_timeout",
        "net_retry_count",
        "net_write_timeout",
        "nice",
        "no-auto-rehash",
        "no-beep",
        "old-passwords",
        "old_passwords",
        "open-file-limit",
        "open-files",
        "open-files-limit",
        "open_files_limit",
        "optimizer_prune_level",
        "optimizer_search_depth",
        "optimizer_trace",
        "optimizer_trace_max_mem_size",
        "order-by-primary",
        "pass",
        "password",
        "password-file",
        "percona-checksum-table",
        "percona_galera_on",
        "percona_innodb_flush_neighbors",
        "percona_max_binlog_size",
        "performance-schema",
        "performance_schema",
        "performance_schema_consumer_events_statements_current",
        "performance_schema_consumer_events_statements_history",
        "performance_schema_consumer_events_statements_history_long",
        "performance_schema_instrument",
        "performance_schema_max_table_instances",
        "pid-file",
        "pid_file",
        "plugin-dir",
        "plugin-load",
        "plugin-load-add",
        "plugin_dir",
        "port",
        "preload_buffer_size",
        "prompt",
        "protocol",
        "provider",
        "query-cache-limit",
        "query-cache-size",
        "query-cache-type",
        "query_alloc_block_size",
        "query_cache_limit",
        "query_cache_min_res_unit",
        "query_cache_si",
        "query_cache_size",
        "query_cache_type",
        "query_cache_wlock_invalidate",
        "query_prealloc_size",
        "quick",
        "quote-names",
        "read-buffer-size",
        "read-only",
        "read-rnd-buffer-size",
        "read_buffer",
        "read_buffer_size",
        "read_only",
        "read_rnd_buffer",
        "read_rnd_buffer_size",
        "record_buffer",
        "relay-log",
        "relay-log-index",
        "relay-log-info-file",
        "relay-log-info-repository",
        "relay-log-purge",
        "relay-log-recovery",
        "relay-log-space-limit",
        "relay_log",
        "relay_log_index",
        "relay_log_info_repository",
        "relay_log_purge",
        "relay_log_recovery",
        "relay_log_space_limit",
        "replicate-do-db",
        "replicate-ignore-db",
        "replicate-ignore-table",
        "replicate-same-server-id",
        "replicate-wild-ignore-table",
        "replicate_do_db",
        "report-host",
        "report-port",
        "require-secure-transport",
        "require_secure_transport",
        "safe-updates",
        "secure-file-priv",
        "secure_file_priv",
        "server-id",
        "server.port",
        "server.servlet.context-path",
        "server_audit_events",
        "server_audit_excl_users",
        "server_audit_file",
        "server_audit_file_rotation_size",
        "server_audit_file_rotations",
        "server_audit_format",
        "server_audit_incl_users",
        "server_audit_logging",
        "server_audit_syslog_facility",
        "server_id",
        "server_type",
        "set-charset",
        "set-gtid-purged",
        "set-variable",
        "single-transaction",
        "skip-external-locking",
        "skip-grant-tables",
        "skip-name-resolve",
        "skip-networking",
        "skip-slave-start",
        "skip-symbolic-links",
        "skip_name_resolve",
        "slave-net-timeout",
        "slave-parallel-mode",
        "slave-parallel-workers",
        "slave-skip-errors",
        "slave_compressed_protocol",
        "slave_load_tmpdir",
        "slave_net_timeout",
        "slow-query-log",
        "slow-query-log-file",
        "slow_launch_time",
        "slow_query_log",
        "slow_query_log_always_write_time",
        "slow_query_log_file",
        "slow_query_log_use_global_control",
        "socket",
        "sort-buffer-size",
        "sort_buffer",
        "sort_buffer_size",
        "spring.application.name",
        "spring.batch.initialize-schema",
        "spring.datasource.driver-class-name",
        "spring.datasource.hikari.connection-timeout",
        "spring.datasource.hikari.idle-timeout",
        "spring.datasource.hikari.max-lifetime",
        "spring.datasource.hikari.maximum-pool-size",
        "spring.datasource.hikari.minimum-idle",
        "spring.datasource.password",
        "spring.datasource.url",
        "spring.datasource.username",
        "spring.flyway.enabled",
        "spring.http.encoding.charset",
        "spring.http.encoding.enabled",
        "spring.http.encoding.force",
        "spring.jpa.database-platform",
        "spring.jpa.hibernate.ddl-auto",
        "spring.jpa.open-in-view",
        "spring.jpa.properties.hibernate.connection.autoReconnect",
        "spring.jpa.properties.hibernate.connection.autoReconnectForPools",
        "spring.jpa.properties.hibernate.connection.charSet",
        "spring.jpa.properties.hibernate.connection.is-connection-validation-required",
        "spring.jpa.properties.hibernate.default_schema",
        "spring.jpa.properties.hibernate.dialect",
        "spring.jpa.properties.hibernate.format_sql",
        "spring.jpa.properties.hibernate.highlight_sql",
        "spring.jpa.properties.hibernate.id.new_generator_mappings",
        "spring.jpa.properties.hibernate.temp.use_jdbc_metadata_defaults",
        "spring.jpa.properties.hibernate.use_sql_comments",
        "spring.jpa.show-sql",
        "spring.liquibase.enabled",
        "spring.main.banner-mode",
        "spring.messages.basename",
        "spring.messages.encoding",
        "spring.mvc.log-request-details",
        "spring.mvc.log-resolved-exception",
        "spring.output.ansi.enabled",
        "spring.profiles.active",
        "spring.security.user.name",
        "spring.security.user.password",
        "spring.security.user.roles",
        "spring.servlet.multipart.max-file-size",
        "spring.servlet.multipart.max-request-size",
        "sql-mode",
        "sql_mode",
        "sql_require_primary_key",
        "sql_safe_updates",
        "ssl",
        "ssl-ca",
        "ssl-cert",
        "ssl-cipher",
        "ssl-key",
        "ssl-mode",
        "symbolic-links",
        "sync-binlog",
        "sync-master-info",
        "sync-relay-log",
        "sync_binlog",
        "sync_master_info",
        "sync_relay_log",
        "sync_relay_log_info",
        "sysdate-is-now",
        "sysdate_is_always_utc",
        "sysdate_is_now",
        "syslog",
        "syslog-tag",
        "syslog_tag",
        "table-cache",
        "table-definition-cache",
        "table-open-cache",
        "table-open-cache-instances",
        "table_cache",
        "table_definition_cache",
        "table_open_cache",
        "table_open_cache_instances",
        "testWhileIdle",
        "thread-cache-size",
        "thread-stack",
        "thread_cache",
        "thread_cache_size",
        "thread_concurrency",
        "thread_handling",
        "thread_stack",
        "time_zone",
        "timezone",
        "tls-version",
        "tls_version",
        "tmp-table-size",
        "tmp_table_size",
        "tmpdir",
        "tokudb_auto_analyze",
        "tokudb_cache_size",
        "transaction-isolation",
        "transaction_isolation",
        "url",
        "use",
        "user",
        "userstat_running",
        "wait-timeout",
        "wait_timeout",
        "write_buffer",
        "wsrep_causal_reads",
        "wsrep_certify_nonPK",
        "wsrep_cluster_address",
        "wsrep_cluster_name",
        "wsrep_debug",
        "wsrep_node_address",
        "wsrep_node_name",
        "wsrep_on",
        "wsrep_provider",
        "wsrep_provider_options",
        "wsrep_slave_threads",
        "wsrep_sst_auth",
        "wsrep_sst_method",
        "wsrep_sync_wait"
    ],
    "value": [
        "\"\"",
        "\"${path}",
        "\"%password%\"",
        "\"/tmp/with'quotes'inpath\"",
        "\"/var/lib/mysql\"",
        "\"/var/lib/mysql/mysql.sock\"",
        "\"192.168.1.101\"",
        "\"<user>",
        "\"AU221AWP3012-slow.log\"",
        "\"AU221AWP3012.err\"",
        "\"AU221AWP3012.log\"",
        "\"C:/Autonomy/MySQL/\"",
        "\"C:/Backup/databases/MySql/data\\\"",
        "\"C:/Data/\"",
        "\"C:/Documents and Settings/All Users.WINDOWS/Application Data/MySQL/MySQL Server 5.1/Data/\"",
        "\"C:/Documents and Settings/All Users/Application Data/MySQL/MySQL Server 5.1/Data/\"",
        "\"C:/Documents and Settings/All Users/Application Data/MySQL/MySQL Server 5.5/Data/\"",
        "\"C:/Documents and Settings/All Users/Dados de aplicativos/MySQL/MySQL Server 5.5/Data/\"",
        "\"C:/InvalidMySQLDataPath/\"",
        "\"C:/InvalidMySQLDataPath/mysql-bin.log\"",
        "\"C:/InvalidMySQLDataPath/mysql.sock\"",
        "\"C:/InvalidMySQLDataPath/mysqld.log\"",
        "\"C:/InvalidMySQLDataPath/mysqld.pid\"",
        "\"C:/InvalidMySQLDataPath/mysqld_safe.log\"",
        "\"C:/InvalidMySQLDataPath/secure_files/\"",
        "\"C:/InvalidMySQLDataPath/slow.log\"",
        "\"C:/MySQL/MySQL Server 5.5/\"",
        "\"C:/NonExistentDataPath\"",
        "\"C:/Program Files (x86)/MySQL/MySQL Server 5.1/\"",
        "\"C:/Program Files/MySQL\"",
        "\"C:/Program Files/MySQL/MySQL Server 5.0/\"",
        "\"C:/Program Files/MySQL/MySQL Server 5.0/Data/\"",
        "\"C:/Program Files/MySQL/MySQL Server 5.1/\"",
        "\"C:/Program Files/MySQL/MySQL Server 5.5/\"",
        "\"C:/Program Files/MySQL/MySQL Server 5.5/share/\"",
        "\"C:/Program Files/MySQL/MySQL Server 5.6/\"",
        "\"C:/Program Files/MySQL/MySQL Server 5.6//lib/plugin\"",
        "\"C:/Program Files/MySQL/MySQL Server 5.6/data\"",
        "\"C:/Program Files/MySQL/MySQL Server 8.0\"",
        "\"C:/Program Files/MySQL/MySQL Server 8.0/\"",
        "\"C:/Program Files/MySQL/MySQL Server 8.0/share\"",
        "\"C:/Program Files/MySQL/mysql-5.6.10-winx64/\"",
        "\"C:/ProgramData/MySQL/MySQL Server 5.1/Data/\"",
        "\"C:/ProgramData/MySQL/MySQL Server 5.5/Data/\"",
        "\"C:/ProgramData/MySQL/MySQL Server 5.5/data/\"",
        "\"C:/ProgramData/MySQL/MySQL Server 5.5/error.log\"",
        "\"C:/ProgramData/MySQL/MySQL Server 5.5/mysqld.pid\"",
        "\"C:/ProgramData/MySQL/MySQL Server 5.5/mysqld_safe.log\"",
        "\"C:/ProgramData/MySQL/MySQL Server 5.5/secure/\"",
        "\"C:/ProgramData/MySQL/MySQL Server 5.5/slow.log\"",
        "\"C:/ProgramData/MySQL/MySQL Server 8.0/Data\"",
        "\"C:/ProgramData/MySQL/MySQL Server 8.0/Logs/error.log\"",
        "\"C:/ProgramData/MySQL/MySQL Server 8.0/Logs/general.log\"",
        "\"C:/ProgramData/MySQL/MySQL Server 8.0/Logs/slow.log\"",
        "\"C:/ProgramData/MySQL/MySQL Server 8.0/Uploads\"",
        "\"C:/ProgramData/MySQL/MySQL Server 8.0/error.log\"",
        "\"C:/ProgramData/MySQL/MySQL Server 8.0/general.log\"",
        "\"C:/ProgramData/MySQL/MySQL Server 8.0/mysqld.pid\"",
        "\"C:/ProgramData/MySQL/MySQL Server 8.0/mysqld_safe.log\"",
        "\"C:/ProgramData/MySQL/MySQL Server 8.0/slow.log\"",
        "\"C:/Windows/TEMP\"",
        "\"C:/Windows/TEMP/\"",
        "\"C:/xampp/mysql\"",
        "\"C:/xampp/mysql/\"",
        "\"C:/xampp/mysql/data\"",
        "\"C:/xampp/mysql/mysql.sock\"",
        "\"C:/xampp/tmp\"",
        "\"C:\\Program Files\\MySQL\\MySQL Server 5.5\\\"",
        "\"C:\\Program Files\\MySQL\\MySQL Server 5.6\\\"",
        "\"C:\\ProgramData\\MySQL\\MySQL Server 5.5\\data\\\"",
        "\"C:\\ProgramData\\MySQL\\MySQL Server 5.6\\data\\\"",
        "\"C:\\rootfolder\\MySQL\\\"",
        "\"C:\\rootfolder\\MySQL\\data\\\"",
        "\"CM999-SV510-slow.log\"",
        "\"CM999-SV510.err\"",
        "\"CM999-SV510.log\"",
        "\"D:/DBs/\"",
        "\"D:/DBs/Data/\"",
        "\"D:/MySQL Datafiles/\"",
        "\"D:/MySQL Datafiles/data/\"",
        "\"D:/MySQL InnoDB Datafiles/\"",
        "\"D:/MySQL/\"",
        "\"D:/MySQL/data\"",
        "\"D:/MySQL/log_files/log-bin\"",
        "\"D:/MySQL/temp_files\"",
        "\"D:/ProgramData/MySQL/MySQL Server 5.6/data/\"",
        "\"D:/ProgramData/MySQL/MySQL Server 5.6/data\\\"",
        "\"D:\\MySQL Datafiles\\data\\\"",
        "\"D:\\MySQL\\Data\\mysql.pid\"",
        "\"D:\\MySQL\\Logs\\mysql-error.log\"",
        "\"D:\\MySQL\\Logs\\mysql-general.log\"",
        "\"D:\\MySQL\\Logs\\mysql-slow.log\"",
        "\"E:/MySQL Datafiles/\"",
        "\"E:/MySQLData/data\"",
        "\"E:/Program Files/MySQL/MySQL Server 5.5/\"",
        "\"E:/Program Files/MySQL/MySQL Server 5.5/data/\"",
        "\"E:\\MySQLBinaryLogger\\mysql-bin.log\"",
        "\"E:\\MySQLData\\data\\\"",
        "\"F:/Program Files/MySQL/MySQL Server 5.1/\"",
        "\"G:/MySQLTemp\"",
        "\"GRAYSCALE-slow.log\"",
        "\"GRAYSCALE.err\"",
        "\"GRAYSCALE.log\"",
        "\"MySQL\"",
        "\"NO_ENGINE_SUBSTITUTION\"",
        "\"P:/MySQL Datafiles/\"",
        "\"P:/MySQL/MySQL Server 5.5/\"",
        "\"P:/MySQL/MySQL Server 5.5/Data/\"",
        "\"POOYA.err\"",
        "\"ROW\"",
        "\"SQLSERVER-slow.log\"",
        "\"SQLSERVER.err\"",
        "\"SQLSERVER.log\"",
        "\"STRICT_TRANS_TABLES,ERROR_FOR_DIVISION_BY_ZERO,NO_ENGINE_SUBSTITUTION\"",
        "\"STRICT_TRANS_TABLES,NO_AUTO_CREATE_USER,NO_ENGINE_SUBSTITUTION\"",
        "\"STRICT_TRANS_TABLES,NO_ENGINE_SUBSTITUTION\"",
        "\"STRICT_TRANS_TABLES,NO_ZERO_IN_DATE,NO_ZERO_DATE,ERROR_FOR_DIVISION_BY_ZERO,NO_AUTO_CREATE_USER,NO_ENGINE_SUBSTITUTION\"",
        "\"STRICT_TRANS_TABLES,NO_ZERO_IN_DATE,NO_ZERO_DATE,ERROR_FOR_DIVISION_BY_ZERO,NO_ENGINE_SUBSTITUTION\"",
        "\"STRICT_TRANS_TABLES,NO_ZERO_IN_DATE,NO_ZERO_DATE,ERROR_FOR_DIVISION_BY_ZERO,TRADITIONAL,NO_AUTO_CREATE_USER,NO_ENGINE_SUBSTITUTION\"",
        "\"SYSTEM\"",
        "\"TCP/IP\"",
        "\"W:/Applications/MySQL/MySQL Server 5.0/\"",
        "\"W:/Applications/MySQL/MySQL Server 5.0/Data/\"",
        "\"WINGRA-DB01-slow.log\"",
        "\"WINGRA-DB01.err\"",
        "\"WINGRA-DB01.log\"",
        "\"\\\\u@\\\\h [\\\\d]> \"",
        "\"\\\\u@\\\\h:\\\\d> \"",
        "\"\\\\u@\\\\h:\\\\p [\\\\d]> \"",
        "\"\\\\u@\\\\h:\\\\p \\\\R:\\\\m:\\\\s> \"",
        "\"\\\\u@\\\\h:\\\\p \\\\R:\\\\m> \"",
        "\"\\\\u@\\\\h:\\\\p> \"",
        "\"c:/MySQL Datafiles/\"",
        "\"c:/logs/mysql/mysqld.log\"",
        "\"c:/zpanel/bin/mysql/\"",
        "\"c:/zpanel/logs/mysql/mysql-slow.log\"",
        "\"c:/zpanel/logs/mysql/mysql.err\"",
        "\"c:/zpanel/logs/mysql/mysql.log\"",
        "\"e:/hafez/bin/mysql/mysql5.5.24/data/\"",
        "\"e:/hafez/bin/mysql/mysql5.5.24/tmp/\"",
        "\"galera_cluster\"",
        "\"gcache.size=128M",
        "\"host=localhost:1186\"",
        "\"invalid\"",
        "\"itm-db\"",
        "\"my-pc.err\"",
        "\"my-pc.log\"",
        "\"mysql\"",
        "\"mysql.pid\"",
        "\"mysql://root:mypass@db:3306/itm-db\"",
        "\"node1\"",
        "\"nodeid=2",
        "\"prisma-client-js\"",
        "\"root\"",
        "\"sst_user:sst_password\"",
        "${MYSQL_PASSWORD}",
        "${path}",
        "%.%",
        "%.norep%",
        "%d{yyyy-MM-dd HH:mm:ss}",
        "'%=%'",
        "'%memory%'",
        "'%memory/%=ON'",
        "'%memory/%=on'",
        "'%thread=%'",
        "''",
        "'+00:00'",
        "'+10:00'",
        "'DHE-RSA-AES256-SHA'",
        "'Europe/Paris'",
        "'NO_ENGINE_SUBSTITUTION'",
        "'NO_ENGINE_SUBSTITUTION,TRADITIONAL'",
        "'NO_ZERO_DATE,STRICT_TRANS_TABLES,ERROR_FOR_DIVISION_BY_ZERO,NO_ENGINE_SUBSTITUTION,ONLY_FULL_GROUP_BY'",
        "'NO_ZERO_IN_DATE,NO_ZERO_DATE,ERROR_FOR_DIVISION_BY_ZERO,NO_AUTO_CREATE_USER,NO_ENGINE_SUBSTITUTION'",
        "'SET AUTOCOMMIT=1'",
        "'SET NAMES latin1'",
        "'SET NAMES utf8'",
        "'SET NAMES utf8mb4'",
        "'SET SESSION sql_mode = \"STRICT_TRANS_TABLES\"",
        "'SET autocommit=1",
        "'SET collation_connection = latin1_swedish_ci'",
        "'SET collation_connection = utf8_bin'",
        "'SET collation_connection = utf8_general_ci'",
        "'STRICT_TRANS_TABLES,ERROR_FOR_DIVISION_BY_ZERO,NO_AUTO_CREATE_USER,NO_ENGINE_SUBSTITUTION'",
        "'STRICT_TRANS_TABLES,ERROR_FOR_DIVISION_BY_ZERO,NO_ENGINE_SUBSTITUTION'",
        "'STRICT_TRANS_TABLES,NO_ENGINE_SUBSTITUTION'",
        "'STRICT_TRANS_TABLES,NO_ZERO_IN_DATE,NO_ZERO_DATE,ERROR_FOR_DIVISION_BY_ZERO,NO_AUTO_CREATE_USER'",
        "'STRICT_TRANS_TABLES,NO_ZERO_IN_DATE,NO_ZERO_DATE,ERROR_FOR_DIVISION_BY_ZERO,NO_AUTO_CREATE_USER,NO_ENGINE_SUBSTITUTION'",
        "'STRICT_TRANS_TABLES,NO_ZERO_IN_DATE,NO_ZERO_DATE,ERROR_FOR_DIVISION_BY_ZERO,NO_ENGINE_SUBSTITUTION'",
        "'SYSTEM'",
        "'UTC'",
        "'\\\\u@\\\\h:\\\\d> '",
        "'all'",
        "'localhost'",
        "'root@localhost'",
        "'sst_user:incorrect_password'",
        "(\\u@atlas) [\\d]>\\\\_",
        "*",
        "****",
        "-1",
        "-15",
        "-18",
        "-5",
        ".",
        "../innodb",
        "../innodb/innodata:20M:autoextend:max:100M",
        "../innodb/innodb_arch_logs",
        "./data-mysql",
        ".\\HomeDesktop-24.err",
        "/DATA/mysql",
        "/DATA/mysql/binlog",
        "/DATA/mysql/intranet02-slow.log",
        "/DATA/mysql/mysql-bin",
        "/DATA/mysql/mysqld.log",
        "/DB2/mysql",
        "/MySQL",
        "/Users/fsb/mysql",
        "/Volumes/Elements/database",
        "/Volumes/storage/Data",
        "/api",
        "/app/mysql/data",
        "/app/mysql/log/",
        "/app/mysql/log/error.log",
        "/app/mysql/var/mysql.sock",
        "/backup/mysql-cbt",
        "/backup/mysql-cbt/cbt-instance.err",
        "/backup/mysql-cbt/cbt-instance.pid",
        "/backup/mysql-cbt/data",
        "/backup/mysql-cbt/mysql.sock",
        "/backup/mysql-cbt/tmpdir",
        "/backup/restored/data",
        "/custom/innodb/data",
        "/custom/innodb/data/ibdata1:10M:autoextend",
        "/custom/innodb/logs",
        "/custom/mysql/data",
        "/data/logs/mysql/error.log",
        "/data/logs/mysql/stats03-slowquery.log",
        "/data/mysql",
        "/data/mysql/",
        "/data/mysql/databases",
        "/data/mysql/galera1",
        "/data/mysql/mysql-bin",
        "/data/mysql/mysql-error.log",
        "/data/mysql/mysql-slow.log",
        "/data/mysql/mysql.pid",
        "/data/mysql/mysql.sock",
        "/data/mysql/temp",
        "/data2/var/lib/mysql",
        "/data2/var/log/mysql/mysql-bin",
        "/data_fio/mysqlbinlog/mysql-bin.log",
        "/data_fio/mysqldata",
        "/data_fio/mysqltmp",
        "/database/mysql",
        "/db/binlog/tlsgriffin01-bin",
        "/db/data",
        "/db/data/.mysqlmanager.passwd",
        "/db/data/mysql.sock",
        "/db/innodb",
        "/db/log/manager.pid",
        "/db/log/manager.sock",
        "/db/log/tlsgriffin01-err.log",
        "/db/log/tlsgriffin01-slow.log",
        "/db/mysql",
        "/db/mysql/data",
        "/db/mysql/log/mysql.err",
        "/db/mysql/log/mysqld.err",
        "/db/mysql/log/slow_query.log",
        "/db/mysql/master-bin",
        "/db/mysql/master-bin.index",
        "/db/tmp",
        "/db/tmpfs01",
        "/dev/shm",
        "/disk3/Datareal/oficial/mysql",
        "/elastiblockdb/log/mysql/mysql-slow.log",
        "/elastiblockdb/log/mysql/mysql_error.log",
        "/elastiblockdb/log/mysql/mysql_general.log",
        "/elastidb/lib/mysql",
        "/etc/my.cnf",
        "/etc/mysql/ca-cert.pem",
        "/etc/mysql/cacert.pem",
        "/etc/mysql/certs/ca-cert.pem",
        "/etc/mysql/certs/ca.pem",
        "/etc/mysql/certs/client-cert.pem",
        "/etc/mysql/certs/client-key.pem",
        "/etc/mysql/certs/server-cert.pem",
        "/etc/mysql/certs/server-key.pem",
        "/etc/mysql/client-cert.pem",
        "/etc/mysql/client-key.pem",
        "/etc/mysql/key.pem",
        "/etc/mysql/my.cnf",
        "/etc/mysql/mysqldump.cnf",
        "/etc/mysql/server-cert.pem",
        "/etc/mysql/server-key.pem",
        "/etc/mysql/ssl/ca.pem",
        "/etc/mysql/ssl/client-cert.pem",
        "/etc/mysql/ssl/client-key.pem",
        "/etc/mysql/ssl/server-cert.pem",
        "/etc/mysql/ssl/server-key.pem",
        "/etc/odbc.ini",
        "/etc/odbcinst.ini",
        "/export/data1/apps/local/mysql/data",
        "/export/data1/apps/local/mysql/logs/mysqld.log",
        "/export/data1/apps/local/mysql/logs/mysqld.pid",
        "/export/data1/apps/local/mysql/mysql.sock",
        "/home/backup/data/mysql-updates/",
        "/home/gleb/mysqls/chroot",
        "/home/iepm/mysql",
        "/home/iepm/mysql/mysql.sock",
        "/home/mysql",
        "/home/mysql/prod",
        "/home/var/lib/mysql",
        "/incorrect/socket/path",
        "/invalid/nonexistent/data/path",
        "/invalid/nonexistent/datadir",
        "/invalid/nonexistent/path",
        "/invalid/path",
        "/invalid/path/to/mysql/data",
        "/media/HDD1/comparable/mysql",
        "/media/mysql-ebs/datadir",
        "/media/mysql-ebs/log_bin/mysql-bin.log",
        "/media/ssd/db",
        "/mnt/ebs/mysql",
        "/mnt/hdd/mysql/data",
        "/mnt/hdd/mysql_data",
        "/mnt/hdd/old_databases",
        "/mnt/mysql/tmp",
        "/mnt/mysql_tmp",
        "/mnt/newdrive/mysql",
        "/mnt/newdrive/mysql/data",
        "/mnt/old_hdd/mysql_data",
        "/mnt/oldhdd/mysql/data",
        "/mnt/persistent/mysql",
        "/mnt/persistent/mysql/",
        "/mnt/storage2TB/MySQL/data/",
        "/mnt/tmp",
        "/mnt/var/lib/mysql",
        "/mysql",
        "/mysql/binary-logs/produccion-bin",
        "/mysql/binary-logs/produccion-relay-bin",
        "/mysql/data",
        "/mysql/data/invalid",
        "/mysql/innodb",
        "/mysql/innodb-logs",
        "/mysql/log",
        "/mysql/log/mysqld-err.log",
        "/mysql/log/mysqlderror.log",
        "/mysql/logs/mysql.err",
        "/mysql/logs/mysqld.err",
        "/mysql/logs/slow-queries.log",
        "/mysql/mydatabase",
        "/mysql/mydatabase/mysql.sock",
        "/mysql/mysqld.pid",
        "/mysql/mysqld.sock",
        "/mysql/slow.queries",
        "/mysql/tmp",
        "/mysql/tmp/mysql_slow_queries.log",
        "/mysql/tmp/mysqld.pid",
        "/mysqls/data",
        "/mysqls/logs/log_i/log_i",
        "/mysqls/logs/mysql.log-error.i",
        "/mysqls/logs/mysql.log-slow.i",
        "/mysqls/logs/mysql.log.i",
        "/mysqls/share/mysql/charsets",
        "/mysqls/tmp/mysql.pid.gleb.i",
        "/mysqls/tmp/mysql.sock.gleb.i",
        "/newdrive/mysql/data",
        "/node1_css_mysql",
        "/node1_css_mysql_logs/mysql-bin",
        "/non/existent/mysql/data",
        "/nonexistent/datadir",
        "/nonexistent/mysql",
        "/nonexistent/mysql/data",
        "/nonexistent/mysql/socket",
        "/nonexistent/path/mysql.pid",
        "/nonexistent/socket/path.sock",
        "/opt/bitnami/mysql",
        "/opt/bitnami/mysql/bin/mysqld.bin",
        "/opt/bitnami/mysql/data",
        "/opt/bitnami/mysql/tmp",
        "/opt/bitnami/mysql/tmp/manager.pid",
        "/opt/bitnami/mysql/tmp/mysql.sock",
        "/opt/local/lib/mysql5/bin/mysql",
        "/opt/local/libexec/mysqld",
        "/opt/local/var/db/mysql5",
        "/opt/mysql",
        "/opt/mysql-5.0.27",
        "/opt/mysql/data",
        "/opt/mysql/logs/error.log",
        "/opt/mysql/logs/general.log",
        "/opt/mysql/logs/mysql-bin",
        "/opt/mysql/logs/mysqld_safe.log",
        "/opt/mysql/logs/slow.log",
        "/opt/mysql/mysql.sock",
        "/opt/mysql/mysqld.pid",
        "/opt/mysql/mysqld_safe.pid",
        "/opt/mysql/secure-files",
        "/opt/mysql/server-5.6",
        "/opt/mysql/server-5.6/share/english",
        "/opt/mysql/tmp",
        "/opt/pprd/log/mysql-bin.index",
        "/opt/pprd/log/mysql-bin.log",
        "/opt/pprd/mysql",
        "/path/to/ca.pem",
        "/path/to/client-cert.pem",
        "/path/to/client-key.pem",
        "/root/mysql.sock",
        "/root/mysqld.sock",
        "/srv/mysql",
        "/storage/mysql/data",
        "/tmp",
        "/tmp/custom.sock",
        "/tmp/incorrect_mysql_socket.sock",
        "/tmp/mysql.galera1.sock",
        "/tmp/mysql.sock",
        "/tmp/mysql5.sock",
        "/tmp/mysql_custom.sock",
        "/tmp/mysql_error.log",
        "/tmp/mysql_general.log",
        "/tmp/mysql_live.sock",
        "/tmp/mysql_slow.log",
        "/tmp/mysql_slow_queries.log",
        "/tmp/mysqld.sock",
        "/tmp/nonexistent.sock",
        "/tmp/odbc_global_trace.log",
        "/tmp/odbc_trace.log",
        "/tmp/slow.log",
        "/u01/app/mysql",
        "/u07/mysql/data",
        "/usr",
        "/usr/",
        "/usr/bin/mysqladmin",
        "/usr/bin/mysqld_safe",
        "/usr/lib/galera/libgalera_smm.so",
        "/usr/lib/galera/libgalera_smm.so_invalid_path",
        "/usr/lib/libgalera_smm.so",
        "/usr/lib/libtcmalloc.so",
        "/usr/lib/mysql/plugin",
        "/usr/lib/odbc",
        "/usr/lib/odbc/",
        "/usr/lib/odbc/libmyodbc8w.so",
        "/usr/lib/x86_64-linux-gnu/libtcmalloc.so.4",
        "/usr/lib/x86_64-linux-gnu/libtcmalloc_minimal.so.4",
        "/usr/lib/x86_64-linux-gnu/odbc/libmyodbc8w.so",
        "/usr/lib64/galera/libgalera_smm.so",
        "/usr/lib64/libgalera_smm.so",
        "/usr/local/mysql",
        "/usr/local/mysql-5.0.18",
        "/usr/local/mysql-5.5.20/data",
        "/usr/local/mysql-5.5.20/log/error.log",
        "/usr/local/mysql-5.5.20/tmp",
        "/usr/local/mysql/data",
        "/usr/local/mysql/data/dev.pid",
        "/usr/local/mysql/data/error.log",
        "/usr/local/mysql/data/general.log",
        "/usr/local/mysql/data/mysql-bin",
        "/usr/local/mysql/data/mysql-bin.log",
        "/usr/local/mysql/data/mysqld.log",
        "/usr/local/mysql/data/mysqld.pid",
        "/usr/local/mysql/data/mysqld_safe.log",
        "/usr/local/mysql/data/mysqld_safe.pid",
        "/usr/local/mysql/data/relay-bin.index",
        "/usr/local/mysql/data/relay-bin.log",
        "/usr/local/mysql/data/relay-log.info",
        "/usr/local/mysql/data/slow.log",
        "/usr/local/mysql/logs/mysqld.log",
        "/usr/local/mysql/secure_files",
        "/usr/local/mysql/share",
        "/usr/local/mysql/tmp/mysql.sock",
        "/usr/local/mysql5",
        "/usr/local/mysql5/data",
        "/usr/local/mysql5/error.log",
        "/usr/sbin/mysqld",
        "/usr/share/libodbc/",
        "/usr/share/mysql",
        "/usr/share/mysql/charsets",
        "/usr/share/mysql/english",
        "/var/db/mysql",
        "/var/db/mysql/mysql.pid",
        "/var/db/mysql/mysqld.slow.log",
        "/var/db/mysql/razor-mysqld.log",
        "/var/db/mysql/razor-slow-log-by-katmai.log",
        "/var/lib",
        "/var/lib/mysql",
        "/var/lib/mysql-cluster",
        "/var/lib/mysql-files",
        "/var/lib/mysql-nonexistent",
        "/var/lib/mysql-old",
        "/var/lib/mysql/",
        "/var/lib/mysql/certs/ca-cert.pem",
        "/var/lib/mysql/certs/server-cert.pem",
        "/var/lib/mysql/certs/server-key.pem",
        "/var/lib/mysql/data",
        "/var/lib/mysql/data/",
        "/var/lib/mysql/data/mysql-bin",
        "/var/lib/mysql/data/mysql-error.log",
        "/var/lib/mysql/data/mysql-slow.log",
        "/var/lib/mysql/data/mysql.pid",
        "/var/lib/mysql/data/mysql.sock",
        "/var/lib/mysql/err.log",
        "/var/lib/mysql/error.log",
        "/var/lib/mysql/files",
        "/var/lib/mysql/general.log",
        "/var/lib/mysql/general_log.log",
        "/var/lib/mysql/log-bin",
        "/var/lib/mysql/logs/borg-binlog.log",
        "/var/lib/mysql/logs/mysql-bin",
        "/var/lib/mysql/mysql-bin",
        "/var/lib/mysql/mysql-bin.log",
        "/var/lib/mysql/mysql-error.log",
        "/var/lib/mysql/mysql-log",
        "/var/lib/mysql/mysql-slow.log",
        "/var/lib/mysql/mysql-standard-5.0.17-linux-x86_64-glibc23/data",
        "/var/lib/mysql/mysql-standard-5.0.17-linux-x86_64-glibc23/share/mysql/english",
        "/var/lib/mysql/mysql.pid",
        "/var/lib/mysql/mysql.sock",
        "/var/lib/mysql/mysql.sock user=mysql",
        "/var/lib/mysql/mysql.sock1",
        "/var/lib/mysql/mysql1.pid1",
        "/var/lib/mysql/mysqld.log",
        "/var/lib/mysql/mysqld.pid",
        "/var/lib/mysql/mysqld_safe.log",
        "/var/lib/mysql/mysqld_safe.pid",
        "/var/lib/mysql/nonexistent_directory",
        "/var/lib/mysql/prod",
        "/var/lib/mysql/relay-bin",
        "/var/lib/mysql/relay-bin.index",
        "/var/lib/mysql/relay-log.info",
        "/var/lib/mysql/secure",
        "/var/lib/mysql/secure-files",
        "/var/lib/mysql/secure_dir",
        "/var/lib/mysql/securedir",
        "/var/lib/mysql/server.name.com.pid",
        "/var/lib/mysql/slow-log",
        "/var/lib/mysql/slow.log",
        "/var/lib/mysql/slow_log.log",
        "/var/lib/mysql/tmp",
        "/var/lib/mysql1",
        "/var/lib/mysql2",
        "/var/lib/mysql_backup",
        "/var/lib/mysql_invalid",
        "/var/lib/mysql_ramdisk",
        "/var/lib/mysql_secure",
        "/var/lib/mysql_secure_files",
        "/var/lib/mysqllogs/bin-log",
        "/var/lib/mysqllogs/relay-log",
        "/var/lib/mysqllogs/slow-log",
        "/var/lib/mysqltmp",
        "/var/log/log-slow-queries.log",
        "/var/log/mysql-general.log",
        "/var/log/mysql-indexes.log",
        "/var/log/mysql-query.log",
        "/var/log/mysql-slow-queries.log",
        "/var/log/mysql-slow-query.log",
        "/var/log/mysql-slow.log",
        "/var/log/mysql.log",
        "/var/log/mysql/audit.log",
        "/var/log/mysql/binlog",
        "/var/log/mysql/error.log",
        "/var/log/mysql/error1.log",
        "/var/log/mysql/error2.log",
        "/var/log/mysql/general.log",
        "/var/log/mysql/general_queries.log",
        "/var/log/mysql/log-slow-queries.log",
        "/var/log/mysql/mariadb-bin",
        "/var/log/mysql/mariadb-bin.index",
        "/var/log/mysql/mariadb-error.log",
        "/var/log/mysql/mariadb-slow.log",
        "/var/log/mysql/mysql-bin",
        "/var/log/mysql/mysql-bin.index",
        "/var/log/mysql/mysql-bin.log",
        "/var/log/mysql/mysql-bin.log.index",
        "/var/log/mysql/mysql-bin1.log",
        "/var/log/mysql/mysql-bin2.log",
        "/var/log/mysql/mysql-error.log",
        "/var/log/mysql/mysql-general.log",
        "/var/log/mysql/mysql-log.log",
        "/var/log/mysql/mysql-relay",
        "/var/log/mysql/mysql-relay-bin",
        "/var/log/mysql/mysql-relay-bin.index",
        "/var/log/mysql/mysql-slow.log",
        "/var/log/mysql/mysql.err",
        "/var/log/mysql/mysql.index",
        "/var/log/mysql/mysql.log",
        "/var/log/mysql/mysql_error.log",
        "/var/log/mysql/mysqld.err",
        "/var/log/mysql/mysqld.log",
        "/var/log/mysql/mysqld_safe.log",
        "/var/log/mysql/mysqld_safe_error.log",
        "/var/log/mysql/queries.log",
        "/var/log/mysql/relay-bin",
        "/var/log/mysql/relay-bin.index",
        "/var/log/mysql/relay-bin.log",
        "/var/log/mysql/relay-bin2.log",
        "/var/log/mysql/relay-log.index",
        "/var/log/mysql/relay-log.info",
        "/var/log/mysql/relay.log",
        "/var/log/mysql/slow queries.log",
        "/var/log/mysql/slow-queries.log",
        "/var/log/mysql/slow-query.log",
        "/var/log/mysql/slow.log",
        "/var/log/mysql/slow1.log",
        "/var/log/mysql/slow2.log",
        "/var/log/mysql/slow_queries.log",
        "/var/log/mysql/slow_query.log",
        "/var/log/mysql/slowlog.log",
        "/var/log/mysql_general.log",
        "/var/log/mysql_slow.log",
        "/var/log/mysqld-general.log",
        "/var/log/mysqld-slow.log",
        "/var/log/mysqld.error.log",
        "/var/log/mysqld.log",
        "/var/log/mysqld.slow.log",
        "/var/log/mysqld_all.log",
        "/var/log/mysqld_multi.log",
        "/var/log/mysqld_safe.log",
        "/var/log/mysqlslow.log",
        "/var/log/odbc.log",
        "/var/log/odbc_trace.log",
        "/var/log/slow-log",
        "/var/mysql/live/data",
        "/var/mysql/mysql.sock",
        "/var/run/mysql/mysql.sock",
        "/var/run/mysqld/custom.sock",
        "/var/run/mysqld/incorrect_socket_path.sock",
        "/var/run/mysqld/mysql.pid",
        "/var/run/mysqld/mysqld-5-5-20.sock",
        "/var/run/mysqld/mysqld.pid",
        "/var/run/mysqld/mysqld.sock",
        "/var/run/mysqld/mysqld1.pid",
        "/var/run/mysqld/mysqld1.sock",
        "/var/run/mysqld/mysqld2.pid",
        "/var/run/mysqld/mysqld2.sock",
        "/var/run/mysqld/mysqld5.pid",
        "/var/run/mysqld/mysqld_safe.pid",
        "/var/run/mysqld/nonexistent.sock",
        "/var/tmp",
        "/var/tmp/",
        "/var/www/data",
        "/var/www/data/mysql.sock",
        "/var/www/logs/log-slow-query.log",
        "/var/www/logs/mysqld.log",
        "/vu/mysql/dados",
        "/web/log/slowquery.log",
        "0",
        "0.0.0.0",
        "0.1",
        "0.5",
        "02",
        "03.51",
        "0M",
        "1",
        "1.2",
        "10",
        "10.0.0.1",
        "10.1.1.50",
        "10.10.1.7",
        "10.100.27.30",
        "10.255.35.55",
        "10.5.1.100",
        "100",
        "1000",
        "10000",
        "100000",
        "1000000",
        "100000000",
        "1000M",
        "1002M",
        "100535",
        "100G",
        "100M",
        "101",
        "1024",
        "10240",
        "1024K",
        "1024M",
        "1024MB",
        "1028",
        "1028M",
        "103M",
        "1048",
        "1048576",
        "10485760",
        "104857600",
        "1048576000",
        "1048M",
        "1062,1146,1032",
        "1073741824",
        "10800",
        "10G",
        "10M",
        "10MB",
        "10m",
        "1140M",
        "11600M",
        "118M",
        "11G",
        "11M",
        "12",
        "120",
        "1200",
        "120M",
        "12288M",
        "124M",
        "125",
        "125M",
        "126M",
        "127.0.0.1",
        "1275M",
        "128",
        "128K",
        "128M",
        "128MB",
        "128k",
        "12G",
        "12M",
        "130G",
        "130M",
        "13100M",
        "131072",
        "134217728",
        "136",
        "13M",
        "14",
        "1400",
        "14400",
        "14G",
        "14M",
        "15",
        "150",
        "1500",
        "15000",
        "150000",
        "150M",
        "151",
        "1510",
        "1512M",
        "1520",
        "15360",
        "1536M",
        "154M",
        "156M",
        "15G",
        "15M",
        "16",
        "160",
        "16000",
        "1600M",
        "160M",
        "16384",
        "163840",
        "16777216",
        "168M",
        "16G",
        "16K",
        "16M",
        "16k",
        "17",
        "170M",
        "172.16.110.21",
        "175M",
        "1768M",
        "17M",
        "18",
        "180",
        "1800",
        "1800000",
        "1800MB",
        "1844674407370954751",
        "18916",
        "189M",
        "18G",
        "18M",
        "192",
        "192.168.1.100",
        "192.168.1.101",
        "192.168.10.16",
        "192.168.10.22",
        "192.168.10.23",
        "192.168.2.153",
        "192.241.X.X",
        "192K",
        "192M",
        "192k",
        "196G",
        "1998",
        "19M",
        "1G",
        "1K",
        "1M",
        "1xx.1xx.1xx.148",
        "2",
        "2.0",
        "2.000000",
        "20",
        "20.9.13.7",
        "200",
        "2000",
        "20000",
        "2000000",
        "2000K",
        "2000M",
        "200M",
        "200m",
        "2024M",
        "2048",
        "2048M",
        "2050",
        "205M",
        "206M",
        "208K",
        "2097144",
        "2097152",
        "209715200",
        "20G",
        "20M",
        "21",
        "212K",
        "214M",
        "2192M",
        "22",
        "22000M",
        "227M",
        "22GB",
        "22K",
        "22M",
        "2385M",
        "23G",
        "24",
        "2400",
        "24000",
        "2401",
        "246M",
        "24M",
        "25",
        "250",
        "2500",
        "250M",
        "252M",
        "2555",
        "256",
        "256K",
        "256M",
        "256k",
        "2592000",
        "25G",
        "25M",
        "26",
        "262144",
        "268435456",
        "26G",
        "26M",
        "270M",
        "27800",
        "27M",
        "2800M",
        "285M",
        "28800",
        "28G",
        "2G",
        "2K",
