{
    "sections": {
        "MySQLD": 0,
        "NDBD": 1,
        "NDBD DEFAULT": 2,
        "NDB_MGMD": 3,
        "TCP DEFAULT": 4,
        "WinMySQLAdmin": 5,
        "WinMySQLadmin": 6,
        "client": 7,
        "client2": 8,
        "global": 9,
        "isamchk": 10,
        "manager": 11,
        "mariadb": 12,
        "myisamchk": 13,
        "myisampack": 14,
        "mysql": 15,
        "mysql.server": 16,
        "mysql_cluster": 17,
        "mysql_upgrade": 18,
        "mysqladmin": 19,
        "mysqlcheck": 20,
        "mysqld": 21,
        "mysqld-safe": 22,
        "mysqld.server": 23,
        "mysqld_multi": 24,
        "mysqld_safe": 25,
        "mysqldump": 26,
        "mysqlhotcopy": 27,
        "mysqlimport": 28,
        "mysqlshow": 29,
        "ndb_mgm": 30,
        "ndbd": 31,
        "safe_mysqld": 32,
        "server": 33,
        "wampmysqld": 34
    },
    "section_keyword_tokens": {
        "MySQLD": {
            "innodb": 1039,
            "_": 1040,
            "thread": 1041,
            "concurrency": 1042,
            "query": 1043,
            "cache": 1044,
            "size": 1045,
            "tmp": 1046,
            "table": 1047,
            "wait": 1048,
            "timeout": 1049,
            "old": 1050,
            "passwords": 1051,
            "engine": 1052,
            "log": 1053,
            "file": 1054,
            "buffer": 1055,
            "pool": 1056,
            "sort": 1057,
            "character": 1058,
            "flush": 1059,
            "at": 1060,
            "trx": 1061,
            "commit": 1062,
            "datadir": 1063,
            "net": 1064,
            "length": 1065,
            "key": 1066,
            "basedir": 1067,
            "port": 1068,
            "max": 1069,
            "connections": 1070,
            "read": 1071,
            "connect": 1072,
            "set": 1073,
            "allowed": 1074,
            "packet": 1075,
            "storage": 1076,
            "-": 1077,
            "rnd": 1078,
            "myisam": 1079,
            "additional": 1080,
            "mem": 1081,
            "default": 1082,
            "extra": 1083
        },
        "NDBD": {
            "HostName": 1084
        },
        "NDBD DEFAULT": {
            "ODirect": 1085,
            "DataDir": 1086,
            "TimeBetweenLocalCheckpoints": 1087,
            "NoOfFragmentLogFiles": 1088,
            "StopOnError": 1089,
            "Diskcheckpointspeed": 1090,
            "TimeBetweenGlobalCheckpoints": 1091,
            "NoOfReplicas": 1092,
            "RedoBuffer": 1093,
            "MaxNoOfConcurrentTransactions": 1094,
            "MaxNoOfConcurrentOperations": 1095,
            "Diskcheckpointspeedinrestart": 1096,
            "IndexMemory": 1097,
            "TransactionDeadlockDetectionTimeout": 1098,
            "UndoIndexBuffer": 1099,
            "LockExecuteThreadToCPU": 1100,
            "MaxNoOfAttributes": 1101,
            "SchedulerExecutionTimer": 1102,
            "LockMaintThreadsToCPU": 1103,
            "MaxNoOfOrderedIndexes": 1104,
            "RealtimeScheduler": 1105,
            "DataMemory": 1106,
            "SchedulerSpinTimer": 1107
        },
        "NDB_MGMD": {
            "HostName": 1108,
            "id": 1109
        },
        "TCP DEFAULT": {
            "ReceiveBufferMemory": 1110,
            "SendBufferMemory": 1111
        },
        "WinMySQLAdmin": {
            "QueryInterval": 1112
        },
        "WinMySQLadmin": {
            "log": 1113,
            "password": 1114,
            "_": 1115,
            "bin": 1116,
            "trust": 1117,
            "function": 1118,
            "creators": 1119,
            "error": 1120,
            "Server": 1121,
            "user": 1122
        },
        "client": {
            "character": 1123,
            "sock": 1124,
            "password": 1125,
            "local": 1126,
            "default": 1127,
            "_": 1128,
            "set": 1129,
            "pipe": 1130,
            "tmp": 1131,
            "mysql": 1132,
            "user": 1133,
            "pass": 1134,
            "port": 1135,
            "infile": 1136,
            "sets": 1137,
            "beep": 1138,
            "host": 1139,
            "socket": 1140,
            "/": 1141,
            "-": 1142,
            "loose": 1143,
            "dir": 1144,
            "no": 1145,
            ".": 1146
        },
        "client2": {
            "socket": 1147,
            "port": 1148
        },
        "global": {
            "app": 1149,
            "MYSQL": 1150,
            "_": 1151,
            "ROOT": 1152,
            "PASSWORD": 1153,
            "id": 1154,
            "mysql": 1155,
            "latest": 1156,
            "3": 1157,
            ":": 1158,
            "environment": 1159,
            "GLOBAL": 1160,
            "url": 1161,
            "restart": 1162,
            "DATABASE": 1163,
            "group": 1164,
            "concat": 1165,
            "max": 1166,
            "len": 1167,
            "conf": 1168,
            "volumes": 1169,
            "lib": 1170,
            "slave": 1171,
            "external": 1172,
            ".": 1173,
            "version": 1174,
            "{": 1175,
            "root": 1176,
            "Schema": 1177,
            "always": 1178,
            "depends": 1179,
            "on": 1180,
            "datadir": 1181,
            "address": 1182,
            "expose": 1183,
            "user": 1184,
            "Backend": 1185,
            "dockerfile": 1186,
            "provider": 1187,
            "!": 1188,
            "context": 1189,
            "data": 1190,
            "sync": 1191,
            "binlog": 1192,
            "db": 1193,
            "var": 1194,
            "services": 1195,
            "allowed": 1196,
            "packet": 1197,
            "generator": 1198,
            "Compose": 1199,
            "host": 1200,
            "SET": 1201,
            "-": 1202,
            "server": 1203,
            "same": 1204,
            "VITE": 1205,
            "API": 1206,
            "URL": 1207,
            "Dockerfile": 1208,
            "80": 1209,
            "Docker": 1210,
            "Frontend": 1211,
            "log": 1212,
            "[": 1213,
            "datasource": 1214,
            "backend": 1215,
            "image": 1216,
            "updates": 1217,
            "}": 1218,
            "old": 1219,
            "passwords": 1220,
            "backup": 1221,
            "general": 1222,
            "file": 1223,
            "bind": 1224,
            "expire": 1225,
            "logs": 1226,
            "days": 1227,
            "tmpdir": 1228,
            "cnf": 1229,
            "'": 1230,
            "Prisma": 1231,
            "#": 1232,
            "locking": 1233,
            "build": 1234,
            "skip": 1235,
            "format": 1236,
            "bin": 1237,
            "3000": 1238,
            "cat": 1239,
            "basedir": 1240,
            "port": 1241,
            "]": 1242,
            "ports": 1243,
            "innodb": 1244,
            "path": 1245,
            "d": 1246,
            "socket": 1247,
            "/": 1248,
            "client": 1249,
            "@": 1250,
            "frontend": 1251,
            "includedir": 1252,
            "my": 1253,
            "etc": 1254,
            "3306": 1255,
            "replicate": 1256
        },
        "isamchk": {
            "sort": 1257,
            "_": 1258,
            "buffer": 1259,
            "size": 1260,
            "mysql": 1261,
            "read": 1262,
            "!": 1263,
            "etc": 1264,
            "key": 1265,
            "d": 1266,
            "/": 1267,
            "includedir": 1268,
            "conf": 1269,
            "write": 1270,
            ".": 1271
        },
        "manager": {
            "cnf": 1272,
            "password": 1273,
            "address": 1274,
            "interval": 1275,
            "mysql": 1276,
            "include": 1277,
            "mysqld": 1278,
            "monitoring": 1279,
            "port": 1280,
            "bitnami": 1281,
            "!": 1282,
            "socket": 1283,
            "/": 1284,
            "-": 1285,
            "path": 1286,
            "opt": 1287,
            "pid": 1288,
            "default": 1289,
            "my": 1290,
            "bind": 1291,
            "file": 1292,
            ".": 1293
        },
        "mariadb": {
            "wsrep": 1294,
            "_": 1295,
            "sst": 1296,
            "auth": 1297,
            "method": 1298,
            "innodb": 1299,
            "locks": 1300,
            "unsafe": 1301,
            "for": 1302,
            "binlog": 1303,
            "default": 1304,
            "storage": 1305,
            "engine": 1306,
            "autoinc": 1307,
            "lock": 1308,
            "mode": 1309,
            "debug": 1310,
            "format": 1311,
            "cluster": 1312,
            "address": 1313,
            "provider": 1314,
            "name": 1315
        },
        "myisamchk": {
            "sort": 1316,
            "_": 1317,
            "buffer": 1318,
            "size": 1319,
            "character": 1320,
            "tokudb": 1321,
            "cache": 1322,
            "datadir": 1323,
            "skip": 1324,
            "dir": 1325,
            "key": 1326,
            "read": 1327,
            "bdb": 1328,
            "sets": 1329,
            "set": 1330,
            "socket": 1331,
            "-": 1332,
            "ft": 1333,
            "min": 1334,
            "word": 1335,
            "len": 1336,
            "variable": 1337,
            "write": 1338
        },
        "myisampack": {
            "-": 1339,
            "character": 1340,
            "dir": 1341,
            "sets": 1342
        },
        "mysql": {
            "character": 1343,
            "auto": 1344,
            "local": 1345,
            "user": 1346,
            "prompt": 1347,
            "port": 1348,
            "infile": 1349,
            "sets": 1350,
            "updates": 1351,
            "set": 1352,
            "max": 1353,
            "_": 1354,
            "allowed": 1355,
            "packet": 1356,
            "rehash": 1357,
            "socket": 1358,
            "server": 1359,
            "type": 1360,
            "-": 1361,
            "safe": 1362,
            "default": 1363,
            "database": 1364,
            "dir": 1365,
            "no": 1366
        },
        "mysql.server": {
            "use": 1367,
            "basedir": 1368,
            "-": 1369,
            "manager": 1370,
            "user": 1371
        },
        "mysql_cluster": {
            "connectstring": 1372,
            "-": 1373,
            "ndb": 1374
        },
        "mysql_upgrade": {
            "datadir": 1375,
            "basedir": 1376
        },
        "mysqladmin": {
            "sets": 1377,
            "character": 1378,
            "set": 1379,
            "default": 1380,
            "-": 1381,
            "dir": 1382,
            "user": 1383
        },
        "mysqlcheck": {
            "character": 1384,
            "set": 1385,
            "default": 1386,
            "-": 1387,
            "dir": 1388,
            "sets": 1389
        },
        "mysqld": {
            "start": 1390,
            "table": 1391,
            "_": 1392,
            "open": 1393,
            "cache": 1394,
            "binlog": 1395,
            "size": 1396,
            "admin": 1397,
            "innodb": 1398,
            "autoinc": 1399,
            "lock": 1400,
            "mode": 1401,
            "50M": 1402,
            "trust": 1403,
            "at": 1404,
            "transaction": 1405,
            "buffer": 1406,
            "pool": 1407,
            "instances": 1408,
            "data": 1409,
            "to": 1410,
            "log": 1411,
            "archive": 1412,
            "networking": 1413,
            "pid": 1414,
            "Please": 1415,
            "slave": 1416,
            "external": 1417,
            "file": 1418,
            "net": 1419,
            "write": 1420,
            "timeout": 1421,
            "ndb": 1422,
            "force": 1423,
            "send": 1424,
            "userstat": 1425,
            "running": 1426,
            "sort": 1427,
            "query": 1428,
            "min": 1429,
            "res": 1430,
            "unit": 1431,
            "stats": 1432,
            "on": 1433,
            "metadata": 1434,
            "slow": 1435,
            "max": 1436,
            "length": 1437,
            "for": 1438,
            "event": 1439,
            "scheduler": 1440,
            "heap": 1441,
            "plugin": 1442,
            "dir": 1443,
            "user": 1444,
            "myisam": 1445,
            "recover": 1446,
            "bin": 1447,
            "index": 1448,
            "key": 1449,
            "400M": 1450,
            "1": 1451,
            "tmp": 1452,
            "tables": 1453,
            "character": 1454,
            "set": 1455,
            "filesystem": 1456,
            "passwords": 1457,
            "sync": 1458,
            "concurrency": 1459,
            "tickets": 1460,
            "wild": 1461,
            "home": 1462,
            "(": 1463,
            "interactive": 1464,
            "read": 1465,
            "rnd": 1466,
            "delayed": 1467,
            "queue": 1468,
            "same": 1469,
            "server": 1470,
            "id": 1471,
            "cluster": 1472,
            "queries": 1473,
            "?": 1474,
            "processes": 1475,
            "sql": 1476,
            "lower": 1477,
            "case": 1478,
            "names": 1479,
            "relay": 1480,
            "old": 1481,
            "number": 1482,
            "strict": 1483,
            "skip": 1484,
            "use": 1485,
            "mmap": 1486,
            "indexes": 1487,
            "wsrep": 1488,
            "sst": 1489,
            "auth": 1490,
            "sysdate": 1491,
            "is": 1492,
            "now": 1493,
            "using": 1494,
            "support": 1495,
            "xa": 1496,
            "rpl": 1497,
            "semi": 1498,
            "enabled": 1499,
            "10M": 1500,
            "long": 1501,
            "autoextend": 1502,
            "increment": 1503,
            "default": 1504,
            "time": 1505,
            "zone": 1506,
            "variable": 1507,
            "pipe": 1508,
            "connection": 1509,
            "name": 1510,
            "collation": 1511,
            "definition": 1512,
            "flush": 1513,
            "trx": 1514,
            "commit": 1515,
            "'": 1516,
            "days": 1517,
            "io": 1518,
            "capacity": 1519,
            "querie": 1520,
            "ignore": 1521,
            "builtin": 1522,
            "not": 1523,
            "format": 1524,
            "updates": 1525,
            "runs": 1526,
            "wait": 1527,
            "connections": 1528,
            "basedir": 1529,
            "method": 1530,
            "fast": 1531,
            "shutdown": 1532,
            "alloc": 1533,
            "block": 1534,
            "logs": 1535,
            "ssl": 1536,
            "connect": 1537,
            "path": 1538,
            "cmp": 1539,
            "reset": 1540,
            "warnings": 1541,
            "repair": 1542,
            "threads": 1543,
            "waits": 1544,
            "ft": 1545,
            "stopword": 1546,
            "bulk": 1547,
            "insert": 1548,
            "statements": 1549,
            "arch": 1550,
            "3306": 1551,
            "password": 1552,
            "MASTER": 1553,
            "PORT": 1554,
            ":": 1555,
            "lc": 1556,
            "compressed": 1557,
            "protocol": 1558,
            "limit": 1559,
            "auto": 1560,
            "offset": 1561,
            "messages": 1562,
            "links": 1563,
            "and": 1564,
            ".": 1565,
            "locks": 1566,
            "unsafe": 1567,
            "datadir": 1568,
            "address": 1569,
            "errors": 1570,
            "sporadic": 1571,
            "infile": 1572,
            "symbolic": 1573,
            "master": 1574,
            "-": 1575,
            "do": 1576,
            "db": 1577,
            "additional": 1578,
            "mem": 1579,
            "federated": 1580,
            "condition": 1581,
            "group": 1582,
            "only": 1583,
            "handshake": 1584,
            "will": 1585,
            "dirty": 1586,
            "pages": 1587,
            "pct": 1588,
            "packet": 1589,
            "performance": 1590,
            "schema": 1591,
            "resolve": 1592,
            "general": 1593,
            "common": 1594,
            "sp": 1595,
            "recursion": 1596,
            "depth": 1597,
            "bind": 1598,
            "expire": 1599,
            "local": 1600,
            "machine": 1601,
            "init": 1602,
            "files": 1603,
            "in": 1604,
            "ca": 1605,
            "rollback": 1606,
            "delay": 1607,
            "5": 1608,
            "my": 1609,
            "node": 1610,
            "inno": 1611,
            "001": 1612,
            "retry": 1613,
            "count": 1614,
            "low": 1615,
            "mirrored": 1616,
            "groups": 1617,
            "locking": 1618,
            ">": 1619,
            "status": 1620,
            "bdb": 1621,
            "doublewrite": 1622,
            "record": 1623,
            "quite": 1624,
            "check": 1625,
            "info": 1626,
            "a": 1627,
            "strings": 1628,
            "options": 1629,
            "thread": 1630,
            "2G": 1631,
            "RAM": 1632,
            "256M": 1633,
            "preload": 1634,
            "allowed": 1635,
            "host": 1636,
            ";": 1637,
            "ibdata2": 1638,
            "safe": 1639,
            "core": 1640,
            "named": 1641,
            ")": 1642,
            "by": 1643,
            "load": 1644,
            "tmpdir": 1645,
            "error": 1646,
            "the": 1647,
            "join": 1648,
            "isolation": 1649,
            "checksum": 1650,
            "algorithm": 1651,
            "word": 1652,
            "len": 1653,
            "cmpmem": 1654,
            "<": 1655,
            "connectstring": 1656,
            "type": 1657,
            "priority": 1658,
            "per": 1659,
            "blackhole": 1660,
            "database": 1661,
            "Only": 1662,
            "replication": 1663,
            "cnf": 1664,
            "#": 1665,
            "blocks": 1666,
            "language": 1667,
            "pushdown": 1668,
            "PASSWORD": 1669,
            "function": 1670,
            "creators": 1671,
            "fail": 1672,
            "prealloc": 1673,
            "client": 1674,
            "socket": 1675,
            "/": 1676,
            "exact": 1677,
            "chroot": 1678,
            "recommended": 1679,
            "replicate": 1680,
            "mysql": 1681,
            "stack": 1682,
            "s": 1683,
            "adaptive": 1684,
            "flushing": 1685,
            "concat": 1686,
            "output": 1687,
            "purge": 1688,
            "sys": 1689,
            "malloc": 1690,
            "show": 1691,
            "quoted": 1692,
            "always": 1693,
            "recovery": 1694,
            "64M": 1695,
            "\"": 1696,
            "storage": 1697,
            "launch": 1698,
            "provider": 1699,
            "they": 1700,
            ",": 1701,
            "extra": 1702,
            "then": 1703,
            "syslog": 1704,
            "dump": 1705,
            "mainly": 1706,
            "sets": 1707,
            "cach": 1708,
            "back": 1709,
            "row": 1710,
            "enable": 1711,
            "short": 1712,
            "engine": 1713,
            "memlock": 1714,
            "sock": 1715,
            "Disabling": 1716,
            "need": 1717,
            "concurrent": 1718,
            "port": 1719,
            "neighbors": 1720,
            "sleep": 1721,
            "lag": 1722,
            "ndbcluster": 1723,
            "cert": 1724,
            "reporting": 1725,
            "that": 1726,
            "MySQL": 1727
        },
        "mysqld-safe": {
            "-": 1728,
            "error": 1729,
            "log": 1730
        },
        "mysqld.server": {
            "datadir": 1731,
            "port": 1732,
            "socket": 1733
        },
        "mysqld_multi": {
            "password": 1734,
            "mysqld": 1735,
            "log": 1736,
            "mysqladmin": 1737,
            "user": 1738
        },
        "mysqld_safe": {
            "innodb": 1739,
            "_": 1740,
            "thread": 1741,
            "concurrency": 1742,
            "password": 1743,
            "MASTER": 1744,
            "PORT": 1745,
            "id": 1746,
            "files": 1747,
            "mysqld": 1748,
            ">": 1749,
            ":": 1750,
            "bdb": 1751,
            "s": 1752,
            "open": 1753,
            "commit": 1754,
            "pid": 1755,
            "lib": 1756,
            "adaptive": 1757,
            "hash": 1758,
            "index": 1759,
            "log": 1760,
            "file": 1761,
            "size": 1762,
            "autoextend": 1763,
            "and": 1764,
            ".": 1765,
            "character": 1766,
            "quoted": 1767,
            "address": 1768,
            "user": 1769,
            "limit": 1770,
            "strings": 1771,
            "myisam": 1772,
            "recover": 1773,
            "options": 1774,
            "data": 1775,
            "home": 1776,
            "dir": 1777,
            "set": 1778,
            ";": 1779,
            "master": 1780,
            "(": 1781,
            "-": 1782,
            "server": 1783,
            "ibdata2": 1784,
            "flush": 1785,
            "method": 1786,
            "additional": 1787,
            "mem": 1788,
            "pool": 1789,
            "federated": 1790,
            "default": 1791,
            ",": 1792,
            ")": 1793,
            "by": 1794,
            "buffer": 1795,
            "queries": 1796,
            "error": 1797,
            "the": 1798,
            "nice": 1799,
            "syslog": 1800,
            "slow": 1801,
            "<": 1802,
            "strict": 1803,
            "mode": 1804,
            "number": 1805,
            "max": 1806,
            "dirty": 1807,
            "pages": 1808,
            "pct": 1809,
            "indexes": 1810,
            "resolve": 1811,
            "using": 1812,
            "malloc": 1813,
            "10M": 1814,
            "table": 1815,
            "locks": 1816,
            "err": 1817,
            "bind": 1818,
            "variable": 1819,
            "sql": 1820,
            "collation": 1821,
            "name": 1822,
            "'": 1823,
            "at": 1824,
            "trx": 1825,
            "not": 1826,
            "skip": 1827,
            "lock": 1828,
            "wait": 1829,
            "timeout": 1830,
            "query": 1831,
            "PASSWORD": 1832,
            "port": 1833,
            "in": 1834,
            "group": 1835,
            "path": 1836,
            "socket": 1837,
            "warnings": 1838,
            "chroot": 1839,
            "3306": 1840
        },
        "mysqldump": {
            "max": 1841,
            "quote": 1842,
            "allowed": 1843,
            "transaction": 1844,
            "mysqld": 1845,
            "_": 1846,
            "multi": 1847,
            "packet": 1848,
            "mysqlshow": 1849,
            "sets": 1850,
            "single": 1851,
            "names": 1852,
            "mysqlbug": 1853,
            "safe": 1854,
            "pl": 1855,
            "variable": 1856,
            "net": 1857,
            "write": 1858,
            "timeout": 1859,
            "mysqldump": 1860,
            ".": 1861,
            "character": 1862,
            "mysqlhotcopy": 1863,
            "mysqltest": 1864,
            "a": 1865,
            "mysqladmin": 1866,
            "!": 1867,
            "n": 1868,
            "config": 1869,
            "set": 1870,
            "quick": 1871,
            "sysconfig": 1872,
            "/": 1873,
            "-": 1874,
            "socket": 1875,
            "mysqlimport": 1876,
            "includedir": 1877,
            "default": 1878,
            "dir": 1879,
            "etc": 1880,
            "mysqlcheck": 1881,
            "mysqlbinlog": 1882
        },
        "mysqlhotcopy": {
            "timeout": 1883,
            "interactive": 1884,
            "_": 1885,
            "-": 1886,
            "wait": 1887
        },
        "mysqlimport": {
            "character": 1888,
            "set": 1889,
            "default": 1890,
            "-": 1891,
            "dir": 1892,
            "sets": 1893
        },
        "mysqlshow": {
            "character": 1894,
            "set": 1895,
            "default": 1896,
            "-": 1897,
            "dir": 1898,
            "sets": 1899
        },
        "ndb_mgm": {
            "-": 1900,
            "connect": 1901,
            "string": 1902
        },
        "ndbd": {
            "-": 1903,
            "host": 1904,
            "connect": 1905,
            "string": 1906
        },
        "safe_mysqld": {
            "error": 1907,
            "the": 1908,
            "password": 1909,
            "MASTER": 1910,
            "_": 1911,
            "PORT": 1912,
            "id": 1913,
            "<": 1914,
            "number": 1915,
            "err": 1916,
            "log": 1917,
            ">": 1918,
            "by": 1919,
            "s": 1920,
            "pid": 1921,
            "file": 1922,
            "and": 1923,
            "'": 1924,
            ".": 1925,
            "quoted": 1926,
            "datadir": 1927,
            "bin": 1928,
            "user": 1929,
            "open": 1930,
            "files": 1931,
            "limit": 1932,
            "PASSWORD": 1933,
            "port": 1934,
            "strings": 1935,
            ";": 1936,
            "socket": 1937,
            "master": 1938,
            "-": 1939,
            "(": 1940,
            "server": 1941,
            "default": 1942,
            ",": 1943,
            ")": 1944,
            "3306": 1945
        },
        "server": {
            "error": 1946,
            "general": 1947,
            "_": 1948,
            "log": 1949,
            "-": 1950,
            "file": 1951,
            "slow": 1952,
            "warning": 1953,
            "queries": 1954
        },
        "wampmysqld": {
            "innodb": 1955,
            "_": 1956,
            "thread": 1957,
            "concurrency": 1958,
            "password": 1959,
            "query": 1960,
            "cache": 1961,
            "size": 1962,
            "MASTER": 1963,
            "PORT": 1964,
            "id": 1965,
            ">": 1966,
            "s": 1967,
            "log": 1968,
            "file": 1969,
            "and": 1970,
            ".": 1971,
            "character": 1972,
            "quoted": 1973,
            "net": 1974,
            "buffer": 1975,
            "length": 1976,
            "datadir": 1977,
            "address": 1978,
            "user": 1979,
            "key": 1980,
            "strings": 1981,
            "data": 1982,
            "home": 1983,
            "dir": 1984,
            "max": 1985,
            "allowed": 1986,
            "packet": 1987,
            "set": 1988,
            ";": 1989,
            "master": 1990,
            "(": 1991,
            "-": 1992,
            "server": 1993,
            "read": 1994,
            "rnd": 1995,
            "storage": 1996,
            "additional": 1997,
            "mem": 1998,
            "pool": 1999,
            "federated": 2000,
            "default": 2001,
            ",": 2002,
            "myisam": 2003,
            "extra": 2004,
            "sort": 2005,
            ")": 2006,
            "by": 2007,
            "error": 2008,
            "the": 2009,
            "group": 2010,
            "<": 2011,
            "number": 2012,
            "tmp": 2013,
            "table": 2014,
            "bind": 2015,
            "engine": 2016,
            "'": 2017,
            "flush": 2018,
            "at": 2019,
            "trx": 2020,
            "commit": 2021,
            "locking": 2022,
            "skip": 2023,
            "binlog": 2024,
            "format": 2025,
            "bin": 2026,
            "lock": 2027,
            "wait": 2028,
            "timeout": 2029,
            "basedir": 2030,
            "port": 2031,
            "PASSWORD": 2032,
            "connections": 2033,
            "path": 2034,
            "socket": 2035,
            "arch": 2036,
            "3306": 2037
        }
    },
    "value_tokens": {
        " SUBSTITUTION": 2038,
        "\"": 2039,
        "\"\"": 2040,
        "\"${path}": 2041,
        "\"%password%\"": 2042,
        "\"<user>": 2043,
        "\"AU221AWP3012-slow.log\"": 2044,
        "\"AU221AWP3012.err\"": 2045,
        "\"AU221AWP3012.log\"": 2046,
        "\"C:": 2047,
        "\"C:\\Program Files\\MySQL\\MySQL Server 5.5\\\"": 2048,
        "\"C:\\Program Files\\MySQL\\MySQL Server 5.6\\\"": 2049,
        "\"C:\\ProgramData\\MySQL\\MySQL Server 5.5\\data\\\"": 2050,
        "\"C:\\ProgramData\\MySQL\\MySQL Server 5.6\\data\\\"": 2051,
        "\"C:\\rootfolder\\MySQL\\\"": 2052,
        "\"C:\\rootfolder\\MySQL\\data\\\"": 2053,
        "\"CM999-SV510-slow.log\"": 2054,
        "\"CM999-SV510.err\"": 2055,
        "\"CM999-SV510.log\"": 2056,
        "\"D:": 2057,
        "\"D:\\MySQL Datafiles\\data\\\"": 2058,
        "\"E:": 2059,
        "\"E:\\MySQLBinaryLogger\\mysql-bin.log\"": 2060,
        "\"E:\\MySQLData\\data\\\"": 2061,
        "\"F:": 2062,
        "\"G:": 2063,
        "\"GRAYSCALE-slow.log\"": 2064,
        "\"GRAYSCALE.err\"": 2065,
        "\"GRAYSCALE.log\"": 2066,
        "\"MySQL\"": 2067,
        "\"P:": 2068,
        "\"POOYA.err\"": 2069,
        "\"SQLSERVER-slow.log\"": 2070,
        "\"SQLSERVER.err\"": 2071,
        "\"SQLSERVER.log\"": 2072,
        "\"STRICT": 2073,
        "\"SYSTEM\"": 2074,
        "\"TCP": 2075,
        "\"W:": 2076,
        "\"WINGRA-DB01-slow.log\"": 2077,
        "\"WINGRA-DB01.err\"": 2078,
        "\"WINGRA-DB01.log\"": 2079,
        "\"c:": 2080,
        "\"e:": 2081,
        "\"host=localhost:1186\"": 2082,
        "\"itm-db\"": 2083,
        "\"my-pc.err\"": 2084,
        "\"my-pc.log\"": 2085,
        "\"mysql\"": 2086,
        "\"mysql.pid\"": 2087,
        "\"mysql:": 2088,
        "\"nodeid=2;": 2089,
        "\"prisma-client-js\"": 2090,
        "\"root\"": 2091,
        "#": 2092,
        "$": 2093,
        "${MYSQL": 2094,
        "${path}": 2095,
        "%": 2096,
        "%.norep%": 2097,
        "'": 2098,
        "''": 2099,
        "'+10:00'": 2100,
        "'Europe": 2101,
        "'SET NAMES latin1'": 2102,
        "'SET NAMES utf8'": 2103,
        "'SET collation": 2104,
        "(": 2105,
        "(\\u@atlas) [\\d]>\\\\": 2106,
        ")": 2107,
        "*": 2108,
        "****": 2109,
        "+": 2110,
        ",": 2111,
        "-": 2112,
        "-15": 2113,
        "-18": 2114,
        "-5": 2115,
        ".": 2116,
        "..": 2117,
        ".\\HomeDesktop-24.err": 2118,
        ".mysqlmanager.passwd": 2119,
        "/": 2120,
        "0": 2121,
        "0        #recommend 0, disable xa to negate extra disk flush": 2122,
        "0 #preserve table locks": 2123,
        "0 #recommend 0, disable xa to negate extra disk flush": 2124,
        "0 = perf, 1 = ACID": 2125,
        "0.0.0.0": 2126,
        "0.1": 2127,
        "00": 2128,
        "02": 2129,
        "0M": 2130,
        "1": 2131,
        "1 # JBN : On the slave, updates are more important than reads": 2132,
        "1 #If you have long running SELECT's against MyISAM tables and perform frequent updates consider setting": 2133,
        "1.2": 2134,
        "10": 2135,
        "10    #Increase connect": 2136,
        "10 #default: 10": 2137,
        "10.1.1.50": 2138,
        "10.10.1.7": 2139,
        "10.100.27.30": 2140,
        "10.255.35.55": 2141,
        "10.5.1.100": 2142,
        "100": 2143,
        "100   #default: 10": 2144,
        "100 #default: 10": 2145,
        "100 #recommend 5% of max": 2146,
        "1000": 2147,
        "10000": 2148,
        "100000": 2149,
        "1000000": 2150,
        "100000000": 2151,
        "1000M": 2152,
        "1002M": 2153,
        "100535": 2154,
        "100G": 2155,
        "100M": 2156,
        "101": 2157,
        "1024": 2158,
        "1024    #Increase table cache cache from 256 to 1024": 2159,
        "1024  # Default is 128": 2160,
        "10240": 2161,
        "1024K": 2162,
        "1024M": 2163,
        "1024M ## 128MB for every 1GB of RAM": 2164,
        "1024MB": 2165,
        "1028": 2166,
        "1028M": 2167,
        "1032": 2168,
        "103M": 2169,
        "1048": 2170,
        "1048576": 2171,
        "10485760": 2172,
        "104857600": 2173,
        "1048576000": 2174,
        "1048M": 2175,
        "1062": 2176,
        "1062,1146,1032": 2177,
        "1073741824": 2178,
        "10800": 2179,
        "10G": 2180,
        "10M": 2181,
        "10m": 2182,
        "110": 2183,
        "1140M": 2184,
        "1146": 2185,
        "11600M": 2186,
        "1186": 2187,
        "118M": 2188,
        "11G": 2189,
        "11M": 2190,
        "12": 2191,
        "120": 2192,
        "120   #Decrease interactive": 2193,
        "120 #changed from 60 to 120": 2194,
        "1200": 2195,
        "120M": 2196,
        "12288M": 2197,
        "124M": 2198,
        "125": 2199,
        "125M": 2200,
        "126M": 2201,
        "127": 2202,
        "127.0.0.1": 2203,
        "1275M": 2204,
        "128": 2205,
        "128K": 2206,
        "128M": 2207,
        "128M                 # 8GB RAM": 2208,
        "128M   #Increase query": 2209,
        "128M  #global buffer": 2210,
        "128M  #index buffer size for creating": 2211,
        "128M #global buffer": 2212,
        "128M #index buffer size for creating": 2213,
        "128M #max size of incoming data to allow": 2214,
        "128MB": 2215,
        "128k": 2216,
        "12G": 2217,
        "12G          # 16GB RAM": 2218,
        "12M": 2219,
        "13": 2220,
        "130G": 2221,
        "130M": 2222,
        "13100M": 2223,
        "131072": 2224,
        "136": 2225,
        "13M": 2226,
        "14": 2227,
        "1400": 2228,
        "14400": 2229,
        "148": 2230,
        "14G": 2231,
        "14M": 2232,
        "15": 2233,
        "150": 2234,
        "1500": 2235,
        "15000": 2236,
        "150000": 2237,
        "150M": 2238,
        "1510": 2239,
        "1512M": 2240,
        "1520": 2241,
        "153": 2242,
        "15360": 2243,
        "1536M": 2244,
        "154M": 2245,
        "156M": 2246,
        "15G": 2247,
        "15M": 2248,
        "16": 2249,
        "16    #recommend 2x core quantity": 2250,
        "16    #recommend 4x num disks": 2251,
        "16  #recommend 2x CPU cores": 2252,
        "16 ## Number of CPUs x 2": 2253,
        "16 #recommend 2x CPU cores": 2254,
        "16 #recommend 2x core quantity": 2255,
        "16 #recommend 4x num disks": 2256,
        "160": 2257,
        "16000": 2258,
        "1600M": 2259,
        "160M": 2260,
        "16384": 2261,
        "163840": 2262,
        "16777216": 2263,
        "168": 2264,
        "168M": 2265,
        "16G": 2266,
        "16GB": 2267,
        "16K": 2268,
        "16M": 2269,
        "16M    #Increase max allowed packet size from 1M to 16M": 2270,
        "16M   #Increase join": 2271,
        "16M #16": 2272,
        "16k": 2273,
        "17": 2274,
        "170M": 2275,
        "172": 2276,
        "172.16.110.21": 2277,
        "175M": 2278,
        "1768M": 2279,
        "17M": 2280,
        "18": 2281,
        "180": 2282,
        "1800MB": 2283,
        "1844674407370954751": 2284,
        "18916": 2285,
        "189M": 2286,
        "18G": 2287,
        "18M": 2288,
        "192": 2289,
        "192.168.10.16": 2290,
        "192.168.10.22": 2291,
        "192.168.10.23": 2292,
        "192.168.2.153": 2293,
        "192.241.X.X": 2294,
        "192K": 2295,
        "192M": 2296,
        "192M ## 32MB for every 1GB of RAM": 2297,
        "192k": 2298,
        "194": 2299,
        "196G": 2300,
        "19922M": 2301,
        "1998": 2302,
        "19M": 2303,
        "1G": 2304,
        "1G    #recommend 1G min": 2305,
        "1G    #recommend same size as tmp": 2306,
        "1G #recommend 1G min": 2307,
        "1G #recommend same size as tmp": 2308,
        "1GB": 2309,
        "1M": 2310,
        "1M      #default: 128K": 2311,
        "1M      #default: 128K, change in increments of 4K": 2312,
        "1M      #default: 256K": 2313,
        "1M      #default: 2M, larger may cause perf issues": 2314,
        "1M    #global buffer": 2315,
        "1M #default: 128K": 2316,
        "1M #default: 128K, change in increments of 4K": 2317,
        "1M #default: 256K": 2318,
        "1M #default: 2M, larger may cause perf issues": 2319,
        "1M #global buffer": 2320,
        "1MB": 2321,
        "1xx": 2322,
        "1xx.1xx.1xx.148": 2323,
        "2": 2324,
        "2             # WARNING : binlog-format = ROW IS MANDATORY": 2325,
        "2 #    = number of CPUs * 2": 2326,
        "2 # logs more information to log-error": 2327,
        "2 #2": 2328,
        "2 #default: 1, 2: enable insert for all instances": 2329,
        "20": 2330,
        "20.9.13.7": 2331,
        "200": 2332,
        "2000": 2333,
        "2000  #multiplier for memory usage via per-thread buffers": 2334,
        "2000 #multiplier for memory usage via per-thread buffers": 2335,
        "20000": 2336,
        "2000000": 2337,
        "2000K": 2338,
        "2000M": 2339,
        "200M": 2340,
        "200m": 2341,
        "2024M": 2342,
        "2048": 2343,
        "2048M": 2344,
        "2050": 2345,
        "205M": 2346,
        "206M": 2347,
        "208K": 2348,
        "2097144": 2349,
        "209715200": 2350,
        "20G": 2351,
        "20M": 2352,
        "21": 2353,
        "212K": 2354,
        "214M": 2355,
        "2192M": 2356,
        "22": 2357,
        "22000M": 2358,
        "227M": 2359,
        "22GB": 2360,
        "22K": 2361,
        "22M": 2362,
        "23": 2363,
        "2385M": 2364,
        "23G": 2365,
        "24": 2366,
        "2400": 2367,
        "24000": 2368,
        "24000 # max": 2369,
        "2401": 2370,
        "241": 2371,
        "246M": 2372,
        "24M": 2373,
        "25": 2374,
        "250": 2375,
        "2500": 2376,
        "250M": 2377,
        "252M": 2378,
        "255": 2379,
        "2555": 2380,
        "256": 2381,
        "256K": 2382,
        "256K    #default: 32bit: 192K, 64bit: 256K": 2383,
        "256K #default: 32bit: 192K, 64bit: 256K": 2384,
        "256M": 2385,
        "256M  #max file size for tmp table when creating": 2386,
        "256M  #max size for binlog before rolling": 2387,
        "256M # You can set ..": 2388,
        "256M ## 32MB for every 1GB of RAM": 2389,
        "256M #max file size for tmp table when creating": 2390,
        "256M #max size for binlog before rolling": 2391,
        "256k": 2392,
        "25G": 2393,
        "25M": 2394,
        "26": 2395,
        "262144": 2396,
        "268435456": 2397,
        "26G": 2398,
        "26M": 2399,
        "27": 2400,
        "270M": 2401,
        "27800": 2402,
        "27M": 2403,
        "2800M": 2404,
        "285M": 2405,
        "28800": 2406,
        "28G": 2407,
        "2G": 2408,
        "2K": 2409,
        "2M": 2410,
        "2M     #Increase read buffer size from 1M": 2411,
        "2M    #Increase query cache limit from 1048576 to 2M": 2412,
        "2M   #Increase sort buffer size from 1M": 2413,
        "2M # see http:": 2414,
        "2x": 2415,
        "3": 2416,
        "30": 2417,
        "30    #default -5.1.22: 5, +5.1.22: 10": 2418,
        "30 #default -5.1.22: 5, +5.1.22: 10": 2419,
        "300": 2420,
        "3000": 2421,
        "30000": 2422,
        "3000M": 2423,
        "300M": 2424,
        "300k": 2425,
        "3020": 2426,
        "3024M": 2427,
        "3072M": 2428,
        "30M": 2429,
        "31": 2430,
        "312M": 2431,
        "31536000": 2432,
        "32": 2433,
        "320M": 2434,
        "32384": 2435,
        "32768": 2436,
        "32G": 2437,
        "32G   #global buffer": 2438,
        "32K": 2439,
        "32M": 2440,
        "32M   # Doesn't seem to matter how big or small I make this": 2441,
        "32M   #global buffer": 2442,
        "32M   #max size of incoming data to allow": 2443,
        "32M #global buffer": 2444,
        "32MB": 2445,
        "32bit": 2446,
        "3306": 2447,
        "3307": 2448,
        "3310": 2449,
        "332M": 2450,
        "3333": 2451,
        "33554432": 2452,
        "33628": 2453,
        "339M": 2454,
        "33M": 2455,
        "34": 2456,
        "341": 2457,
        "343M": 2458,
        "3498K": 2459,
        "34M": 2460,
        "35": 2461,
        "350M": 2462,
        "354M": 2463,
        "35M": 2464,
        "360": 2465,
        "3600": 2466,
        "365M": 2467,
        "369M": 2468,
        "3752": 2469,
        "38": 2470,
        "38000": 2471,
        "384": 2472,
        "384M": 2473,
        "386K": 2474,
        "3G": 2475,
        "3M": 2476,
        "4": 2477,
        "4  # Try number of CPU's*2 for thread": 2478,
        "4 #binlog files older than this will be purged": 2479,
        "4 #thread quantity when running repairs": 2480,
        "40": 2481,
        "400": 2482,
        "400 # (ms)": 2483,
        "4000": 2484,
        "40000": 2485,
        "4000M": 2486,
        "400M": 2487,
        "4024": 2488,
        "4048M": 2489,
        "407M": 2490,
        "4092": 2491,
        "4096": 2492,
        "4096  # This is the default": 2493,
        "4096000": 2494,
        "4096M": 2495,
        "410M": 2496,
        "4110": 2497,
        "42M": 2498,
        "43M": 2499,
        "45": 2500,
        "450": 2501,
        "4500M": 2502,
        "45M": 2503,
        "47M": 2504,
        "48": 2505,
        "48G": 2506,
        "48M": 2507,
        "49M": 2508,
        "4G": 2509,
        "4K": 2510,
        "4M": 2511,
        "4M     #Increase read": 2512,
        "4M    #global buffer": 2513,
        "4M ## 1MB for every 1GB of RAM": 2514,
        "4M #global buffer": 2515,
        "4x": 2516,
        "5": 2517,
        "5-0-18.error-log": 2518,
        "5-0-18.log": 2519,
        "5-0-18.slow-log": 2520,
        "50": 2521,
        "500": 2522,
        "5000": 2523,
        "5000  # default is 3000 ms": 2524,
        "50000": 2525,
        "500000": 2526,
        "500000 # Default is 32768": 2527,
        "5000M": 2528,
        "500K": 2529,
        "500M": 2530,
        "500k": 2531,
        "500k #was 1M": 2532,
        "502M": 2533,
        "50G": 2534,
        "50M": 2535,
        "512": 2536,
        "512   #5.0.x <default: 64>": 2537,
        "512   #5.1.x, 5.5.x <default: 64>": 2538,
        "512K": 2539,
        "512K  #max query result size to put in cache": 2540,
        "512K #max query result size to put in cache": 2541,
        "512M": 2542,
        "512k": 2543,
        "52428800": 2544,
        "525": 2545,
        "52M": 2546,
        "53M": 2547,
        "540M": 2548,
        "55": 2549,
        "5510": 2550,
        "5533": 2551,
        "5534": 2552,
        "5535": 2553,
        "5555": 2554,
        "55M": 2555,
        "57600": 2556,
        "594M": 2557,
        "59M": 2558,
        "5G": 2559,
        "5M": 2560,
        "5MB": 2561,
        "6": 2562,
        "60": 2563,
        "60 #change from 60 to 30": 2564,
        "600": 2565,
        "6000M": 2566,
        "6024": 2567,
        "60G": 2568,
        "61": 2569,
        "612": 2570,
        "6144M": 2571,
        "622M": 2572,
        "63M": 2573,
        "64": 2574,
        "64-glibc23": 2575,
        "643M": 2576,
        "64K": 2577,
        "64K     #default: 32K, size of buffer to hold TX queries": 2578,
        "64K #default: 32K, size of buffer to hold TX queries": 2579,
        "64K read": 2580,
        "64M": 2581,
        "64M # Set ..": 2582,
        "64MB": 2583,
        "64bit": 2584,
        "65535": 2585,
        "65536": 2586,
        "65K": 2587,
        "65M": 2588,
        "66600": 2589,
        "666666": 2590,
        "66M": 2591,
        "67108864": 2592,
        "686M": 2593,
        "69M": 2594,
        "6G": 2595,
        "6GB": 2596,
        "6M": 2597,
        "7": 2598,
        "70": 2599,
        "700": 2600,
        "700M": 2601,
        "70331648": 2602,
        "71": 2603,
        "71M": 2604,
        "7200": 2605,
        "72M": 2606,
        "735M": 2607,
        "738M": 2608,
        "75": 2609,
        "750M": 2610,
        "75M": 2611,
        "766M": 2612,
        "768": 2613,
        "768K": 2614,
        "768M": 2615,
        "77M": 2616,
        "7M": 2617,
        "8": 2618,
        "8 ## Number of CPUs x 2": 2619,
        "80": 2620,
        "80 # (ms)": 2621,
        "800": 2622,
        "8000": 2623,
        "8000M": 2624,
        "800M": 2625,
        "8048M": 2626,
        "8096": 2627,
        "8098M": 2628,
        "80M": 2629,
        "812": 2630,
        "8192": 2631,
        "8192M": 2632,
        "8196": 2633,
        "8388608": 2634,
        "84": 2635,
        "84M": 2636,
        "86400": 2637,
        "8G": 2638,
        "8GB": 2639,
        "8K": 2640,
        "8M": 2641,
        "8M  ## 1MB for every 1GB of RAM": 2642,
        "8M ## 1MB for every 1GB of RAM": 2643,
        "8M #was 16M, lowered for RAM": 2644,
        "8k": 2645,
        "9": 2646,
        "90": 2647,
        "900": 2648,
        "9000": 2649,
        "900G": 2650,
        "900M": 2651,
        "9180": 2652,
        "94M": 2653,
        "96": 2654,
        "96G": 2655,
        "96M": 2656,
        "9999999": 2657,
        "999999999": 2658,
        "9M": 2659,
        ":": 2660,
        ";": 2661,
        "<": 2662,
        "<cluster": 2663,
        "<ip>": 2664,
        "<mypass>": 2665,
        "<node": 2666,
        "<password>": 2667,
        "<port>": 2668,
        "=": 2669,
        ">": 2670,
        "?": 2671,
        "?p=61": 2672,
        "@": 2673,
        "ACID": 2674,
        "ALWAYS": 2675,
        "AU221AWP3012": 2676,
        "AUTO": 2677,
        "AUTOMATED": 2678,
        "All": 2679,
        "All Users": 2680,
        "All Users.WINDOWS": 2681,
        "Application": 2682,
        "Application Data": 2683,
        "Applications": 2684,
        "Autonomy": 2685,
        "BACKUP": 2686,
        "BACKUP    #repair mode, recommend BACKUP": 2687,
        "BACKUP #repair mode, recommend BACKUP": 2688,
        "BACKUP,FORCE": 2689,
        "BINARY": 2690,
        "BY": 2691,
        "Backup": 2692,
        "Barracuda": 2693,
        "BinLogIndexFile": 2694,
        "C": 2695,
        "C:": 2696,
        "C:\\WebSerer\\MySQL\\data\\": 2697,
        "C:\\WebSerer\\MySQL\\data\\mysql-bin": 2698,
        "C:\\WebSerer\\MySQL\\data\\mysql-error.log": 2699,
        "C:\\WebSerer\\MySQL\\data\\mysql-slow.log": 2700,
        "C:\\WebSerer\\MySQL\\data\\mysql.pid": 2701,
        "C:\\WebSerer\\MySQL\\data\\mysql.sock": 2702,
        "C:\\\\Program Files (x86)\\\\Parallels\\\\Plesk\\\\Databases\\\\MySQL": 2703,
        "C:\\\\Program Files (x86)\\\\Parallels\\\\Plesk\\\\Databases\\\\MySQL\\\\Data": 2704,
        "C:\\wamp\\bin\\mysql\\mysql5.5.16\\data": 2705,
        "CM999": 2706,
        "COMMITTED": 2707,
        "CPU": 2708,
        "CPUs": 2709,
        "CREATE": 2710,
        "CRITICAL": 2711,
        "D": 2712,
        "DATA": 2713,
        "DATE": 2714,
        "DATE,NO": 2715,
        "DATE,ONLY": 2716,
        "DB01": 2717,
        "DB2": 2718,
        "DBs": 2719,
        "DIRECT": 2720,
        "DIVISION": 2721,
        "DSYNC": 2722,
        "Dados": 2723,
        "Dados de aplicativos": 2724,
        "Data": 2725,
        "Databases": 2726,
        "Datafiles": 2727,
        "Datareal": 2728,
        "Decrease": 2729,
        "Default": 2730,
        "Documents": 2731,
        "Documents and Settings": 2732,
        "Doesn": 2733,
        "E": 2734,
        "E:": 2735,
        "E:\\MySQL Datafiles\\Temp": 2736,
        "E:\\MySql\\Temp": 2737,
        "ENGINE": 2738,
        "ERROR": 2739,
        "Elements": 2740,
        "ErrorLog": 2741,
        "Europe": 2742,
        "F": 2743,
        "FILE": 2744,
        "FOR": 2745,
        "FORCE": 2746,
        "FORCE,BACKUP": 2747,
        "FULL": 2748,
        "Files": 2749,
        "G": 2750,
        "GRAYSCALE": 2751,
        "GROUP": 2752,
        "HDD1": 2753,
        "HomeDesktop": 2754,
        "I": 2755,
        "IN": 2756,
        "INNODB": 2757,
        "IP": 2758,
        "IP\"": 2759,
        "IS": 2760,
        "If": 2761,
        "Increase": 2762,
        "InnoDB": 2763,
        "JBN": 2764,
        "LOGGING": 2765,
        "LOGS": 2766,
        "MANDATORY": 2767,
        "MIXED": 2768,
        "MYISAM": 2769,
        "MYSQL": 2770,
        "Master": 2771,
        "Master-mysql-bin": 2772,
        "MyISAM": 2773,
        "MySQL": 2774,
        "MySQL Datafiles": 2775,
