{
    "key": [
        "- MYSQL_DATABASE",
        "- MYSQL_ROOT_PASSWORD",
        "- VITE_API_URL",
        "SET GLOBAL group_concat_max_len",
        "back_log",
        "basedir",
        "bind-address",
        "binlog_format",
        "character_set_filesystem",
        "character_set_server",
        "datadir",
        "default-character-set",
        "default-mysqld-path",
        "default-storage-engine",
        "default_character_set",
        "default_storage_engine",
        "expire_logs_days",
        "general_log",
        "general_log_file",
        "host",
        "innodb_additional_mem_pool_size",
        "innodb_autoinc_lock_mode",
        "innodb_buffer_pool_size",
        "innodb_data_file_path",
        "innodb_data_home_dir",
        "innodb_file_per_table",
        "innodb_flush_log_at_trx_commit",
        "innodb_force_recovery",
        "innodb_lock_wait_timeout",
        "innodb_locks_unsafe_for_binlog",
        "innodb_log_buffer_size",
        "innodb_log_file_size",
        "innodb_log_group_home_dir",
        "interactive_timeout",
        "join_buffer_size",
        "key_buffer",
        "key_buffer_size",
        "lc-messages-dir",
        "log-bin",
        "log-error",
        "log-slow-queries",
        "log_error",
        "log_slow_queries",
        "log_warning",
        "long_query_time",
        "max_allowed_packet",
        "max_binlog_size",
        "max_connections",
        "max_heap_table_size",
        "myisam-recover",
        "myisam_max_sort_file_size",
        "myisam_sort_buffer_size",
        "mysqladmin",
        "mysqld",
        "net_read_timeout",
        "net_write_timeout",
        "nice",
        "old_passwords",
        "open_files_limit",
        "password",
        "pid-file",
        "pid_file",
        "port",
        "provider",
        "query-cache-size",
        "query-cache-type",
        "query_cache_limit",
        "query_cache_size",
        "query_cache_type",
        "read_buffer",
        "read_buffer_size",
        "read_rnd_buffer_size",
        "replicate-same-server-id",
        "server-id",
        "slow_query_log_file",
        "socket",
        "sort_buffer_size",
        "sql-mode",
        "symbolic-links",
        "sync_binlog",
        "table_cache",
        "table_open_cache",
        "thread_cache_size",
        "thread_concurrency",
        "thread_stack",
        "tmp_table_size",
        "tmpdir",
        "url",
        "user",
        "wait_timeout",
        "write_buffer",
        "wsrep_cluster_address",
        "wsrep_cluster_name",
        "wsrep_debug",
        "wsrep_provider",
        "wsrep_sst_auth",
        "wsrep_sst_method"
    ],
    "value": [
        "\"\"",
        "\"D:/MySQL/\"",
        "\"D:/MySQL/data\"",
        "\"itm-db\"",
        "\"mysql\"",
        "\"mysql://root:mypass@db:3306/itm-db\"",
        "\"prisma-client-js\"",
        "${MYSQL_PASSWORD}",
        "/db/tmpfs01",
        "/mnt/ebs/mysql",
        "/mnt/tmp",
        "/mnt/var/lib/mysql",
        "/opt/bitnami/mysql",
        "/opt/bitnami/mysql/bin/mysqld.bin",
        "/opt/bitnami/mysql/data",
        "/opt/bitnami/mysql/tmp",
        "/opt/bitnami/mysql/tmp/manager.pid",
        "/opt/bitnami/mysql/tmp/mysql.sock",
        "/opt/mysql/server-5.6/share/english",
        "/tmp",
        "/usr",
        "/usr/bin/mysqladmin",
        "/usr/bin/mysqld_safe",
        "/usr/lib64/galera/libgalera_smm.so",
        "/usr/local/mysql",
        "/usr/local/mysql/data",
        "/usr/share/mysql",
        "/var/lib/mysql",
        "/var/lib/mysql/mysql.sock",
        "/var/log/mysql-slow-queries.log",
        "/var/log/mysql/error.log",
        "/var/log/mysql/mysql-bin",
        "/var/log/mysql/mysql.log",
        "/var/log/mysql/mysqld.log",
        "/var/log/mysql/slow.log",
        "/var/log/mysqld.log",
        "/var/mysql/mysql.sock",
        "/var/run/mysqld/mysqld.pid",
        "/var/run/mysqld/mysqld.sock",
        "/var/run/mysqld/mysqld2.sock",
        "0",
        "0.0.0.0",
        "1",
        "10",
        "100M",
        "127.0.0.1",
        "128",
        "128M",
        "15",
        "15360",
        "16M",
        "180",
        "192K",
        "1G",
        "1M",
        "2",
        "2 #    = number of CPUs * 2",
        "20M",
        "2500",
        "256",
        "256K",
        "256M",
        "256M # You can set .._buffer_pool_size up to",
        "256k",
        "2M",
        "2M # see http://emergent.urbanpug.com/?p=61",
        "30",
        "300",
        "3072M",
        "30M",
        "32M",
        "3306",
        "3307",
        "4",
        "400M",
        "4096",
        "48M",
        "4M",
        "50",
        "500M",
        "50M",
        "512",
        "512M",
        "5G",
        "60",
        "64M # Set .._log_file_size to 25% of buffer",
        "8",
        "800",
        "8000",
        "8192",
        "8M",
        "<mypass>",
        "BACKUP",
        "INNODB",
        "InnoDB",
        "MYISAM",
        "ROW",
        "corp-zabbix-server",
        "gcomm://mariadb-master.net,mariadb-slave.net",
        "http://backend:3000",
        "ibdata1:10M:autoextend",
        "ibdata1:10M:autoextend:max:128M",
        "latin1",
        "localhost",
        "log",
        "mariadb-user:cerner",
        "mixed",
        "mypassword",
        "mysql",
        "mysqld.bin",
        "mysqldump",
        "myusername",
        "on",
        "root",
        "utf8"
    ],
    "section": [
        "client",
        "client2",
        "embedded",
        "isamchk",
        "manager",
        "mariadb",
        "mariadb-5.5",
        "myisamchk",
        "mysql",
        "mysqladmin",
        "mysqld",
        "mysqld-5.5",
        "mysqld_multi",
        "mysqld_safe",
        "mysqldump",
        "mysqlhotcopy",
        "server"
    ],
    "flag": [
        "3",
        "3000",
        "3306",
        "80",
        "Backend",
        "Compose",
        "Disabling",
        "Docker",
        "Dockerfile",
        "Frontend",
        "MySQL",
        "Only",
        "Prisma",
        "Schema",
        "always",
        "app",
        "auto",
        "backend",
        "backup",
        "bitnami",
        "build",
        "cat",
        "client",
        "cnf",
        "conf",
        "context",
        "d",
        "datasource",
        "db",
        "depends_on",
        "dockerfile",
        "enable",
        "environment",
        "etc",
        "expose",
        "external",
        "federated",
        "frontend",
        "generator",
        "host",
        "image",
        "include",
        "includedir",
        "indexes",
        "innodb",
        "innodb_file_per_table",
        "interactive",
        "is",
        "latest",
        "lib",
        "local",
        "locking",
        "log",
        "my",
        "mysql",
        "mysql_data",
        "name",
        "named",
        "names",
        "need",
        "networking",
        "no",
        "not",
        "opt",
        "pipe",
        "ports",
        "processes",
        "queries",
        "quick",
        "quote",
        "recommended",
        "rehash",
        "resolve",
        "restart",
        "root",
        "safe",
        "services",
        "skip",
        "skip_networking",
        "skip_symbolic_links",
        "slave",
        "symbolic_links",
        "syslog",
        "timeout",
        "to",
        "updates",
        "use",
        "using",
        "var",
        "version",
        "volumes"
    ]
}