{
    "section": [
        "MYSQLD DEFAULT",
        "MySQLD",
        "NDBD",
        "NDBD DEFAULT",
        "NDB_MGMD",
        "NDB_MGMD DEFAULT",
        "TCP DEFAULT",
        "WinMySQLAdmin",
        "WinMySQLadmin",
        "client",
        "isamchk",
        "manager",
        "myisamchk",
        "myisampack",
        "mysql",
        "mysql.server",
        "mysql_cluster",
        "mysql_upgrade",
        "mysqladmin",
        "mysqlcheck",
        "mysqld",
        "mysqld-safe",
        "mysqld.server",
        "mysqld_multi",
        "mysqld_safe",
        "mysqldump",
        "mysqlhotcopy",
        "mysqlimport",
        "mysqlshow",
        "ndb_mgm",
        "ndbd",
        "safe_mysqld",
        "wampmysqld"
    ],
    "key": [
        ", MASTER_PASSWORD",
        ", MASTER_PORT",
        "2G_RAM",
        "DataDir",
        "DataMemory",
        "Diskcheckpointspeed",
        "Diskcheckpointspeedinrestart",
        "HostName",
        "IndexMemory",
        "LockExecuteThreadToCPU",
        "LockMaintThreadsToCPU",
        "MaxNoOfAttributes",
        "MaxNoOfConcurrentOperations",
        "MaxNoOfConcurrentTransactions",
        "MaxNoOfOrderedIndexes",
        "NoOfFragmentLogFiles",
        "NoOfReplicas",
        "ODirect",
        "QueryInterval",
        "RealtimeScheduler",
        "ReceiveBufferMemory",
        "RedoBuffer",
        "SchedulerExecutionTimer",
        "SchedulerSpinTimer",
        "SendBufferMemory",
        "Server",
        "StopOnError",
        "TimeBetweenGlobalCheckpoints",
        "TimeBetweenLocalCheckpoints",
        "TransactionDeadlockDetectionTimeout",
        "UndoIndexBuffer",
        "auto-increment-increment",
        "auto-increment-offset",
        "auto_increment_increment",
        "auto_increment_offset",
        "back-log",
        "back_log",
        "basedir",
        "bind-address",
        "bind_address",
        "binlog-do-db",
        "binlog-format",
        "binlog-ignore-db",
        "binlog_cache_size",
        "binlog_do_db",
        "binlog_format",
        "binlog_row_event_max_size",
        "blackhole",
        "bulk_insert_buffer_size",
        "character-set-server",
        "character-sets-dir",
        "character_set_client",
        "character_set_filesystem",
        "character_set_server",
        "chroot",
        "collation-server",
        "collation_server",
        "concurrent_insert",
        "connect-string",
        "connect_timeout",
        "database",
        "datadir",
        "default-character-set",
        "default-collation",
        "default-mysqld-path",
        "default-storage-engine",
        "default-table-type",
        "default-time-zone",
        "default_character_set",
        "default_storage_engine",
        "default_table_type",
        "default_time_zone",
        "delay-key-write",
        "delay_key_write",
        "delayed_insert_timeout",
        "delayed_queue_size",
        "engine-condition-pushdown",
        "err-log",
        "err_log",
        "event-scheduler",
        "event_scheduler",
        "expire-logs-days",
        "expire_logs_days",
        "flush_time",
        "ft_max_word_len",
        "ft_min_word_len",
        "ft_stopword_file",
        "general-log",
        "general_log",
        "general_log_file",
        "group_concat_max_len",
        "host",
        "id",
        "init-connect",
        "init_connect",
        "innodb",
        "innodb-buffer-pool-size",
        "innodb-file-per-table",
        "innodb-flush-log-at-trx-commit",
        "innodb-flush-method",
        "innodb-log-buffer-size",
        "innodb-log-file-size",
        "innodb-log-files-in-group",
        "innodb-open-files",
        "innodb-strict-mode",
        "innodb-thread-concurrency",
        "innodb_adaptive_flushing",
        "innodb_adaptive_hash_index",
        "innodb_additional_mem_pool_size",
        "innodb_autoextend_increment",
        "innodb_autoinc_lock_mode",
        "innodb_buffer_pool_instances",
        "innodb_buffer_pool_size",
        "innodb_checksum_algorithm",
        "innodb_cmp",
        "innodb_cmp_reset",
        "innodb_cmpmem",
        "innodb_cmpmem_reset",
        "innodb_commit_concurrency",
        "innodb_concurrency_tickets",
        "innodb_data_file_path",
        "innodb_data_home_dir",
        "innodb_doublewrite",
        "innodb_fast_shutdown",
        "innodb_file_format",
        "innodb_file_io_threads",
        "innodb_file_per_table",
        "innodb_flush_log_at_trx_commit",
        "innodb_flush_method",
        "innodb_flush_neighbors",
        "innodb_force_recovery",
        "innodb_io_capacity",
        "innodb_lock_wait_timeout",
        "innodb_lock_waits",
        "innodb_locks",
        "innodb_locks_unsafe_for_binlog",
        "innodb_log_arch_dir",
        "innodb_log_archive",
        "innodb_log_buffer_size",
        "innodb_log_file_size",
        "innodb_log_files_in_group",
        "innodb_log_group_home_dir",
        "innodb_max_dirty_pages_pct",
        "innodb_max_purge_lag",
        "innodb_mirrored_log_groups",
        "innodb_old_blocks_time",
        "innodb_open_files",
        "innodb_read_io_threads",
        "innodb_replication_delay",
        "innodb_rollback_on_timeout",
        "innodb_stats_on_metadata",
        "innodb_strict_mode",
        "innodb_support_xa",
        "innodb_table_locks",
        "innodb_thread_concurrency",
        "innodb_thread_sleep_delay",
        "innodb_trx",
        "innodb_use_sys_malloc",
        "innodb_write_io_threads",
        "interactive-timeout",
        "interactive_timeout",
        "join-buffer-size",
        "join_buffer",
        "join_buffer_size",
        "key-buffer-size",
        "key_buffer",
        "key_buffer_size",
        "language",
        "lc-messages-dir",
        "local-infile",
        "log",
        "log-bin",
        "log-bin-index",
        "log-bin-trust-function-creators",
        "log-error",
        "log-output",
        "log-queries-not-using-indexes",
        "log-slave-updates",
        "log-slow-queries",
        "log-warnings",
        "log_bin",
        "log_bin_index",
        "log_bin_trust_function_creators",
        "log_error",
        "log_output",
        "log_queries_not_using_indexes",
        "log_slave_updates",
        "log_slow_querie",
        "log_slow_queries",
        "log_warnings",
        "long-query-time",
        "long_query_time",
        "loose-local-infile",
        "low-priority-updates",
        "low_priority_updates",
        "lower-case-table-name",
        "lower_case_table_names",
        "malloc-lib",
        "master-connect-retry",
        "master-host",
        "master-password",
        "master-user",
        "max-allowed-packet",
        "max-connect-errors",
        "max-connections",
        "max-heap-table-size",
        "max_allowed_packet",
        "max_binlog_size",
        "max_connect_errors",
        "max_connections",
        "max_delayed_threads",
        "max_heap_table_size",
        "max_length_for_sort_data",
        "max_sort_length",
        "max_sp_recursion_depth",
        "max_tmp_table",
        "max_tmp_tables",
        "max_user_connections",
        "monitoring-interval",
        "myisam-recover",
        "myisam-sort-buffer-size",
        "myisam_max_extra_sort_file_size",
        "myisam_max_sort_file_size",
        "myisam_recover",
        "myisam_recover_options",
        "myisam_repair_threads",
        "myisam_sort_buffer_size",
        "myisam_use_mmap",
        "mysqladmin",
        "mysqld",
        "ndb-cluster-connection-pool",
        "ndb-connectstring",
        "ndb-force-send",
        "ndb-use-exact-count",
        "ndb_force_send",
        "net_buffer_length",
        "net_read_timeout",
        "net_retry_count",
        "net_write_timeout",
        "nice",
        "old-passwords",
        "old_passwords",
        "open-file-limit",
        "open-files",
        "open-files-limit",
        "open_files_limit",
        "pass",
        "password",
        "password-file",
        "performance_schema",
        "pid-file",
        "pid_file",
        "plugin-load",
        "plugin_dir",
        "port",
        "preload_buffer_size",
        "prompt",
        "query-cache-limit",
        "query-cache-size",
        "query-cache-type",
        "query_alloc_block_size",
        "query_cache_limit",
        "query_cache_min_res_unit",
        "query_cache_size",
        "query_cache_type",
        "query_prealloc_size",
        "read-buffer-size",
        "read-rnd-buffer-size",
        "read_buffer",
        "read_buffer_size",
        "read_rnd_buffer",
        "read_rnd_buffer_size",
        "record_buffer",
        "relay-log",
        "relay-log-index",
        "relay-log-purge",
        "relay_log",
        "relay_log_index",
        "relay_log_purge",
        "replicate-do-db",
        "replicate-ignore-db",
        "replicate-same-server-id",
        "replicate-wild-ignore-table",
        "rpl_semi_sync_master_enabled",
        "rpl_semi_sync_master_timeout",
        "rpl_semi_sync_slave_enabled",
        "server-id",
        "server_id",
        "server_type",
        "set-variable",
        "skip-external-locking",
        "slave-skip-errors",
        "slave_compressed_protocol",
        "slave_load_tmpdir",
        "slave_net_timeout",
        "slow-query-log",
        "slow-query-log-file",
        "slow_launch_time",
        "slow_query_log",
        "slow_query_log_file",
        "socket",
        "sort-buffer-size",
        "sort_buffer",
        "sort_buffer_size",
        "sql-mode",
        "sql_mode",
        "ssl-ca",
        "ssl-cert",
        "ssl-key",
        "symbolic-links",
        "sync-binlog",
        "sync_binlog",
        "sync_master_info",
        "sync_relay_log",
        "sync_relay_log_info",
        "sysdate-is-now",
        "sysdate_is_now",
        "table-cache",
        "table-definition-cache",
        "table-open-cache",
        "table_cache",
        "table_definition_cache",
        "table_open_cache",
        "thread-cache-size",
        "thread_cache",
        "thread_cache_size",
        "thread_concurrency",
        "thread_stack",
        "tmp-table-size",
        "tmp_table_size",
        "tmpdir",
        "tokudb_cache_size",
        "transaction-isolation",
        "transaction_isolation",
        "user",
        "userstat_running",
        "wait-timeout",
        "wait_timeout",
        "write_buffer",
        "wsrep_cluster_address",
        "wsrep_cluster_name",
        "wsrep_node_address",
        "wsrep_node_name",
        "wsrep_provider",
        "wsrep_sst_auth",
        "wsrep_sst_method"
    ],
    "value": [
        "\"\"",
        "\"${path}",
        "\"%password%\"",
        "\"/var/lib/mysql/mysql.sock\"",
        "\"<user>",
        "\"AU221AWP3012-slow.log\"",
        "\"AU221AWP3012.err\"",
        "\"AU221AWP3012.log\"",
        "\"C:/Autonomy/MySQL/\"",
        "\"C:/Backup/databases/MySql/data\\\"",
        "\"C:/Data/\"",
        "\"C:/Documents and Settings/All Users.WINDOWS/Application Data/MySQL/MySQL Server 5.1/Data/\"",
        "\"C:/Documents and Settings/All Users/Application Data/MySQL/MySQL Server 5.1/Data/\"",
        "\"C:/Documents and Settings/All Users/Application Data/MySQL/MySQL Server 5.5/Data/\"",
        "\"C:/Documents and Settings/All Users/Dados de aplicativos/MySQL/MySQL Server 5.5/Data/\"",
        "\"C:/MySQL/MySQL Server 5.5/\"",
        "\"C:/Program Files (x86)/MySQL/MySQL Server 5.1/\"",
        "\"C:/Program Files/MySQL\"",
        "\"C:/Program Files/MySQL/MySQL Server 5.0/\"",
        "\"C:/Program Files/MySQL/MySQL Server 5.0/Data/\"",
        "\"C:/Program Files/MySQL/MySQL Server 5.1/\"",
        "\"C:/Program Files/MySQL/MySQL Server 5.5/\"",
        "\"C:/Program Files/MySQL/MySQL Server 5.6/\"",
        "\"C:/Program Files/MySQL/MySQL Server 5.6//lib/plugin\"",
        "\"C:/Program Files/MySQL/MySQL Server 5.6/data\"",
        "\"C:/Program Files/MySQL/mysql-5.6.10-winx64/\"",
        "\"C:/ProgramData/MySQL/MySQL Server 5.1/Data/\"",
        "\"C:/ProgramData/MySQL/MySQL Server 5.5/Data/\"",
        "\"C:/ProgramData/MySQL/MySQL Server 5.5/data/\"",
        "\"C:/xampp/mysql\"",
        "\"C:/xampp/mysql/\"",
        "\"C:/xampp/mysql/data\"",
        "\"C:/xampp/mysql/mysql.sock\"",
        "\"C:/xampp/tmp\"",
        "\"C:\\Program Files\\MySQL\\MySQL Server 5.5\\\"",
        "\"C:\\Program Files\\MySQL\\MySQL Server 5.6\\\"",
        "\"C:\\ProgramData\\MySQL\\MySQL Server 5.5\\data\\\"",
        "\"C:\\ProgramData\\MySQL\\MySQL Server 5.6\\data\\\"",
        "\"C:\\rootfolder\\MySQL\\\"",
        "\"C:\\rootfolder\\MySQL\\data\\\"",
        "\"CM999-SV510-slow.log\"",
        "\"CM999-SV510.err\"",
        "\"CM999-SV510.log\"",
        "\"D:/DBs/\"",
        "\"D:/DBs/Data/\"",
        "\"D:/MySQL Datafiles/\"",
        "\"D:/MySQL Datafiles/data/\"",
        "\"D:/MySQL InnoDB Datafiles/\"",
        "\"D:/MySQL/\"",
        "\"D:/MySQL/data\"",
        "\"D:/MySQL/log_files/log-bin\"",
        "\"D:/MySQL/temp_files\"",
        "\"D:/ProgramData/MySQL/MySQL Server 5.6/data/\"",
        "\"D:/ProgramData/MySQL/MySQL Server 5.6/data\\\"",
        "\"D:\\MySQL Datafiles\\data\\\"",
        "\"E:/MySQL Datafiles/\"",
        "\"E:/MySQLData/data\"",
        "\"E:/Program Files/MySQL/MySQL Server 5.5/\"",
        "\"E:/Program Files/MySQL/MySQL Server 5.5/data/\"",
        "\"E:\\MySQLBinaryLogger\\mysql-bin.log\"",
        "\"E:\\MySQLData\\data\\\"",
        "\"F:/Program Files/MySQL/MySQL Server 5.1/\"",
        "\"G:/MySQLTemp\"",
        "\"GRAYSCALE-slow.log\"",
        "\"GRAYSCALE.err\"",
        "\"GRAYSCALE.log\"",
        "\"MySQL\"",
        "\"P:/MySQL Datafiles/\"",
        "\"P:/MySQL/MySQL Server 5.5/\"",
        "\"P:/MySQL/MySQL Server 5.5/Data/\"",
        "\"POOYA.err\"",
        "\"SQLSERVER-slow.log\"",
        "\"SQLSERVER.err\"",
        "\"SQLSERVER.log\"",
        "\"STRICT_TRANS_TABLES,NO_AUTO_CREATE_USER,NO_ENGINE_SUBSTITUTION\"",
        "\"SYSTEM\"",
        "\"TCP/IP\"",
        "\"W:/Applications/MySQL/MySQL Server 5.0/\"",
        "\"W:/Applications/MySQL/MySQL Server 5.0/Data/\"",
        "\"WINGRA-DB01-slow.log\"",
        "\"WINGRA-DB01.err\"",
        "\"WINGRA-DB01.log\"",
        "\"c:/MySQL Datafiles/\"",
        "\"c:/logs/mysql/mysqld.log\"",
        "\"c:/zpanel/bin/mysql/\"",
        "\"c:/zpanel/logs/mysql/mysql-slow.log\"",
        "\"c:/zpanel/logs/mysql/mysql.err\"",
        "\"c:/zpanel/logs/mysql/mysql.log\"",
        "\"e:/hafez/bin/mysql/mysql5.5.24/data/\"",
        "\"e:/hafez/bin/mysql/mysql5.5.24/tmp/\"",
        "\"host=localhost:1186\"",
        "\"my-pc.err\"",
        "\"my-pc.log\"",
        "\"mysql.pid\"",
        "\"nodeid=2;",
        "\"root\"",
        "${path}",
        "%.norep%",
        "''",
        "'+10:00'",
        "'Europe/Paris'",
        "'SET NAMES latin1'",
        "'SET NAMES utf8'",
        "'SET collation_connection = latin1_swedish_ci'",
        "'SET collation_connection = utf8_bin'",
        "'SET collation_connection = utf8_general_ci'",
        "(\\u@atlas) [\\d]>\\\\_",
        "****",
        "-15",
        "-18",
        "-5",
        ".",
        "../innodb",
        "../innodb/innodata:20M:autoextend:max:100M",
        "../innodb/innodb_arch_logs",
        "../logs/binary_logs",
        "./data-mysql",
        ".\\HomeDesktop-24.err",
        "/DATA/mysql",
        "/DATA/mysql/binlog",
        "/DATA/mysql/intranet02-slow.log",
        "/DATA/mysql/mysql-bin",
        "/DATA/mysql/mysqld.log",
        "/DB2/mysql",
        "/MySQL",
        "/Users/fsb/mysql",
        "/Volumes/Elements/database",
        "/Volumes/storage/Data",
        "/app/mysql/data",
        "/app/mysql/log/",
        "/app/mysql/log/error.log",
        "/app/mysql/var/mysql.sock",
        "/backup/mysql-cbt",
        "/backup/mysql-cbt/cbt-instance.err",
        "/backup/mysql-cbt/cbt-instance.pid",
        "/backup/mysql-cbt/data",
        "/backup/mysql-cbt/mysql.sock",
        "/backup/mysql-cbt/tmpdir",
        "/data/logs/mysql/error.log",
        "/data/logs/mysql/stats03-slowquery.log",
        "/data/mysql",
        "/data/mysql/",
        "/data/mysql/databases",
        "/data/mysql/galera1",
        "/data/mysql/mysql-bin",
        "/data/mysql/mysql-error.log",
        "/data/mysql/mysql-slow.log",
        "/data/mysql/mysql.pid",
        "/data/mysql/mysql.sock",
        "/data/mysql/temp",
        "/data2/var/lib/mysql",
        "/data2/var/log/mysql/mysql-bin",
        "/data_fio/mysqlbinlog/mysql-bin.log",
        "/data_fio/mysqldata",
        "/data_fio/mysqltmp",
        "/database/mysql",
        "/db/binlog/tlsgriffin01-bin",
        "/db/data",
        "/db/data/.mysqlmanager.passwd",
        "/db/data/mysql.sock",
        "/db/innodb",
        "/db/log/manager.pid",
        "/db/log/manager.sock",
        "/db/log/tlsgriffin01-err.log",
        "/db/log/tlsgriffin01-slow.log",
        "/db/mysql",
        "/db/mysql/data",
        "/db/mysql/log/mysql.err",
        "/db/mysql/log/mysqld.err",
        "/db/mysql/log/slow_query.log",
        "/db/mysql/master-bin",
        "/db/mysql/master-bin.index",
        "/db/tmp",
        "/db/tmpfs01",
        "/dev/shm",
        "/disk3/Datareal/oficial/mysql",
        "/elastiblockdb/log/mysql/mysql-slow.log",
        "/elastiblockdb/log/mysql/mysql_error.log",
        "/elastiblockdb/log/mysql/mysql_general.log",
        "/elastidb/lib/mysql",
        "/etc/mysql/ca-cert.pem",
        "/etc/mysql/cacert.pem",
        "/etc/mysql/server-cert.pem",
        "/etc/mysql/server-key.pem",
        "/export/data1/apps/local/mysql/data",
        "/export/data1/apps/local/mysql/logs/mysqld.log",
        "/export/data1/apps/local/mysql/logs/mysqld.pid",
        "/export/data1/apps/local/mysql/mysql.sock",
        "/home/backup/data/mysql-updates/",
        "/home/gleb/mysqls/chroot",
        "/home/iepm/mysql",
        "/home/iepm/mysql/mysql.sock",
        "/home/mysql",
        "/home/mysql/prod",
        "/home/var/lib/mysql",
        "/media/HDD1/comparable/mysql",
        "/media/mysql-ebs/datadir",
        "/media/mysql-ebs/log_bin/mysql-bin.log",
        "/media/ssd/db",
        "/mnt/mysql/tmp",
        "/mnt/mysql_tmp",
        "/mnt/persistent/mysql",
        "/mnt/persistent/mysql/",
        "/mnt/storage2TB/MySQL/data/",
        "/mysql",
        "/mysql/binary-logs/produccion-bin",
        "/mysql/binary-logs/produccion-relay-bin",
        "/mysql/data",
        "/mysql/innodb",
        "/mysql/innodb-logs",
        "/mysql/log",
        "/mysql/log/mysqld-err.log",
        "/mysql/log/mysqlderror.log",
        "/mysql/logs/mysql.err",
        "/mysql/logs/mysqld.err",
        "/mysql/logs/slow-queries.log",
        "/mysql/mydatabase",
        "/mysql/mydatabase/mysql.sock",
        "/mysql/mysqld.pid",
        "/mysql/mysqld.sock",
        "/mysql/slow.queries",
        "/mysql/tmp",
        "/mysql/tmp/mysql_slow_queries.log",
        "/mysql/tmp/mysqld.pid",
        "/mysqls/data",
        "/mysqls/logs/log_i/log_i",
        "/mysqls/logs/mysql.log-error.i",
        "/mysqls/logs/mysql.log-slow.i",
        "/mysqls/logs/mysql.log.i",
        "/mysqls/share/mysql/charsets",
        "/mysqls/tmp/mysql.pid.gleb.i",
        "/mysqls/tmp/mysql.sock.gleb.i",
        "/node1_css_mysql",
        "/node1_css_mysql_logs/mysql-bin",
        "/opt/bitnami/mysql",
        "/opt/bitnami/mysql/bin/mysqld.bin",
        "/opt/bitnami/mysql/data",
        "/opt/bitnami/mysql/tmp",
        "/opt/bitnami/mysql/tmp/manager.pid",
        "/opt/bitnami/mysql/tmp/mysql.sock",
        "/opt/local/lib/mysql5/bin/mysql",
        "/opt/local/libexec/mysqld",
        "/opt/local/var/db/mysql5",
        "/opt/mysql",
        "/opt/mysql-5.0.27",
        "/opt/mysql/server-5.6",
        "/opt/mysql/server-5.6/share/english",
        "/opt/pprd/log/mysql-bin.index",
        "/opt/pprd/log/mysql-bin.log",
        "/opt/pprd/mysql",
        "/srv/mysql",
        "/storage/mysql/data",
        "/tmp",
        "/tmp/mysql.galera1.sock",
        "/tmp/mysql.sock",
        "/tmp/mysql5.sock",
        "/tmp/mysql_live.sock",
        "/tmp/mysqld.sock",
        "/u01/app/mysql",
        "/u07/mysql/data",
        "/usr",
        "/usr/",
        "/usr/bin/mysqladmin",
        "/usr/bin/mysqld_safe",
        "/usr/lib/libgalera_smm.so",
        "/usr/lib64/libgalera_smm.so",
        "/usr/local/mysql",
        "/usr/local/mysql-5.0.18",
        "/usr/local/mysql-5.5.20/data",
        "/usr/local/mysql-5.5.20/log/error.log",
        "/usr/local/mysql-5.5.20/tmp",
        "/usr/local/mysql/data",
        "/usr/local/mysql/data/dev.pid",
        "/usr/local/mysql/logs/mysqld.log",
        "/usr/local/mysql/tmp/mysql.sock",
        "/usr/local/mysql5",
        "/usr/local/mysql5/data",
        "/usr/local/mysql5/error.log",
        "/usr/share/mysql",
        "/usr/share/mysql/charsets",
        "/usr/share/mysql/english",
        "/var/db/mysql",
        "/var/db/mysql/mysql.pid",
        "/var/db/mysql/mysqld.slow.log",
        "/var/db/mysql/razor-mysqld.log",
        "/var/db/mysql/razor-slow-log-by-katmai.log",
        "/var/lib",
        "/var/lib/mysql",
        "/var/lib/mysql-cluster",
        "/var/lib/mysql/",
        "/var/lib/mysql/certs/ca-cert.pem",
        "/var/lib/mysql/certs/server-cert.pem",
        "/var/lib/mysql/certs/server-key.pem",
        "/var/lib/mysql/data",
        "/var/lib/mysql/data/",
        "/var/lib/mysql/data/mysql-bin",
        "/var/lib/mysql/data/mysql-error.log",
        "/var/lib/mysql/data/mysql-slow.log",
        "/var/lib/mysql/data/mysql.pid",
        "/var/lib/mysql/data/mysql.sock",
        "/var/lib/mysql/err.log",
        "/var/lib/mysql/log-bin",
        "/var/lib/mysql/logs/borg-binlog.log",
        "/var/lib/mysql/logs/mysql-bin",
        "/var/lib/mysql/mysql-bin",
        "/var/lib/mysql/mysql-error.log",
        "/var/lib/mysql/mysql-log",
        "/var/lib/mysql/mysql-slow.log",
        "/var/lib/mysql/mysql-standard-5.0.17-linux-x86_64-glibc23/data",
        "/var/lib/mysql/mysql-standard-5.0.17-linux-x86_64-glibc23/share/mysql/english",
        "/var/lib/mysql/mysql.pid",
        "/var/lib/mysql/mysql.sock",
        "/var/lib/mysql/mysql.sock user=mysql",
        "/var/lib/mysql/mysql.sock1",
        "/var/lib/mysql/mysql1.pid1",
        "/var/lib/mysql/prod",
        "/var/lib/mysql/server.name.com.pid",
        "/var/lib/mysql/slow-log",
        "/var/lib/mysql/slow.log",
        "/var/lib/mysql/tmp",
        "/var/lib/mysql_ramdisk",
        "/var/lib/mysqllogs/bin-log",
        "/var/lib/mysqllogs/relay-log",
        "/var/lib/mysqllogs/slow-log",
        "/var/lib/mysqltmp",
        "/var/log/log-slow-queries.log",
        "/var/log/mysql-general.log",
        "/var/log/mysql-indexes.log",
        "/var/log/mysql-query.log",
        "/var/log/mysql-slow-queries.log",
        "/var/log/mysql-slow-query.log",
        "/var/log/mysql-slow.log",
        "/var/log/mysql.log",
        "/var/log/mysql/binlog",
        "/var/log/mysql/error.log",
        "/var/log/mysql/general.log",
        "/var/log/mysql/log-slow-queries.log",
        "/var/log/mysql/mysql-bin",
        "/var/log/mysql/mysql-bin.index",
        "/var/log/mysql/mysql-bin.log",
        "/var/log/mysql/mysql-bin.log.index",
        "/var/log/mysql/mysql-error.log",
        "/var/log/mysql/mysql-log.log",
        "/var/log/mysql/mysql-relay",
        "/var/log/mysql/mysql-relay-bin",
        "/var/log/mysql/mysql-relay-bin.index",
        "/var/log/mysql/mysql-slow.log",
        "/var/log/mysql/mysql.err",
        "/var/log/mysql/mysql.index",
        "/var/log/mysql/mysql.log",
        "/var/log/mysql/mysql_error.log",
        "/var/log/mysql/mysqld.err",
        "/var/log/mysql/mysqld.log",
        "/var/log/mysql/slow.log",
        "/var/log/mysql/slow_query.log",
        "/var/log/mysql/slowlog.log",
        "/var/log/mysql_slow.log",
        "/var/log/mysqld.error.log",
        "/var/log/mysqld.log",
        "/var/log/mysqld.slow.log",
        "/var/log/mysqld_all.log",
        "/var/log/mysqld_multi.log",
        "/var/log/mysqld_safe.log",
        "/var/log/mysqlslow.log",
        "/var/log/slow-log",
        "/var/mysql/live/data",
        "/var/run/mysql/mysql.sock",
        "/var/run/mysqld/mysql.pid",
        "/var/run/mysqld/mysqld-5-5-20.sock",
        "/var/run/mysqld/mysqld.pid",
        "/var/run/mysqld/mysqld.sock",
        "/var/run/mysqld/mysqld5.pid",
        "/var/tmp",
        "/var/www/data",
        "/var/www/data/mysql.sock",
        "/var/www/logs/log-slow-query.log",
        "/var/www/logs/mysqld.log",
        "/vu/mysql/dados",
        "/web/log/slowquery.log",
        "0",
        "0        #recommend 0, disable xa to negate extra disk flush",
        "0 #preserve table locks",
        "0 #recommend 0, disable xa to negate extra disk flush",
        "0.0.0.0",
        "0.1",
        "02",
        "0M",
        "1",
        "1 # JBN : On the slave, updates are more important than reads",
        "1 #If you have long running SELECT's against MyISAM tables and perform frequent updates consider setting",
        "1.2",
        "10",
        "10    #Increase connect_timeout from 5 to 10",
        "10 #default: 10",
        "10.1.1.50",
        "10.10.1.7",
        "10.100.27.30",
        "10.255.35.55",
        "10.5.1.100",
        "100",
        "100   #default: 10",
        "100 #default: 10",
        "100 #recommend 5% of max_connections",
        "1000",
        "10000",
        "100000",
        "1000000",
        "100000000",
        "1000M",
        "1002M",
        "100535",
        "100G",
        "100M",
        "101",
        "1024",
        "1024    #Increase table cache cache from 256 to 1024",
        "1024  # Default is 128",
        "10240",
        "1024K",
        "1024M",
        "1024M ## 128MB for every 1GB of RAM",
        "1024MB",
        "1028",
        "1028M",
        "103M",
        "1048",
        "1048576",
        "10485760",
        "104857600",
        "1048576000",
        "1048M",
        "1062,1146,1032",
        "1073741824",
        "10800",
        "10G",
        "10M",
        "10m",
        "1140M",
        "11600M",
        "118M",
        "11G",
        "11M",
        "12",
        "120",
        "120   #Decrease interactive_timeout from 28800 to 100",
        "120 #changed from 60 to 120",
        "1200",
        "120M",
        "12288M",
        "124M",
        "125",
        "125M",
        "126M",
        "127.0.0.1",
        "1275M",
        "128",
        "128K",
        "128M",
        "128M                 # 8GB RAM",
        "128M   #Increase query_cache_size from 0 to 128M",
        "128M  #global buffer",
        "128M  #index buffer size for creating/altering indexes",
        "128M #global buffer",
        "128M #index buffer size for creating/altering indexes",
        "128M #max size of incoming data to allow",
        "128MB",
        "128k",
        "12G",
        "12G          # 16GB RAM",
        "12M",
        "130G",
        "130M",
        "13100M",
        "131072",
        "136",
        "13M",
        "14",
        "1400",
        "14400",
        "14G",
        "14M",
        "15",
        "150",
        "1500",
        "15000",
        "150000",
        "150M",
        "1510",
        "1512M",
        "1520",
        "15360",
        "1536M",
        "154M",
        "156M",
        "15G",
        "15M",
        "16",
        "16    #recommend 2x core quantity",
        "16    #recommend 4x num disks",
        "16  #recommend 2x CPU cores",
        "16 ## Number of CPUs x 2",
        "16 #recommend 2x CPU cores",
        "16 #recommend 2x core quantity",
        "16 #recommend 4x num disks",
        "160",
        "16000",
        "1600M",
        "160M",
        "16384",
        "163840",
        "16777216",
        "168M",
        "16G",
        "16K",
        "16M",
        "16M    #Increase max allowed packet size from 1M to 16M",
        "16M   #Increase join_buffer_size from 131072 to 1M",
        "16M #16",
        "16k",
        "17",
        "170M",
        "172.16.110.21",
        "175M",
        "1768M",
        "17M",
        "18",
        "180",
        "1800MB",
        "1844674407370954751",
        "18916",
        "189M",
        "18G",
        "18M",
        "192",
        "192.168.10.16",
        "192.168.10.22",
        "192.168.10.23",
        "192.168.2.153",
        "192.241.X.X",
        "192K",
        "192M",
        "192M ## 32MB for every 1GB of RAM",
        "192k",
        "196G",
        "1998",
        "19M",
        "1G",
        "1G    #recommend 1G min",
        "1G    #recommend same size as tmp_table_size",
        "1G #recommend 1G min",
        "1G #recommend same size as tmp_table_size",
        "1M",
        "1M      #default: 128K",
        "1M      #default: 128K, change in increments of 4K",
        "1M      #default: 256K",
        "1M      #default: 2M, larger may cause perf issues",
        "1M    #global buffer",
        "1M #default: 128K",
        "1M #default: 128K, change in increments of 4K",
        "1M #default: 256K",
        "1M #default: 2M, larger may cause perf issues",
        "1M #global buffer",
        "1xx.1xx.1xx.148",
        "2",
        "2             # WARNING : binlog-format = ROW IS MANDATORY",
        "2 # logs more information to log-error",
        "2 #2/0 = perf, 1 = ACID",
        "2 #default: 1, 2: enable insert for all instances",
        "20",
        "20.9.13.7",
        "200",
        "2000",
        "2000  #multiplier for memory usage via per-thread buffers",
        "2000 #multiplier for memory usage via per-thread buffers",
        "20000",
        "2000000",
        "2000K",
        "2000M",
        "200M",
        "200m",
        "2024M",
        "2048",
        "2048M",
        "2050",
        "205M",
        "206M",
        "208K",
        "2097144",
        "209715200",
        "20G",
        "20M",
        "21",
        "212K",
        "214M",
        "2192M",
        "22",
        "22000M",
        "227M",
        "22GB",
        "22K",
        "22M",
        "2385M",
        "23G",
        "24",
        "2400",
        "24000 # max_connections * 18 ( 18 tables used in targeting query ) + delta",
        "2401",
        "246M",
        "24M",
        "25",
        "250",
        "2500",
        "250M",
        "252M",
        "2555",
        "256",
        "256K",
        "256K    #default: 32bit: 192K, 64bit: 256K",
        "256K #default: 32bit: 192K, 64bit: 256K",
        "256M",
        "256M  #max file size for tmp table when creating/alering indexes",
        "256M  #max size for binlog before rolling",
        "256M ## 32MB for every 1GB of RAM",
        "256M #max file size for tmp table when creating/alering indexes",
        "256M #max size for binlog before rolling",
        "256k",
        "25G",
        "25M",
        "26",
        "262144",
        "268435456",
        "26G",
        "26M",
        "270M",
        "27800",
        "27M",
        "2800M",
        "285M",
        "28800",
        "28G",
        "2G",
        "2K",
        "2M",
        "2M     #Increase read buffer size from 1M",
        "2M    #Increase query cache limit from 1048576 to 2M",
        "2M   #Increase sort buffer size from 1M",
        "3",
        "30",
        "30    #default -5.1.22: 5, +5.1.22: 10",
        "30 #default -5.1.22: 5, +5.1.22: 10",
        "300",
        "3000",
        "30000",
        "3000M",
        "300M",
        "300k",
        "3020",
        "3024M",
        "3072M",
        "30M",
        "312M",
        "31536000",
        "32",
        "320M",
        "32384",
        "32768",
        "32G",
        "32G   #global buffer",
        "32M",
        "32M   # Doesn't seem to matter how big or small I make this",
        "32M   #global buffer",
        "32M   #max size of incoming data to allow",
        "32M #global buffer",
        "3306",
        "3307",
        "3310",
        "332M",
        "3333",
        "33554432",
        "33628",
        "339M",
        "33M",
        "34",
        "341",
        "343M",
        "3498K",
        "34M",
        "350M",
        "354M",
        "35M",
        "360",
        "3600",
        "365M",
        "369M",
        "3752",
        "38",
        "38000",
        "384",
        "384M",
        "386K",
        "3G",
        "3M",
        "4",
        "4  # Try number of CPU's*2 for thread_concurrency",
        "4 #binlog files older than this will be purged",
        "4 #thread quantity when running repairs",
        "40",
        "400",
        "400 # (ms)",
        "4000",
        "40000",
        "4000M",
        "400M",
        "4024",
        "4048M",
        "407M",
        "4092",
        "4096",
        "4096  # This is the default",
        "4096000",
        "4096M",
        "410M",
        "4110",
        "42M",
        "43M",
        "450",
        "4500M",
        "45M",
        "47M",
        "48",
        "48G",
        "48M",
        "49M",
        "4G",
        "4K",
        "4M",
        "4M     #Increase read_rnd_buffer_size to 4M",
        "4M    #global buffer",
        "4M ## 1MB for every 1GB of RAM",
        "4M #global buffer",
        "5",
        "5-0-18.error-log",
        "5-0-18.log",
        "5-0-18.slow-log",
        "50",
        "500",
        "5000",
        "5000  # default is 3000 ms",
        "50000",
        "500000 # Default is 32768",
        "5000M",
        "500K",
        "500M",
        "500k #was 1M",
        "502M",
        "50G",
        "50M",
        "512",
        "512   #5.0.x <default: 64>",
        "512   #5.1.x, 5.5.x <default: 64>",
        "512K",
        "512K  #max query result size to put in cache",
        "512K #max query result size to put in cache",
        "512M",
        "512k",
        "52428800",
        "525",
        "52M",
        "53M",
        "540M",
        "5510",
        "5533",
        "5555",
        "55M",
        "57600",
        "594M",
        "59M",
        "5G",
        "5M",
        "5MB",
        "6",
        "60",
        "60 #change from 60 to 30",
        "600",
        "6000M",
        "6024",
        "60G",
        "612",
        "6144M",
        "622M",
        "63M",
        "64",
        "643M",
        "64K",
        "64K     #default: 32K, size of buffer to hold TX queries",
        "64K #default: 32K, size of buffer to hold TX queries",
        "64K read_rnd_buffer_size=256K",
        "64M",
        "64MB",
        "65535",
        "65536",
        "65K",
        "65M",
        "66600",
        "666666",
        "66M",
        "67108864",
        "686M",
        "69M",
        "6G",
        "6GB",
        "6M",
        "7",
        "70",
        "700",
        "700M",
        "70331648",
        "71",
        "71M",
        "7200",
        "72M",
        "735M",
        "738M",
        "75",
        "750M",
        "75M",
        "766M",
        "768",
        "768K",
        "768M",
        "77M",
        "7M",
        "8",
        "8 ## Number of CPUs x 2",
        "80",
        "80 # (ms)",
        "800",
        "8000",
        "8000M",
        "800M",
        "8048M",
        "8096",
        "8098M",
        "80M",
        "812",
        "8192",
        "8192M",
        "8196",
        "8388608",
        "84",
        "84M",
        "86400",
        "8G",
        "8K",
        "8M",
        "8M  ## 1MB for every 1GB of RAM",
        "8M ## 1MB for every 1GB of RAM",
        "8M #was 16M, lowered for RAM",
        "8k",
        "9",
        "90",
        "900",
        "9000",
        "900G",
        "900M",
        "9180",
        "94M",
        "96",
        "96G",
        "96M",
        "9999999",
        "999999999",
        "9M",
        "<ip>",
        "<node_ip_address>",
        "<password>",
        "<port>",
        "ALWAYS",
        "BACKUP",
        "BACKUP    #repair mode, recommend BACKUP",
        "BACKUP #repair mode, recommend BACKUP",
        "BACKUP,FORCE",
        "Barracuda",
        "C:/DATA",
        "C:/apachefriends/xampp/mysql",
        "C:/apachefriends/xampp/mysql/bin/mysqld.exe",
        "C:/apachefriends/xampp/mysql/data",
        "C:/web/mysql-5.5.31-win32/",
        "C:/web/mysql-5.5.31-win32/data/",
        "C:\\WebSerer\\MySQL\\data\\",
        "C:\\WebSerer\\MySQL\\data\\mysql-bin",
        "C:\\WebSerer\\MySQL\\data\\mysql-error.log",
        "C:\\WebSerer\\MySQL\\data\\mysql-slow.log",
        "C:\\WebSerer\\MySQL\\data\\mysql.pid",
        "C:\\WebSerer\\MySQL\\data\\mysql.sock",
        "C:\\\\Program Files (x86)\\\\Parallels\\\\Plesk\\\\Databases\\\\MySQL",
        "C:\\\\Program Files (x86)\\\\Parallels\\\\Plesk\\\\Databases\\\\MySQL\\\\Data",
        "C:\\wamp\\bin\\mysql\\mysql5.5.16\\data",
        "E:/CRITICAL_MYSQL_LOGGING/AUTOMATED_BINARY_LOGS/MySqlBinLog",
        "E:/CRITICAL_MYSQL_LOGGING/BinLogIndexFile",
        "E:/CRITICAL_MYSQL_LOGGING/ERROR_LOGS/ErrorLog",
        "E:/CRITICAL_MYSQL_LOGGING/QUERY_LOGS/QueryLog",
        "E:/CRITICAL_MYSQL_LOGGING/SLOW_QUERY_LOGS/SlowQueryLog",
        "E:\\MySQL Datafiles\\Temp",
        "E:\\MySql\\Temp",
        "FILE",
        "FORCE",
        "FORCE,BACKUP",
        "INNODB",
        "InnoDB",
        "MIXED",
        "MYISAM",
        "Master-mysql-bin",
        "MyISAM",
        "MySQL",
        "NDBCLUSTER",
        "NONE",
        "NO_AUTO_CREATE_USER",
        "NO_ENGINE_SUBSTITUTION,STRICT_TRANS_TABLES",
        "NO_UNSIGNED_SUBTRACTION",
        "OFF",
        "ON",
        "O_DIRECT",
        "O_DSYNC",
        "READ-COMMITTED",
        "READ-UNCOMMITTED",
        "REPEATABLE-READ",
        "REPEATABLE-READ #REPEATABLE-READ req for ACID, SERIALIZABLE req XA",
        "ROW",
        "STATEMENT",
        "STRICT_TRANS_TABLES,ERROR_FOR_DIVISION_BY_ZERO,NO_AUTO_CREATE_USER,NO_AUTO_VALUE_ON_ZERO,NO_ENGINE_SUBSTITUTION,NO_ZERO_DATE,NO_ZERO_IN_DATE,ONLY_FULL_GROUP_BY",
        "STRICT_TRANS_TABLES,NO_AUTO_CREATE_USER,NO_ENGINE_ SUBSTITUTION",
        "STRICT_TRANS_TABLES,NO_AUTO_CREATE_USER,NO_ENGINE_SUBSTITUTION",
        "STRICT_TRANS_TABLES,NO_ZERO_DATE,NO_ZERO_IN_DATE",
        "Slow.log",
        "TRADITIONAL",
        "TRUE",
        "UTC",
        "UTF8",
        "XX.XX.XXX.XXX",
        "XXXXXXXXXXXXXXXXX",
        "archive=ha_archive.so;",
        "asterisk",
        "backup,force",
        "barracuda",
        "boringname",
        "c:/binlogs",
        "c:/data/mysql/binarylog",
        "c:/mysql5",
        "c:/mysql5/data",
        "c:/wamp/bin/mysql/mysql5.1.30",
        "c:/wamp/bin/mysql/mysql5.1.30/data",
        "c:/wamp/bin/mysql/mysql5.5.16",
        "c:/wamp/bin/mysql/mysql5.5.16/data",
        "c:/wamp/bin/mysql/mysql5.5.24",
        "c:/wamp/bin/mysql/mysql5.5.24/data",
        "c:/wamp/bin/mysql/mysql5.5.8",
        "c:/wamp/bin/mysql/mysql5.5.8/data",
        "c:/wamp/logs/mysql.log",
        "c:\\Programs\\mysql-5.6.10-win32",
        "c:\\Programs\\mysql-5.6.10-win32\\data",
        "cv_lms_live",
        "d:/wamp/bin/mysql/mysql5.0.45",
        "d:/wamp/bin/mysql/mysql5.0.45/data",
        "d:/wamp/logs/mysql.log",
        "data_cluster",
        "database1",
        "database2",
        "db1 (\\\\d)>\\\\_",
        "db2",
        "db2-mysql-bin",
        "db2-relay-log",
        "error.log",
        "false",
        "gcomm://<cluster_ip_addresses>",
        "gcomm://localhost:5533,localhost:5534,localhost:5535",
        "ha_blackhole.so",
        "ha_innodb_plugin.so",
        "ha_innodb_plugin.so;",
        "host",
        "hostname.log",
        "ibdata1:100M:autoextend",
        "ibdata1:10M:autoextend",
        "ibdata1:10M:autoextend:max:4G",
        "ibdata1:10M;",
        "ibdata1:18M;",
        "ibdata1:194.19922M:autoextend",
        "ibdata1:2000M;",
        "ibdata1:20M:autoextend",
        "ibdata1:256M:autoextend",
        "ibdata1:512M:autoextend",
        "information_schema",
        "innodb",
        "innodb=ha_innodb_plugin.so;",
        "innodb_additional_mem_pool_size=500K",
        "innodb_buffer_pool_size=2M",
        "innodb_log_buffer_size=500K",
        "innodb_thread_concurrency=2",
        "itd002-bin",
        "jojoj",
        "key_buffer=16M",
        "key_buffer=20M",
        "key_buffer=4M",
        "key_buffer_size=400M",
        "laptop-bin",
        "latin1",
        "latin1_general_ci",
        "latin1_swedish_ci",
        "latin2",
        "local-infile=0",
        "localhost",
        "localhost:1186\"",
        "localhost:5533",
        "log",
        "log-slow-queries.log",
        "logFile.log",
        "master-relay-bin.index",
        "max_allowed_packet=15M",
        "max_allowed_packet=16M",
        "max_allowed_packet=1M",
        "max_connections=200",
        "metrics",
        "mixed",
        "mydb",
        "myisam",
        "myisam_sort_buffer_size=8M",
        "mysql",
        "mysql-bin",
        "mysql-error.err",
        "mysql-gen.log",
        "mysql-relay-bin",
        "mysql-relay-index",
        "mysql-slow.log",
        "mysqld-relay-bin",
        "mysqld-relay-bin.index",
        "mysqld.bin",
        "net_buffer_length=8K",
        "node1",
        "off",
        "office_full.log",
        "office_slow.err",
        "ojojojo",
        "on",
        "opera_subscription_store",
        "opfilter",
        "payment_exchange",
        "performance_schema",
        "query_cache_size=32M",
        "raddb1,raddb2",
        "read_buffer=2M",
        "read_buffer_size=512K",
        "relay-log-index",
        "replicate",
        "rewards1",
        "roomserv",
        "root",
        "row",
        "row                                 #",
        "rpl_semi_sync_master=semisync_master.so",
        "rpl_semi_sync_slave=semisync_slave.so",
        "rsync",
        "slowQry.log",
        "smart",
        "smart-bin",
        "smart2-relay-bin",
        "sort_buffer=20M",
        "sort_buffer=512K",
        "sort_buffer_size=1M",
        "table_cache=16384",
        "table_cache=4096",
        "table_cache=64",
        "tcmalloc",
        "test",
        "test_db1",
        "test_db2",
        "thread_cache=32",
        "tlsgriffin01",
        "tmp_table_size=128M",
        "traditional",
        "trent-bin",
        "true",
        "user=gleb",
        "username",
        "utf8",
        "utf8_bin",
        "utf8_general_ci",
        "utf8_unicode_ci",
        "wait_timeout=28800",
        "webdb,just_test",
        "whoat",
        "write_buffer=2M",
        "xtrabackup",
        "xxx.xxx.xxx.xxx",
        "xxxxx",
        "xxxxxxxxxxxxxxxx",
        "xy_payment_exchange"
    ],
    "flag": [
        "1",
        "10M",
        "256M",
        "3306",
        "400M",
        "5",
        "50M",
        "64M",
        "MySQL",
        "Please",
        "a",
        "admin",
        "always",
        "and",
        "auto",
        "autoextend",
        "bdb",
        "beep",
        "bin",
        "binlog",
        "builtin",
        "by",
        "cache",
        "character",
        "check",
        "client",
        "cnf",
        "common",
        "condition",
        "conf",
        "config",
        "core",
        "d",
        "data",
        "database",
        "default",
        "doublewrite",
        "dump",
        "enable",
        "engine",
        "error",
        "etc",
        "external",
        "extra",
        "fail",
        "federated",
        "file",
        "format",
        "general",
        "handshake",
        "host",
        "ibdata2",
        "ignore",
        "ignore_builtin_innodb",
        "includedir",
        "indexes",
        "inno_db_001",
        "innodb",
        "innodb_doublewrite",
        "innodb_file_per_table",
        "innodb_locks_unsafe_for_binlog",
        "innodb_status_file",
        "interactive",
        "is",
        "locking",
        "log",
        "log_long_format",
        "log_queries_not_using_indexes",
        "log_slow_queries",
        "log_warnings",
        "machine",
        "mainly",
        "manager",
        "master",
        "memlock",
        "my",
        "myisam_recover",
        "myisam_recover_options",
        "mysql",
        "mysqladmin",
        "mysqlbinlog",
        "mysqlbug",
        "mysqlcheck",
        "mysqld",
        "mysqld_multi",
        "mysqldump",
        "mysqlhotcopy",
        "mysqlimport",
        "mysqlshow",
        "mysqltest",
        "n",
        "name",
        "named",
        "names",
        "ndbcluster",
        "networking",
        "no",
        "not",
        "now",
        "number",
        "on",
        "only",
        "password",
        "performance_schema",
        "pipe",
        "pl",
        "port",
        "pushdown",
        "queries",
        "query",
        "quick",
        "quite",
        "quote",
        "quoted",
        "rehash",
        "reporting",
        "resolve",
        "runs",
        "s",
        "safe",
        "safe_mysqld",
        "set",
        "short",
        "show",
        "single",
        "skip",
        "skip_external_locking",
        "skip_host_cach",
        "skip_innodb",
        "skip_name_resolve",
        "skip_networking",
        "skip_slave_start",
        "skip_symbolic_links",
        "slave",
        "slow",
        "slow_query_log",
        "sock",
        "sporadic",
        "ssl",
        "start",
        "statements",
        "strings",
        "sysconfig",
        "sysdate",
        "syslog",
        "that",
        "the",
        "then",
        "they",
        "timeout",
        "tmp",
        "transaction",
        "updates",
        "use",
        "user",
        "using",
        "warnings",
        "will"
    ]
}