{
    "key": [
        "",
        "*dfs.replication*",
        "*fs.default.name*",
        "*hbase.zookeeper.quorum*",
        "*mapred.job.tracker*",
        "=\nhbase.coprocessor.region.classes",
        "=\nhbase.hregion.majorcompaction",
        "> fs.default.name\n> >> > >>",
        "custom.property",
        "d=\nfs.replication",
        "data.dfs.dir",
        "dfs",
        "dfs.balance.bandwidthPerSec",
        "dfs.block.access.key.update.interval",
        "dfs.block.access.token.enable",
        "dfs.block.access.token.lifetime",
        "dfs.block.replicator.classname",
        "dfs.block.size",
        "dfs.blockreport.initialDelay",
        "dfs.blockreport.split.threshold",
        "dfs.blocksize",
        "dfs.bytes-per-checksum",
        "dfs.client.block.writ=\ne.retries",
        "dfs.client.block.write.replace-datanode-on-failure.best-eff=\nort",
        "dfs.client.block.write.replace-datanode-on-failure.enable",
        "dfs.client.block.write.replace-datanode-on-failure.policy",
        "dfs.client.block.write.retries",
        "dfs.client.cached.conn.retry",
        "dfs.client.context",
        "dfs.client.datanode-restart.timeout",
        "dfs.client.domain.socket.data.traffic",
        "dfs.client.failover.proxy.provider.RhCluster",
        "dfs.client.failover.proxy.provider.bgdt-dev-hrb",
        "dfs.client.failover.proxy.provider.cluster",
        "dfs.client.failover.proxy.provider.hdfs-cluster",
        "dfs.client.failover.proxy.provider.lklcluster",
        "dfs.client.failover.proxy.provider.mycluster",
        "dfs.client.failover.proxy.provider.nameservice1",
        "dfs.client.failover.proxy.provider.nn",
        "dfs.client.failover.proxy.provider.ns1",
        "dfs.client.failover.proxy.provider.orahadoop",
        "dfs.client.failover.proxy.provider.test-cluster",
        "dfs.client.failover.proxy.provider.yisabigdata",
        "dfs.client.https.keystore.resource",
        "dfs.client.mmap.cache.size",
        "dfs.client.mmap.enabled",
        "dfs.client.read.shortcircuit",
        "dfs.client.read.shortcircuit.skip.checksum",
        "dfs.client.read.shortcircuit.streams.cache.expiry.ms",
        "dfs.client.use.datanode.hostname",
        "dfs.client.write.exclude.nodes.cache.expiry.interval.millis=",
        "dfs.cluster.administrators",
        "dfs.da=\ntanode.handler.count",
        "dfs.data.dir",
        "dfs.data.transfer.protection",
        "dfs.datanode.address",
        "dfs.datanode.available-space-volume-choosing-policy.balance=\nd-space-preference-fraction",
        "dfs.datanode.balance.bandwidthPerSec",
        "dfs.datanode.block.id.layout.upgrade.threads",
        "dfs.datanode.cache.revocation.timeout.ms",
        "dfs.datanode.data.dir",
        "dfs.datanode.data.dir.perm",
        "dfs.datanode.dns.interface",
        "dfs.datanode.du.pct",
        "dfs.datanode.du.reserved",
        "dfs.datanode.failed.volumes.tolerated",
        "dfs.datanode.handle=\nr.count",
        "dfs.datanode.handler.count",
        "dfs.datanode.hdfs-blocks-metadata.enabled",
        "dfs.datanode.http.address",
        "dfs.datanode.https.address",
        "dfs.datanode.ipc.address",
        "dfs.datanode.max.transfer.threads",
        "dfs.datanode.max.xc=\nievers",
        "dfs.datanode.max.xciever=\ns",
        "dfs.datanode.max.xcievers",
        "dfs.datanode.name.dir",
        "dfs.datanode.shared.file.descriptor.paths",
        "dfs.datanode.socket.write.tiemout",
        "dfs.datanode.socket.write.timeout",
        "dfs.domain.socket.path",
        "dfs.encrypt.data.transfer",
        "dfs.encrypt.data.transfer.algorithm",
        "dfs.federation.nameservices",
        "dfs.h=\nttp.address",
        "dfs.ha.automatic-failover.enabled",
        "dfs.ha.automatic-failover.enabled.RhCluster",
        "dfs.ha.fencing.methods",
        "dfs.ha.fencing.ssh.connect-timeout",
        "dfs.ha.fencing.ssh.private-key-files",
        "dfs.ha.log-roll.period",
        "dfs.ha.namenode.id",
        "dfs.ha.namenodes.RhCluster",
        "dfs.ha.namenodes.bgdt-dev-hrb",
        "dfs.ha.namenodes.hdfs-cluster",
        "dfs.ha.namenodes.lklcluster",
        "dfs.ha.namenodes.mycluster",
        "dfs.ha.namenodes.nameservice1",
        "dfs.ha.namenodes.ns1",
        "dfs.ha.namenodes.ns2",
        "dfs.ha.namenodes.orahadoop",
        "dfs.ha.namenodes.public-cluster",
        "dfs.ha.namenodes.yisabigdata",
        "dfs.ha.namenodescluster",
        "dfs.ha.tail-edits.period",
        "dfs.heartbeat.interval",
        "dfs.hosts",
        "dfs.hosts.exclude",
        "dfs.http.address",
        "dfs.http.policy",
        "dfs.https.address",
        "dfs.https.enable",
        "dfs.https.port",
        "dfs.https.server.keystore.resource",
        "dfs.image.compress",
        "dfs.info.port",
        "dfs.journalnode.edits.dir",
        "dfs.journalnode.kerberos.https.principal",
        "dfs.journalnode.kerberos.internal.spnego.principal",
        "dfs.journalnode.kerberos.principal",
        "dfs.journalnode.keytab.file",
        "dfs.name.dir",
        "dfs.name.dir.shared0",
        "dfs.name.dir.shared1",
        "dfs.name.edits.dir",
        "dfs.name.edits.dir.shared0",
        "dfs.name.edits.dir.shared1",
        "dfs.namenode.avoid.read.stale.datanode",
        "dfs.namenode.avoid.write.stale.datanode",
        "dfs.namenode.backup.http-address",
        "dfs.namenode.check.stale.datanode",
        "dfs.namenode.checkpoint.dir",
        "dfs.namenode.checkpoint.edits.dir",
        "dfs.namenode.checkpoint.period",
        "dfs.namenode.datanode.registration.ip-hostname-check",
        "dfs.namenode.decommission.nodes.per.interval",
        "dfs.namenode.delegation.key.update-interval",
        "dfs.namenode.delegation.token.max-lifetime",
        "dfs.namenode.delegation.token.renew-interval",
        "dfs.namenode.edits.dir",
        "dfs.namenode.edits.journal-plugin.qjournal",
        "dfs.namenode.edits.noeditlogchannelflush",
        "dfs.namenode.fs-limits.max-blocks-per-file",
        "dfs.namenode.fs-limits.max-component-length",
        "dfs.namenode.fs-limits.max-directory-items",
        "dfs.namenode.fs-limits.max-xattrs-per-inode",
        "dfs.namenode.handler.count",
        "dfs.namenode.hosts",
        "dfs.namenode.http-address",
        "dfs.namenode.http-address.RhCluster.nn1",
        "dfs.namenode.http-address.RhCluster.nn2",
        "dfs.namenode.http-address.bgdt-dev-hrb.nn1",
        "dfs.namenode.http-address.bgdt-dev-hrb.nn2",
        "dfs.namenode.http-address.cluster.nn1",
        "dfs.namenode.http-address.cluster.nn2",
        "dfs.namenode.http-address.hdfs-cluster.nn1",
        "dfs.namenode.http-address.hdfs-cluster.nn2",
        "dfs.namenode.http-address.lklcluster.nn1",
        "dfs.namenode.http-address.lklcluster.nn2",
        "dfs.namenode.http-address.mycluster.nn1",
        "dfs.namenode.http-address.mycluster.nn2",
        "dfs.namenode.http-address.nameservice1.namenode38",
        "dfs.namenode.http-address.nameservice1.namenode90",
        "dfs.namenode.http-address.ns1",
        "dfs.namenode.http-address.ns2",
        "dfs.namenode.http-address.orahadoop.node1",
        "dfs.namenode.http-address.orahadoop.node2",
        "dfs.namenode.http-address.public-cluster.nn1",
        "dfs.namenode.http-address.public-cluster.nn2",
        "dfs.namenode.http-address.yisabigdata.namenode1",
        "dfs.namenode.http-address.yisabigdata.namenode2",
        "dfs.namenode.https-address.bgdt-dev-hrb.nn1",
        "dfs.namenode.https-address.bgdt-dev-hrb.nn2",
        "dfs.namenode.https-address.nameservice1.namenode38",
        "dfs.namenode.https-address.nameservice1.namenode90",
        "dfs.namenode.kerberos.https.principal",
        "dfs.namenode.kerberos.internal.spnego.principal",
        "dfs.namenode.kerberos.principal",
        "dfs.namenode.keytab.file",
        "dfs.namenode.list.cache.pools.num.responses",
        "dfs.namenode.logging.level",
        "dfs.namenode.max.objects",
        "dfs.namenode.name.dir",
        "dfs.namenode.replication.min",
        "dfs.namenode.resource.du.reserved",
        "dfs.namenode.retrycache.expirytime.millis",
        "dfs.namenode.rpc-address.RhCluster.nn1",
        "dfs.namenode.rpc-address.RhCluster.nn2",
        "dfs.namenode.rpc-address.bgdt-dev-hrb.nn1",
        "dfs.namenode.rpc-address.bgdt-dev-hrb.nn2",
        "dfs.namenode.rpc-address.cluster.nn1",
        "dfs.namenode.rpc-address.cluster.nn2",
        "dfs.namenode.rpc-address.clusterA.clust=\nerAnn1",
        "dfs.namenode.rpc-address.hdfs-cluster.nn1",
        "dfs.namenode.rpc-address.hdfs-cluster.nn2",
        "dfs.namenode.rpc-address.lklcluster.nn1",
        "dfs.namenode.rpc-address.lklcluster.nn2",
        "dfs.namenode.rpc-address.mycluster.nn1",
        "dfs.namenode.rpc-address.mycluster.nn2",
        "dfs.namenode.rpc-address.mycluster.nn3",
        "dfs.namenode.rpc-address.nameservice1.namenode38",
        "dfs.namenode.rpc-address.nameservice1.namenode90",
        "dfs.namenode.rpc-address.ns.nn1",
        "dfs.namenode.rpc-address.ns.nn2",
        "dfs.namenode.rpc-address.ns1",
        "dfs.namenode.rpc-address.ns1.nn1",
        "dfs.namenode.rpc-address.ns1.nn3",
        "dfs.namenode.rpc-address.ns2",
        "dfs.namenode.rpc-address.ns2.nn2",
        "dfs.namenode.rpc-address.ns2.nn4",
        "dfs.namenode.rpc-address.orahadoop.node1",
        "dfs.namenode.rpc-address.orahadoop.node2",
        "dfs.namenode.rpc-address.public-cluster.nn1",
        "dfs.namenode.rpc-address.public-cluster.nn2",
        "dfs.namenode.rpc-address.yisabigdata.namenode1",
        "dfs.namenode.rpc-address.yisabigdata.namenode2",
        "dfs.namenode.rpc-bind-host",
        "dfs.namenode.secondary.http-address",
        "dfs.namenode.secondary.http-address.ns1",
        "dfs.namenode.secondary.http-address.ns2",
        "dfs.namenode.secondary.https-address",
        "dfs.namenode.secondaryhttp-address.ns1",
        "dfs.namenode.servicerpc-bind-host",
        "dfs.namenode.shared.edits.dir",
        "dfs.namenode.shared.edits.dir.commoncluster.cnn1",
        "dfs.namenode.shared.edits.dir.commoncluster.cnn2",
        "dfs.namenode.shared.edits.dir.hbasecluster.hnn1",
        "dfs.namenode.shared.edits.dir.hbasecluster.hnn2",
        "dfs.namenode.stale.datanode.interval",
        "dfs.namenode.startup.delay.block.deletion.sec",
        "dfs.namenode.support.allow.format",
        "dfs.namenode.write.stale.datanode.ratio",
        "dfs.nameservices",
        "dfs.nfs.exports.allowed.hosts",
        "dfs.nfs3.export.point",
        "dfs.permissions",
        "dfs.permissions.enabled",
        "dfs.permissions.supergroup",
        "dfs.permissions.superusergroup",
        "dfs.replication",
        "dfs.replication.max",
        "dfs.safemode.extension",
        "dfs.safemode.min.datanodes",
        "dfs.secondary.http.address",
        "dfs.secondary.info.port",
        "dfs.secondary.namenode.kerberos.https.principal",
        "dfs.secondary.namenode.kerberos.internal.spnego.principal",
        "dfs.secondary.namenode.kerberos.principal",
        "dfs.secondary.namenode.keytab.file",
        "dfs.secondaryhttp.address",
        "dfs.socket.timeout",
        "dfs.stream-buffer-size",
        "dfs.support.append",
        "dfs.support.broken.append",
        "dfs.user.home.dir.prefix",
        "dfs.web.authentication.kerberos.keytab",
        "dfs.web.authentication.kerberos.principal",
        "dfs.web.ugi",
        "dfs.webhdfs.enabled",
        "dfs.webhdfs.user.provider.user.pattern",
        "file.blocksize",
        "file.bytes-per-checksum",
        "file.replication",
        "file.stream-buffer-size",
        "fs.AbstractFileSystem.har.impl",
        "fs.AbstractFileSystem.hdfs.impl",
        "fs.automatic.close",
        "fs.checkpoint.dir",
        "fs.checkpoint.period",
        "fs.client.resolve.remote.symlinks",
        "fs.default.nam=\ne\n>",
        "fs.default.nam=\ne\n> >>",
        "fs.default.name",
        "fs.default.name\n> > >>",
        "fs.default.name\n>> > >>",
        "fs.defaultFS",
        "fs.defualt.name",
        "fs.df.interval",
        "fs.du.interval",
        "fs.ftp.host",
        "fs.ftp.host.port",
        "fs.har.impl.disable.cache",
        "fs.hdfs.impl",
        "fs.inmemory.size.mb",
        "fs.permissions.umask-mode",
        "fs.quobyte.impl",
        "fs.s3.awsAccessKeyId",
        "fs.s3.awsSecretAccessKey",
        "fs.s3.block.size",
        "fs.s3.maxRetries",
        "fs.s3a.attempts.maximum",
        "fs.s3a.connection.maximum",
        "fs.s3a.connection.timeout",
        "fs.s3a.impl",
        "fs.s3a.multipart.purge",
        "fs.s3a.paging.maximum",
        "fs.s3n.awsAccessKeyId",
        "fs.s3n.awsSecretAccessKey",
        "fs.s3n.block.size",
        "fs.s3n.impl",
        "fs.s3n.multipart.uploads.enabled",
        "fs.tmp.dir",
        "fs.trash.checkpoint.interval",
        "fs.trash.interval",
        "fs.viewfs.mounttabl=\ne.default.link./home/storage/mount1",
        "fs.viewfs.mounttable.ClusterX.link./dir2",
        "fs.viewfs.mounttable.ClusterX.link./dir3",
        "fs.viewfs.mounttable.ClusterX.link./dir4",
        "fs.viewfs.mounttable.ClusterX.link./dir5",
        "fs.viewfs.mounttable.cluster.link./apachelogs",
        "fs.viewfs.mounttable.cluster.link./datausers",
        "fs.viewfs.mounttable.default.link./NN1Home",
        "fs.viewfs.mounttable.default.link./NN2Home",
        "ftp.blocksize",
        "ftp.bytes-per-checksum",
        "ftp.replication",
        "ftp.stream-buffer-size",
        "h=\nbase.cluster.distributed",
        "ha.failover-controller.graceful-fence.rpc-timeout.ms",
        "ha.health-monitor.connect-retry-interval.ms",
        "ha.health-monitor.rpc-timeout.ms",
        "ha.health-monitor.sleep-after-disconnect.ms",
        "ha.zookeeper.quorum",
        "hadoop.fuse.timer.period",
        "hadoop.http.authentication.cookie.domain",
        "hadoop.http.authentication.kerberos.keytab",
        "hadoop.http.authentication.kerberos.principal",
        "hadoop.http.authentication.signature.secret",
        "hadoop.http.authentication.signature.secret.file",
        "hadoop.http.authentication.simple.anonymous.allowed",
        "hadoop.http.authentication.token.validity",
        "hadoop.http.authentication.type",
        "hadoop.http.filter.initializers",
        "hadoop.job.history.user.location",
        "hadoop.kerberos.kinit.command",
        "hadoop.log.dir",
        "hadoop.logfile.count",
        "hadoop.logfile.size",
        "hadoop.pipes.executable",
        "hadoop.pipes.java.recordreader",
        "hadoop.pipes.java.recordwriter",
        "hadoop.profil=\ne",
        "hadoop.proxyuser.*.groups",
        "hadoop.proxyuser.*.hosts",
        "hadoop.proxyuser.HTTP.groups",
        "hadoop.proxyuser.HTTP.hosts",
        "hadoop.proxyuser.flume.hosts",
        "hadoop.proxyuser.hadoop.hosts",
        "hadoop.proxyuser.hbase.groups",
        "hadoop.proxyuser.hbase.hosts",
        "hadoop.proxyuser.hdfs.groups",
        "hadoop.proxyuser.hdfs.hosts",
        "hadoop.proxyuser.hive.groups",
        "hadoop.proxyuser.hive.hosts",
        "hadoop.proxyuser.hue.groups",
        "hadoop.proxyuser.hue.hosts",
        "hadoop.proxyuser.nfsserver.groups",
        "hadoop.proxyuser.nfsserver.hosts",
        "hadoop.proxyuser.oozie.hosts",
        "hadoop.proxyuser.root.groups",
        "hadoop.proxyuser.root.hosts",
        "hadoop.proxyuser.xeon.groups",
        "hadoop.proxyuser.xeon.hosts",
        "hadoop.proxyuser.yarn.groups",
        "hadoop.proxyuser.yarn.hosts",
        "hadoop.root.logger",
        "hadoop.rpc.protection",
        "hadoop.rpc.socket.factory.class.default",
        "hadoop.security.auth_to_local",
        "hadoop.security.authentication",
        "hadoop.security.authorization",
        "hadoop.security.crypto.cipher.suite",
        "hadoop.security.group.mapping.ldap.directory.search.timeout=",
        "hadoop.security.group.mapping.ldap.search.filter.group",
        "hadoop.security.group.mapping.ldap.search.filter.user",
        "hadoop.security.groups.cache.warn.after.ms",
        "hadoop.security.java.secure.random.algorithm",
        "hadoop.security.kms.client.encrypted.key.cache.low-watermar=\nk",
        "hadoop.security.kms.client.encrypted.key.cache.num.refill.t=\nhreads",
        "hadoop.security.random.device.file.path",
        "hadoop.security.token.service.use_ip",
        "hadoop.security.use-weak-http-crypto",
        "hadoop.ssl.enabled",
        "hadoop.tmp.d=\nir",
        "hadoop.tmp.dir",
        "hadoop.user.group.static.mapping.overrides",
        "hadoop.util.hash.type",
        "hadoop.work.around.non.threadsafe.getpwuid",
        "hadoophack.tunnel.port",
        "hb=\nase.hregion.max.filesize",
        "hb=\nase.master",
        "hb=\nase.zookeeper.property.tickTime",
        "hb=\nase.zookeeper.quorun",
        "hbas=\ne.cluster.distributed",
        "hbase.Coprocessor.region.classes",
        "hbase.ZooKeeper.quorum",
        "hbase.balancer.period",
        "hbase.block.cache.size",
        "hbase.bridge.server.port",
        "hbase.bridge.source.zookeeper.quorum",
        "hbase.bucketcache.bucket.sizes",
        "hbase.bucketcache.combinedcache.enabled",
        "hbase.bucketcache.ioengine",
        "hbase.bucketcache.percentage.in.combinedcache",
        "hbase.bucketcache.size",
        "hbase.bulkload.staging.dir",
        "hbase.cl=\nient.write.buffer",
        "hbase.client.ipc.pool.size",
        "hbase.client.ipc.pool.type",
        "hbase.client.keyvalue.maxsize",
        "hbase.client.pause",
        "hbase.client.prefetch",
        "hbase.client.prefetch.limit",
        "hbase.client.retries.number",
        "hbase.client.s=\ncanner.caching",
        "hbase.client.scanner.**caching",
        "hbase.client.scanner.caching",
        "hbase.client.scanner.max.result.size",
        "hbase.client.scanner.timeout.period",
        "hbase.client.write.buffer",
        "hbase.cluster.****distributed",
        "hbase.cluster.**distributed",
        "hbase.cluster.dist=\nributed",
        "hbase.cluster.distribu=\nted",
        "hbase.cluster.distribute=\nd",
        "hbase.cluster.distributed",
        "hbase.cluster.distributed=",
        "hbase.column.max.version",
        "hbase.coprocessor.master.classes",
        "hbase.coprocessor.region.classes",
        "hbase.coprocessor.user.region.classes",
        "hbase.crypto.keyprovider",
        "hbase.crypto.keyprovider.parameters",
        "hbase.crypto.master.key.name",
        "hbase.data.umask",
        "hbase.data.umask.enable",
        "hbase.defaults.for.version",
        "hbase.defaults.for.version.skip",
        "hbase.hbasemaster.maxregionopen",
        "hbase.hregio=\nn.memstore.mslab.enabled",
        "hbase.hregion.impl",
        "hbase.hregion.majorcompaction",
        "hbase.hregion.max.filesize",
        "hbase.hregion.memcache.block.multiplier",
        "hbase.hregion.memcache.flush.size",
        "hbase.hregion.memstore.block.multiplier",
        "hbase.hregion.memstore.flush.size",
        "hbase.hregion.memstore.mslab.chunksize",
        "hbase.hregion.memstore.mslab.enabled",
        "hbase.hregion.memstore.mslab.max.allocation",
        "hbase.hstore.blockCache.blockSize",
        "hbase.hstore.blockingStoreFiles",
        "hbase.hstore.blockingWaitTime",
        "hbase.hstore.compaction.max",
        "hbase.hstore.compaction.min",
        "hbase.hstore.compaction.throughput.higher.bound",
        "hbase.hstore.compaction.throughput.lower.bound",
        "hbase.hstore.compactionThreshold",
        "hbase.hstore.flush.retries.number",
        "hbase.hstore.flusher.count",
        "hbase.hstore.time.to.purge.deletes",
        "hbase.io.index.interval",
        "hbase.io.seqfile.compression.type",
        "hbase.ipc.c=\nlient.tcpnodelay",
        "hbase.ipc.clien=\nt.tcpnodelay",
        "hbase.ipc.client.tcpnodelay",
        "hbase.ipc.server.callqueue.handler.factor",
        "hbase.ipc.server.read.threadpool.size",
        "hbase.ipc.warn.response.time",
        "hbase.local-file-span-receiver.path",
        "hbase.local.dir",
        "hbase.log.dir",
        "hbase.mapred.tablecolumns",
        "hbase.mas=\nter.info.port",
        "hbase.master",
        "hbase.master.balancer.stochastic.tableSkewCost",
        "hbase.master.distributed.log.splitting",
        "hbase.master.dns.interface",
        "hbase.master.dns.nameserver",
        "hbase.master.handler.count",
        "hbase.master.hfilecleaner.plugins",
        "hbase.master.info.bindAddress",
        "hbase.master.info.port",
        "hbase.master.kerberos.principal",
        "hbase.master.keytab.file",
        "hbase.master.lease.period",
        "hbase.master.lease.thread.wakefrequency",
        "hbase.master.loadbalancer.class",
        "hbase.master.logcleaner.plugins",
        "hbase.master.logcleaner.ttl",
        "hbase.master.meta.thread.rescanfrequency",
        "hbase.master.port",
        "hbase.master.wait.on.regionservers.mintostart",
        "hbase.master.zookeeper.property.tickTime",
        "hbase.master.zookeeper.session.timeout",
        "hbase.metrics.showTableName",
        "hbase.mob.file.cache.size",
        "hbase.mob.sweep.tool.compaction.memstore.flush.size",
        "hbase.nameserver.address",
        "hbase.offheapcache.percentage",
        "hbase.online.schema.update.enable",
        "hbase.regi=\nonserver.impl",
        "hbase.reginserver.restart.on.zk.expire",
        "hbase.regions.percheckin",
        "hbase.regions.slop",
        "hbase.regionserver",
        "hbase.regionserver.\n> logroll.period",
        "hbase.regionserver.\nlogroll.period",
        "hbase.regionserver.cl=\nass",
        "hbase.regionserver.class",
        "hbase.regionserver.codecs",
        "hbase.regionserver.dns.interface",
        "hbase.regionserver.dns.nameserver",
        "hbase.regionserver.executor.closeregion.threads",
        "hbase.regionserver.flushlogentries",
        "hbase.regionserver.global.memstore.lowerLimit",
        "hbase.regionserver.global.memstore.upperLimit",
        "hbase.regionserver.globalMemcache.lowerLimit",
        "hbase.regionserver.globalMemcache.upperLimit",
        "hbase.regionserver.globalMemcacheLimit",
        "hbase.regionserver.globalMemcacheLimitlowMark",
        "hbase.regionserver.handler.count",
        "hbase.regionserver.hlog.reader.impl",
        "hbase.regionserver.hlog.writer.impl",
        "hbase.regionserver.impl",
        "hbase.regionserver.info.bindAddress",
        "hbase.regionserver.info.port",
        "hbase.regionserver.info.port.auto",
        "hbase.regionserver.kerberos.principal",
        "hbase.regionserver.keytab.file",
        "hbase.regionserver.lease.period",
        "hbase.regionserver.logroll.period",
        "hbase.regionserver.maxlogentries",
        "hbase.regionserver.maxlogs",
        "hbase.regionserver.metahandler.count",
        "hbase.regionserver.msginterval",
        "hbase.regionserver.nbreservationblocks",
        "hbase.regionserver.optionalcacheflushinterval",
        "hbase.regionserver.optionallogflushinterval",
        "hbase.regionserver.optionallogrollinterval",
        "hbase.regionserver.p=\nort",
        "hbase.regionserver.port",
        "hbase.regionserver.port=",
        "hbase.regionserver.region.split.policy",
        "hbase.regionserver.regionSplitLimit",
        "hbase.regionserver.safemode",
        "hbase.regionserver.thread.compaction.large",
        "hbase.regionserver.thread.compaction.small",
        "hbase.regionserver.thread.compaction.throttle",
        "hbase.regionserver.thread.split",
        "hbase.regionserver.thread.splitcompactcheckfrequency",
        "hbase.regionserver.thrift.framed",
        "hbase.regionserver.wal.encryption",
        "hbase.replication",
        "hbase.replication.enabled",
        "hbase.rest.port",
        "hbase.rest.readonly",
        "hbase.rest.threads.max",
        "hbase.rest.threads.min",
        "hbase.ro=\notdir",
        "hbase.roo=\ntdir",
        "hbase.rootd=\nir",
        "hbase.rootdi=\nr",
        "hbase.rootdir",
        "hbase.rpc.engine",
        "hbase.rpc.shortoperation.timeout",
        "hbase.rpc.timeout",
        "hbase.security.authentication",
        "hbase.security.authorization",
        "hbase.server.thread.wakefrequency",
        "hbase.snapshot.enabled",
        "hbase.snapshot.master.timeout.millis",
        "hbase.snapshot.master.timeoutMillis",
        "hbase.snapshot.region.timeout",
        "hbase.snapshot.restore.take.failsafe.snapshot",
        "hbase.splitlog.manager.timeout",
        "hbase.status.listener.class",
        "hbase.status.published",
        "hbase.status.publisher.class",
        "hbase.storescanner.parallel.seek.enable",
        "hbase.superuser",
        "hbase.table.archive.directory",
        "hbase.table.lock.enable",
        "hbase.tmp.dir",
        "hbase.trace.spanreceiver.classes",
        "hbase.wal.provider",
        "hbase.wal.regiongrouping.numgroups",
        "hbase.zookeepe=\nr.quorum",
        "hbase.zookeeper.distributed",
        "hbase.zookeeper.dns.interface",
        "hbase.zookeeper.dns.nameserver",
        "hbase.zookeeper.leaderport",
        "hbase.zookeeper.peerport",
        "hbase.zookeeper.propert=\ny.dataDir",
        "hbase.zookeeper.property.clientPort",
        "hbase.zookeeper.property.dataDir",
        "hbase.zookeeper.property.initLimit",
        "hbase.zookeeper.property.maxClientCnxns",
        "hbase.zookeeper.property.maxSessionTimeout",
        "hbase.zookeeper.property.requireClientAuthScheme",
        "hbase.zookeeper.property.syncLimit",
        "hbase.zookeeper.property.tickTime",
        "hbase.zookeeper.quor=\num",
        "hbase.zookeeper.quorom",
        "hbase.zookeeper.quorum",
        "hbase.zookeeper.quorun",
        "hbase.zookeeper.useMulti",
        "hbase=\n.hregion.memstore.mslab.max.allocation",
        "hbase=\n.zookeeper.property.tickTime",
        "hbase=\n.zookeeper.quorun",
        "hbaseshell.jline.bell.enabled",
        "hdfs.root",
        "hfile.block.cache.size",
        "hfile.format.version",
        "hfile.min.blocksize.size",
        "hive.aux.jars.path",
        "hive.exec.scratchdir",
        "hive.metast=\nore.uris",
        "hive.metastore.uris",
        "hive.metastore.warehouse.dir",
        "hive.querylog.location",
        "hive.support.concurrency",
        "httpfs.fsAccess.conf:fs.default.name",
        "httpfs.fsAccess.conf:fs.default.name\n>",
        "httpfs.fsAccess.conf:fs.default.name\n> >",
        "httpfs.fsAccess.conf:fs.default.name\n>> >",
        "httpfs.fsAccess.conf:fs.default.name\n>>> >",
        "httpfs.fsAccess.conf:fs.default.name\n>>>> >",
        "instance.volumes",
        "io.compression.codec.bzip2.library",
        "io.compression.codec.lzo.class",
        "io.compression.codecs",
        "io.file.buffer.size",
        "io.map.index.interval",
        "io.map.index.skip",
        "io.mapfile.bloom.size",
        "io.native.lib.available",
        "io.seqfile.lazydecompress",
        "io.seqfile.local.dir",
        "io.serializations",
        "io.skip.checksum.errors",
        "io.sort.factor",
        "io.sort.mb",
        "io.sort.record.percent",
        "io.sort.spill.percent",
        "ipc.client.connect.retry.interval",
        "ipc.client.connection.maxidletime",
        "ipc.client.fallback-to-simple-auth-allowed",
        "ipc.client.idlethreshold",
        "ipc.client.kill.max",
        "ipc.client.tcpnodelay",
        "ipc.server.tcpnodelay",
        "java.library.path",
        "javax.jdo.option.ConnectionDriverName",
        "javax.jdo.option.ConnectionPassword",
        "javax.jdo.option.ConnectionURL",
        "javax.jdo.option.ConnectionUser=\nName",
        "javax.jdo.option.ConnectionUserName",
        "javax.xml.parsers.DocumentBuilderFa=\nctory",
        "javax.xml.parsers.DocumentBuilderFac=\ntory",
        "javax.xml.parsers.DocumentBuilderFactory",
        "jobtracker.thrift.address",
        "keep.failed.task.files",
        "keep.task.files.pattern",
        "local.cache.size",
        "m=\napred.tasktracker.map.tasks.maximum",
        "map.sort.class",
        "mapre=\nd.reduce.child.java.opts",
        "mapred.=\nfairscheduler.poolnameproperty",
        "mapred.=\nfairscheduler.preemption",
        "mapred.acls.enabled",
        "mapred.child.env",
        "mapred.child.java.opts",
        "mapred.child.tmp",
        "mapred.child.ulimit",
        "mapred.compress.map.output",
        "mapred.fairscheduler.allocation.file",
        "mapred.fairscheduler.allow.undeclared.pools",
        "mapred.fairscheduler.poolnameproperty",
        "mapred.fairscheduler.preemption",
        "mapred.framework.name",
        "mapred.healthChecker.script.timeout",
        "mapred.hosts",
        "mapred.hosts.exclude",
        "mapred.input.format.class",
        "mapred.job.classpath.archives",
        "mapred.job.reuse.jvm.num.tasks",
        "mapred.job.shuffle.merge.percent",
        "mapred.job.tracker",
        "mapred.job.tracker.handler.count",
        "mapred.job.tracker.http.address",
        "mapred.job.tracker.info.port",
        "mapred.job.tracker=",
        "mapred.jobtracker.blacklist.fault-timeout-window",
        "mapred.jobtracker.plugins",
        "mapred.jobtracker.taskScheduler",
        "mapred.local.dir",
        "mapred.map.child.java.opts",
        "mapred.map.output.compress.codec",
        "mapred.map.output.compression.codec",
        "mapred.map.tasks",
        "mapred.map.tasks.speculative.execution",
        "mapred.mapper.new-api",
        "mapred.output.compress",
        "mapred.output.compression.codec",
        "mapred.output.compression.type",
        "mapred.queue.=\nnames",
        "mapred.queue.default.acl-administer-jobs",
        "mapred.queue.default.acl-submit-job",
        "mapred.queue.name",
        "mapred.queue.names",
        "mapred.queue.q_test.acl-submit-job",
        "mapred.queue.sqoop.acl-administer-jobs",
        "mapred.queue.sqoop.acl-submit-job",
        "mapred.reduce.child.java.opts",
        "mapred.reduce.max.attempts",
        "mapred.reduce.parallel.copies",
        "mapred.reduce.slowstart.completed.maps",
        "mapred.reduce.tasks",
        "mapred.reduce.tasks.speculative.execution",
        "mapred.reducer.new-api",
        "mapred.submit.replication",
        "mapred.system.dir",
        "mapred.task.id",
        "mapred.task.profile",
        "mapred.task.profile.maps",
        "mapred.task.profile.reduces",
        "mapred.task.timeout",
        "mapred.task.tracker.http.address",
        "mapred.task.tracker.report.address",
        "mapred.tasktacker.map.tasks.maximum",
        "mapred.tasktacker.reduce.tasks.maximum",
        "mapred.tasktracker.expiry.interval",
        "mapred.tasktracker.map.tasks.maximum",
        "mapred.tasktracker.red=\nuce.tasks.maximum",
        "mapred.tasktracker.reduce.tasks.maximum",
        "mapred.textoutputformat.separator",
        "mapred.userlog.retain.hours",
        "mapreduce.admin.map.child.java.opts",
        "mapreduce.admin.reduce.child.java.opts",
        "mapreduce.admin.user.env",
        "mapreduce.am.max-attempts",
        "mapreduce.application.classpath",
        "mapreduce.child.java.opts",
        "mapreduce.client.genericoptionsparser.used",
        "mapreduce.client.progressmonitor.pollinterval",
        "mapreduce.cluster.local.dir",
        "mapreduce.cluster.temp.dir",
        "mapreduce.fi=\nleoutputcommitter.marksuccessfuljobs",
        "mapreduce.fileoutputcommitter.marksuccessfuljob=\ns",
        "mapreduce.fileoutputcommitter.marksuccessfuljobs",
        "mapreduce.framework.name",
        "mapreduce.ifile.readahead",
        "mapreduce.input.fileinputformat.split.minsize",
        "mapreduce.j=\nob.acl-view-job",
        "mapreduce.job.acl-modify-job",
        "mapreduce.job.acl-view-job",
        "mapreduce.job.classloader.system.classes",
        "mapreduce.job.committer.setup.cleanup.needed",
        "mapreduce.job.counters.max",
        "mapreduce.job.end-notification.retry.attempts",
        "mapreduce.job.end-notification.retry.interval",
        "mapreduce.job.jvm.numtasks",
        "mapreduce.job.map.output.collector.class",
        "mapreduce.job.maps",
        "mapreduce.job.reduce.slowstart.completedmaps",
        "mapreduce.job.reduces",
        "mapreduce.job.speculative.slownodethreshold",
        "mapreduce.job.speculative.slowtaskthreshold",
        "mapreduce.job.split.metainfo.maxsize",
        "mapreduce.job.token.tracking.ids.enabled",
        "mapreduce.job.tracker.address",
        "mapreduce.jobhistory.address",
        "mapreduce.jobhistory.admin.address",
        "mapreduce.jobhistory.cleaner.interval-ms",
        "mapreduce.jobhistory.datestring.cache.size",
        "mapreduce.jobhistory.done-dir",
        "mapreduce.jobhistory.intermediate-done-dir",
        "mapreduce.jobhistory.keytab",
        "mapreduce.jobhistory.max-age-ms",
        "mapreduce.jobhistory.minicluster.fixed.ports",
        "mapreduce.jobhistory.principal",
        "mapreduce.jobhistory.recovery.store.fs.uri",
        "mapreduce.jobhistory.webapp.address",
        "mapreduce.jobtracker.addre=\nss",
        "mapreduce.jobtracker.addre=\nssr",
        "mapreduce.jobtracker.address",
        "mapreduce.jobtracker.expire.trackers.interval",
        "mapreduce.jobtracker.hosts.filename",
        "mapreduce.jobtracker.http.address",
        "mapreduce.jobtracker.jobhistory.block.size",
        "mapreduce.jobtracker.jobhistory.location",
        "mapreduce.jobtracker.kerberos.https.principal",
        "mapreduce.jobtracker.kerberos.principal",
        "mapreduce.jobtracker.persist.jobstatus.active",
        "mapreduce.jobtracker.persist.jobstatus.dir",
        "mapreduce.jobtracker.persist.jobstatus.hours",
        "mapreduce.jobtracker.retiredjobs.cache.size",
        "mapreduce.jobtracker.split.metainfo.maxsize",
        "mapreduce.jobtracker.staging.root.dir",
        "mapreduce.jobtracker.system.dir",
        "mapreduce.map.cpu.vcores",
        "mapreduce.map.java.opts",
        "mapreduce.map.log.level",
        "mapreduce.map.maxattempts",
        "mapreduce.map.memory.mb",
        "mapreduce.map.output.compress",
        "mapreduce.map.output.compress.codec",
        "mapreduce.map.speculative",
        "mapreduce.output.fileoutputformat.compress",
        "mapreduce.reduce.cpu.vcores",
        "mapreduce.reduce.java.opts",
        "mapreduce.reduce.log.level",
        "mapreduce.reduce.maxattempts",
        "mapreduce.reduce.memory.mb",
        "mapreduce.reduce.merge.inmem.threshold",
        "mapreduce.reduce.shuffle.connect.timeout",
        "mapreduce.reduce.shuffle.input.buffer.percent",
        "mapreduce.reduce.shuffle.maxfetchfailures",
        "mapreduce.reduce.shuffle.memory.limit.percent",
        "mapreduce.reduce.shuffle.parallelcopies",
        "mapreduce.reduce.shuffle.read.timeout",
        "mapreduce.reduce.shuffle.retry-delay.max.ms",
        "mapreduce.reduce.skip.proc.count.autoincr",
        "mapreduce.reduce.speculative",
        "mapreduce.shuffle.port",
        "mapreduce.task.attempt.id",
        "mapreduce.task.files.preserve.failedtasks",
        "mapreduce.task.io.sort.factor",
        "mapreduce.task.io.sort.mb",
        "mapreduce.task.profile",
        "mapreduce.task.profile.map.params",
        "mapreduce.task.profile.maps",
        "mapreduce.task.profile.params",
        "mapreduce.task.timeout",
        "mapreduce.task.tmp.dir",
        "mapreduce.task.userlog.limit.kb",
        "mapreduce.tasktracker.healthchecker.interval",
        "mapreduce.tasktracker.http.address",
        "mapreduce.tasktracker.indexcache.mb",
        "mapreduce.tasktracker.local.dir.minspacekill",
        "mapreduce.tasktracker.local.dir.minspacestart",
        "mapreduce.tasktracker.map.tasks.maximum",
        "mapreduce.tasktracker.outofband.heartbeat",
        "mapreduce.tasktracker.reduce.tasks.maximum",
        "mapreduce.tasktracker.report.address",
        "net.topology.impl",
        "net.topology.script.file.name",
        "nfs.allow.insecure.ports",
        "nfs.dump.dir",
        "nfs.exports.allowed.hosts",
        "nfs.mountd.port",
        "nfs.rtmax",
        "nfs.server.port",
        "nfs.wtmax",
        "oozie.launcher.mapred.fairscheduler.pool",
        "param1",
        "replication.replicationsource.implementation",
        "replication.source.nb.capacity",
        "replication.source.ratio",
        "s3.blocksize",
        "s3.replication",
        "s3native.blocksize",
        "s3native.replication",
        "security.admin.protocol.acl",
        "security.client.datanode.protocol.acl",
        "security.client.protocol.acl",
        "security.inter.tracker.protocol.acl",
        "security.masterregion.protocol.acl",
        "tasktracker.http.port",
        "tasktracker.http.threads",
        "test.SymlinkEnabledForTesting",
        "tfile.io.chunk.size",
        "tickTime",
        "topology.node.switch.mapping.impl",
        "topology.script.file.name",
        "topology.script.number.args",
        "yarn.acl.enable",
        "yarn.admin.acl",
        "yarn.am.liveness-monitor.expiry-interval-ms",
        "yarn.app.mapreduce.am.admin-command-opts",
        "yarn.app.mapreduce.am.admin.user.env",
        "yarn.app.mapreduce.am.command-opts",
        "yarn.app.mapreduce.am.container.log.limit.kb",
        "yarn.app.mapreduce.am.env",
        "yarn.app.mapreduce.am.job.client.port-range",
        "yarn.app.mapreduce.am.job.task.listener.thread-count",
        "yarn.app.mapreduce.am.log.level",
        "yarn.app.mapreduce.am.resource.mb",
        "yarn.app.mapreduce.am.staging-dir",
        "yarn.app.mapreduce.client-am.ipc.max-retries",
        "yarn.app.mapreduce.task.container.log.backups",
        "yarn.application.classpath",
        "yarn.application.classpath.ext",
        "yarn.client.failover-proxy-provider",
        "yarn.client.failover-retries",
        "yarn.client.nodemanager-connect.max-wait-ms",
        "yarn.http.policy",
        "yarn.ipc.rpc.class",
        "yarn.log-aggregation-enable",
        "yarn.log-aggregation.retain-check-interval-seconds",
        "yarn.log-aggregation.retain-seconds",
        "yarn.log.server.url",
        "yarn.nm.liveness-monitor.expiry-interval-ms",
        "yarn.nodemanager.address",
        "yarn.nodemanager.admin-env",
        "yarn.nodemanager.aux-services",
        "yarn.nodemanager.aux-services.bar.class",
        "yarn.nodemanager.aux-services.foo.class",
        "yarn.nodemanager.aux-services.mapreduce.shuffle.class",
        "yarn.nodemanager.aux-services.mapreduce_shuffle.class",
        "yarn.nodemanager.container-executor.class",
        "yarn.nodemanager.container-monitor.resource-calculator.class",
        "yarn.nodemanager.delete.debug-delay-sec",
        "yarn.nodemanager.delete.thread-count",
        "yarn.nodemanager.disk-health-checker.min-free-space-per-dis=\nk-mb",
        "yarn.nodemanager.disk-health-checker.min-healthy-disks",
        "yarn.nodemanager.health-checker.interval-ms",
        "yarn.nodemanager.health-checker.script.opts",
        "yarn.nodemanager.health-checker.script.path",
        "yarn.nodemanager.linux-container-executor.group",
        "yarn.nodemanager.linux-container-executor.resources-handler=\n.class",
        "yarn.nodemanager.local-*dirs*",
        "yarn.nodemanager.local-cache.max-files-per-directory",
        "yarn.nodemanager.local-dirs",
        "yarn.nodemanager.localizer.address",
        "yarn.nodemanager.localizer.fetch.thread-count",
        "yarn.nodemanager.log-aggregation-enable",
        "yarn.nodemanager.log-dirs",
        "yarn.nodemanager.log.dirs",
        "yarn.nodemanager.log.retain-seconds",
        "yarn.nodemanager.recovery.dir",
        "yarn.nodemanager.remote-app-log-dir",
        "yarn.nodemanager.remote-app-log-dir-suffix",
        "yarn.nodemanager.resource.cpu-cores",
        "yarn.nodemanager.resource.cpu-vcores",
        "yarn.nodemanager.resource.memory-mb",
        "yarn.nodemanager.resourcemanager.connect.retry_interval.sec=\ns",
        "yarn.nodemanager.vcores-pcores-ratio",
        "yarn.nodemanager.vmem-pmem-ratio",
        "yarn.nodemanager.webapp.address",
        "yarn.resourcemanager.address",
        "yarn.resourcemanager.admin.address",
        "yarn.resourcemanager.am.max-attempts",
        "yarn.resourcemanager.bind-host",
        "yarn.resourcemanager.client.thread-count",
        "yarn.resourcemanager.connect.max-wait.ms",
        "yarn.resourcemanager.container.liveness-monitor.interval-ms=",
        "yarn.resourcemanager.delayed.delegation-token.removal-interval-ms",
        "yarn.resourcemanager.hostname",
        "yarn.resourcemanager.nm.liveness-monitor.interval-ms",
        "yarn.resourcemanager.nodes.exclude-path",
        "yarn.resourcemanager.proxy-user-privileges.enabled",
        "yarn.resourcemanager.resource-tracker.address",
        "yarn.resourcemanager.scheduler.address",
        "yarn.resourcemanager.scheduler.class",
        "yarn.resourcemanager.scheduler.monitor.enable",
        "yarn.resourcemanager.webapp.address",
        "yarn.resourcemanager.webapp.delegation-token-auth-filter.en=\nabled",
        "yarn.resourcemanager.webapp.delegation-token-auth-filter.enabled",
        "yarn.resourcemanager.zk-acl",
        "yarn.resourcemanager.zk-retry-interval-ms",
        "yarn.root.logger",
        "yarn.scheduler.capacity.maximum-am-resource-percent",
        "yarn.scheduler.capacity.maximum-applications",
        "yarn.scheduler.capacity.node-locality-delay",
        "yarn.scheduler.capacity.queue-mappings",
        "yarn.scheduler.capacity.queue-mappings-override.enable",
        "yarn.scheduler.capacity.resource-calculator",
        "yarn.scheduler.capacity.root.\n> production.acl_submit_applications",
        "yarn.scheduler.capacity.root.\n>> production.acl_submit_applications",
        "yarn.scheduler.capacity.root.\n>>> production.acl_submit_applications",
        "yarn.scheduler.capacity.root.\n>>>> production.acl_submit_applications",
        "yarn.scheduler.capacity.root.\n>>>>> production.acl_submit_applications",
        "yarn.scheduler.capacity.root.\n>>>>>> production.acl_submit_applications",
        "yarn.scheduler.capacity.root.\n>>>>>>> production.acl_submit_applications",
        "yarn.scheduler.capacity.root.\n>>>>>>>> production.acl_submit_applications",
        "yarn.scheduler.capacity.root.\n>>>>>>>>> production.acl_submit_applications",
        "yarn.scheduler.capacity.root.\n>>>>>>>>>> production.acl_submit_applications",
        "yarn.scheduler.capacity.root.\n>>>>>>>>>>> production.acl_submit_applications",
        "yarn.scheduler.capacity.root.\n>>>>>>>>>>>> production.acl_submit_applications",
        "yarn.scheduler.capacity.root.\n>>>>>>>>>>>>> production.acl_submit_applications",
        "yarn.scheduler.capacity.root.\n>>>>>>>>>>>>>> production.acl_submit_applications",
        "yarn.scheduler.capacity.root.\n>>>>>>>>>>>>>>> production.acl_submit_applications",
        "yarn.scheduler.capacity.root.\n>>>>>>>>>>>>>>>> production.acl_submit_applications",
        "yarn.scheduler.capacity.root.\n>>>>>>>>>>>>>>>>> production.acl_submit_applications",
        "yarn.scheduler.capacity.root.\n>>>>>>>>>>>>>>>>>> production.acl_submit_applications",
        "yarn.scheduler.capacity.root.\nproduction.acl_submit_applications",
        "yarn.scheduler.capacity.root.*dev*\n.acl_submit_applications",
        "yarn.scheduler.capacity.root.*dev*\n> .acl_submit_applications",
        "yarn.scheduler.capacity.root.acl_administer_queue",
        "yarn.scheduler.capacity.root.acl_submit_applications",
        "yarn.scheduler.capacity.root.capacity",
        "yarn.scheduler.capacity.root.default.acl_administer_queue",
        "yarn.scheduler.capacity.root.default.acl_submit_applications",
        "yarn.scheduler.capacity.root.default.capacity",
        "yarn.scheduler.capacity.root.default.maximum-capacity",
        "yarn.scheduler.capacity.root.default.minimum-user-limit-percent",
        "yarn.scheduler.capacity.root.default.state",
        "yarn.scheduler.capacity.root.default.user-limit-factor",
        "yarn.scheduler.capacity.root.dev.acl_submit_applications",
        "yarn.scheduler.capacity.root.exploration.a.acl_submit_applications",
        "yarn.scheduler.capacity.root.exploration.a.capacity",
        "yarn.scheduler.capacity.root.exploration.b.acl_submit_applications",
        "yarn.scheduler.capacity.root.exploration.b.capacity",
        "yarn.scheduler.capacity.root.exploration.c.acl_submit_applications",
        "yarn.scheduler.capacity.root.exploration.c.capacity",
        "yarn.scheduler.capacity.root.exploration.capacity",
        "yarn.scheduler.capacity.root.exploration.queues",
        "yarn.scheduler.capacity.root.production.capacity",
        "yarn.scheduler.capacity.root.queues",
        "yarn.scheduler.capacity.root.small.capacity",
        "yarn.scheduler.capacity.root.small.maximum-am-resource-percent",
        "yarn.scheduler.capacity.root.small.maximum-capacity",
        "yarn.scheduler.capacity.root.small.user-limit",
        "yarn.scheduler.maximum-allocation-mb",
        "yarn.scheduler.maximum-allocation-vcores",
        "yarn.scheduler.minimum-allocation-mb",
        "yarn.scheduler.minimum-allocation-vcores",
        "yarn.timeline-service.address",
        "yarn.timeline-service.hostname",
        "yarn.timeline-service.leveldb-timeline-store.ttl-interval-m=\ns",
        "yarn.timeline-service.leveldb-timeline-store.ttl-interval-ms",
        "yarn.timeline-service.leveldb-timeline-store.ttl-interval-ms=",
        "yarn.timeline-service.store-class",
        "yarn.timeline-service.ttl-ms",
        "yarn.web-proxy.address",
        "zlib.compress.level",
        "zooke=\neper.session.timeout",
        "zookee=\nper.session.timeout",
        "zookeeper.retries",
        "zookeeper.sessio=\nn.timeout",
        "zookeeper.session.timeout",
        "zookeeper.znode.acl.parent",
        "zookeeper.znode.master",
        "zookeeper.znode.parent",
        "zookeeper.znode.rootserver"
    ],
    "value": [
        "\n",
        "\n\norg.apache.hadoop.io.compress.GzipCodec,\n\norg.apache.hadoop.io.compress.DefaultCodec,\n\norg.apache.hadoop.io.compress.BZip2Codec,\n\norg.apache.hadoop.io.compress.SnappyCodec\n                                       ",
        "\n        \norg.apache.hadoop.hbase.regionserver.tableindexed.IndexedRegionServer\n        ",
        "\n                 /scratch/usr/software/hadoop2/hadoop-dc/temp/nm-local-dir,\n                /tmp/nm-local-dir\n     ",
        "\n        $HADOOP_CONF_DIR, $HADOOP_COMMON_HOME/share/hadoop/common/*,\n$HADOOP_COMMON_HOME/share/hadoop/common/lib/*, $HADO$\n     ",
        "\n        org.apache.hadoop.hbase.regionserver.tableindexed.IndexedRegionServ=\ner\n        ",
        "\n      org.apache.hadoop.io.compress.GzipCodec,\n      org.apache.hadoop.io.compress.DefaultCodec,\n      org.apache.hadoop.io.compress.BZip2Codec,\n      org.apache.hadoop.io.compress.SnappyCodec\n    ",
        "\n      sshfence\n      shell(/bin/true)\n    ",
        "\n     -Xmx1024M -Djava.library.path=/home/mycompany/lib -verbose:gc\n-Xloggc:/tmp/@taskid@.gc\n     -Dcom.sun.management.jmxremote.authenticate=false\n-Dcom.sun.management.jmxremote.ssl=false\n  ",
        "\n     -Xmx512M -Djava.library.path=/home/mycompany/lib -verbose:gc\n-Xloggc:/tmp/@taskid@.gc\n     -Dcom.sun.management.jmxremote.authenticate=false\n-Dcom.sun.management.jmxremote.ssl=false\n  ",
        "\n$HADOOP_CONF_DIR,\n$HADOOP_COMMON_HOME/*,$HADOOP_COMMON_HOME/lib/*,\n      $HADOOP_HDFS_HOME/*,$HADOOP_HDFS_HOME/lib/*,\n$HADOOP_MAPRED_HOME/*,$HADOOP_MAPRED_HOME/lib/*,\n$YARN_HOME/*,$YARN_HOME/lib/*\n",
        "\n-Xmx512m -Djava.net.preferIPv4Stack=true -XX:+UseCompressedOops\n-XX:+HeapDumpOnOutOfMemoryError\n-XX:HeapDumpPath=/home/sfdc/logs/hadoop/userlogs/@taskid@/\n",
        "\n/etc/hadoop/conf,/usr/lib/hadoop/*,/usr/lib/hadoop/lib/*,/usr/lib/hadoop-hdfs/*,/usr/lib/hadoop-hdfs/lib/*,/usr/lib/hadoop-yarn/*,/usr/lib/hadoop-yarn/lib/*,/usr/lib/hadoop-mapreduce/*,/usr/lib/hadoop-mapreduce/lib/*,/home/hduser/mahout-1.0-snapshot/math/target/*\n         ",
        "\n>\n> org.apache.hadoop.io.compress.GzipCodec,\n>\n> org.apache.hadoop.io.compress.DefaultCodec,\n>\n> org.apache.hadoop.io.compress.BZip2Codec,\n>\n> org.apache.hadoop.io.compress.SnappyCodec\n>                                        ",
        "\n> ",
        "\n>                  /scratch/usr/software/hadoop2/hadoop-dc/temp/nm-local-dir,\n>                 /tmp/nm-local-dir\n>      ",
        "\n>                 -Djava.library.path=/usr/local/hadoop-2.4.0/lib/native",
        "\n>             -Djava.library.path=/usr/local/hadoop-2.4.0/lib/native",
        "\n>         $HADOOP_CONF_DIR, $HADOOP_COMMON_HOME/share/hadoop/common/*, $HAD=\nOOP_COMMON_HOME/share/hadoop/common/lib/*, $HADO$\n>      ",
        "\n>       sshfence\n>       shell(/bin/true)\n>     ",
        "\n>   -Xmx1024M -Djava.library.path=/home/mycompany/lib -verbose:gc\n> -Xloggc:/tmp/@taskid@.gc\n>   -Dcom.sun.management.jmxremote.authenticate=false\n> -Dcom.sun.management.jmxremote.ssl=false\n> ",
        "\n>   -Xmx512M -Djava.library.path=/home/mycompany/lib -verbose:gc\n> -Xloggc:/tmp/@taskid@.gc\n>   -Dcom.sun.management.jmxremote.authenticate=false\n> -Dcom.sun.management.jmxremote.ssl=false\n> ",
        "\n> $HADOOP_CONF_DIR,$HADOOP_COMMON_HOME/share/hadoop/common/*,$HADOOP_COMMON=\n_HOME/share/hadoop/common/lib/*,$HADOOP_HDFS_HOME/share/hadoop/hdfs/*,$HADO=\nOP_HDFS_HOME/share/hadoop/hdfs/lib/*,$HADOOP_YARN_HOME/share/hadoop/yarn/*,=\n$HADOOP_YARN_HOME/share/hadoop/yarn/lib/*\n> ",
