{
    "sections": {
        "Default": 0,
        "Environment": 1,
        "General": 2,
        "MyBadDSN": 3,
        "MySQL": 4,
        "MySQL ODBC 8.0 Driver": 5,
        "MySQL ODBC 8.0 Unicode Driver": 6,
        "MySQLD": 7,
        "MySQLDSN": 8,
        "MySQLProduction": 9,
        "MySQLTest": 10,
        "NDBD": 11,
        "NDBD DEFAULT": 12,
        "NDB_MGMD": 13,
        "ODBC": 14,
        "ODBC Connection Pooling": 15,
        "ODBC Data Sources": 16,
        "ODBC Drivers": 17,
        "TCP DEFAULT": 18,
        "WinMySQLAdmin": 19,
        "WinMySQLadmin": 20,
        "client": 21,
        "client-server": 22,
        "client2": 23,
        "clinet": 24,
        "embedded": 25,
        "global": 26,
        "isamchk": 27,
        "manager": 28,
        "mariadb": 29,
        "my.cnf defaults": 30,
        "myisam": 31,
        "myisamchk": 32,
        "myisampack": 33,
        "mysql": 34,
        "mysql.server": 35,
        "mysql_cluster": 36,
        "mysql_hotbackup": 37,
        "mysql_hotcopy": 38,
        "mysql_upgrade": 39,
        "mysqladmin": 40,
        "mysqlcheck": 41,
        "mysqld": 42,
        "mysqld-safe": 43,
        "mysqld.server": 44,
        "mysqld1": 45,
        "mysqld2": 46,
        "mysqld_multi": 47,
        "mysqld_safe": 48,
        "mysqld_safe-ssl": 49,
        "mysqldump": 50,
        "mysqldump_testing": 51,
        "mysqlhotcopy": 52,
        "mysqlimport": 53,
        "mysqlshow": 54,
        "ndb_mgm": 55,
        "ndbd": 56,
        "odbc": 57,
        "root@host backup": 58,
        "safe_mysqld": 59,
        "server": 60,
        "wampmysqld": 61
    },
    "section_keyword_tokens": {
        "Default": {
            "IANAAppCodePage": 1765,
            "DriverManagerEncoding": 1766,
            "ODBCInst": 1767,
            "Driver": 1768,
            "Description": 1769,
            "`": 1770,
            "ErrorMessagesPath": 1771
        },
        "Environment": {
            "ODBCINI": 1772,
            "ODBCINST": 1773
        },
        "General": {
            "CPTimeout": 1774,
            "`": 1775,
            "ErrorMessagesPath": 1776
        },
        "MyBadDSN": {
            "Server": 1777,
            "Socket": 1778,
            "Option": 1779,
            "Database": 1780,
            "User": 1781,
            "Password": 1782,
            "Description": 1783,
            "Port": 1784
        },
        "MySQL": {
            "/": 1785,
            "conf": 1786,
            "mysql": 1787,
            "includedir": 1788,
            "User": 1789,
            "!": 1790,
            "Port": 1791,
            "Server": 1792,
            "UsageCount": 1793,
            "DriverManagerEncoding": 1794,
            "etc": 1795,
            "user": 1796,
            "Database": 1797,
            ".": 1798,
            "Password": 1799,
            "SSLMode": 1800,
            "Driver": 1801,
            "Description": 1802,
            "`": 1803,
            "d": 1804
        },
        "MySQL ODBC 8.0 Driver": {
            "ConnectFunctions": 1805,
            "SQLLevel": 1806,
            "UsageCount": 1807,
            "FileUsage": 1808,
            "DriverODBCVer": 1809,
            "APILevel": 1810
        },
        "MySQL ODBC 8.0 Unicode Driver": {
            "UsageCount": 1811,
            "DontDLClose": 1812,
            "FileUsage": 1813,
            "Driver": 1814,
            "Description": 1815
        },
        "MySQLD": {
            "innodb": 1816,
            "_": 1817,
            "buffer": 1818,
            "pool": 1819,
            "size": 1820,
            "myisam": 1821,
            "max": 1822,
            "sort": 1823,
            "file": 1824,
            "connections": 1825,
            "wait": 1826,
            "timeout": 1827,
            "read": 1828,
            "rnd": 1829,
            "table": 1830,
            "cache": 1831,
            "log": 1832,
            "set": 1833,
            "allowed": 1834,
            "packet": 1835,
            "engine": 1836,
            "tmp": 1837,
            "key": 1838,
            "storage": 1839,
            "extra": 1840,
            "-": 1841,
            "basedir": 1842,
            "flush": 1843,
            "at": 1844,
            "trx": 1845,
            "commit": 1846,
            "additional": 1847,
            "mem": 1848,
            "default": 1849,
            "connect": 1850,
            "net": 1851,
            "length": 1852,
            "old": 1853,
            "passwords": 1854,
            "character": 1855,
            "thread": 1856,
            "concurrency": 1857,
            "query": 1858,
            "port": 1859,
            "datadir": 1860
        },
        "MySQLDSN": {
            "TIMEOUT": 1861,
            "User": 1862,
            "SOCKET": 1863,
            "Trace": 1864,
            "TraceFile": 1865,
            "Port": 1866,
            "CHARSET": 1867,
            "Server": 1868,
            "Socket": 1869,
            "PORT": 1870,
            "PASSWORD": 1871,
            "DATABASE": 1872,
            "Option": 1873,
            "Database": 1874,
            "USER": 1875,
            "Password": 1876,
            "Driver": 1877,
            "Description": 1878,
            "SERVER": 1879,
            "OPTION": 1880
        },
        "MySQLProduction": {
            "Server": 1881,
            "Socket": 1882,
            "Option": 1883,
            "Database": 1884,
            "User": 1885,
            "Password": 1886,
            "Driver": 1887,
            "Description": 1888,
            "Port": 1889
        },
        "MySQLTest": {
            "Pooling": 1890,
            "User": 1891,
            "Port": 1892,
            "Server": 1893,
            "Socket": 1894,
            "Option": 1895,
            "Database": 1896,
            "Password": 1897,
            "Driver": 1898,
            "Description": 1899
        },
        "NDBD": {
            "HostName": 1900
        },
        "NDBD DEFAULT": {
            "DataMemory": 1901,
            "TransactionDeadlockDetectionTimeout": 1902,
            "MaxNoOfAttributes": 1903,
            "Diskcheckpointspeedinrestart": 1904,
            "NoOfReplicas": 1905,
            "TimeBetweenGlobalCheckpoints": 1906,
            "Diskcheckpointspeed": 1907,
            "ODirect": 1908,
            "TimeBetweenLocalCheckpoints": 1909,
            "NoOfFragmentLogFiles": 1910,
            "MaxNoOfOrderedIndexes": 1911,
            "RedoBuffer": 1912,
            "DataDir": 1913,
            "MaxNoOfConcurrentTransactions": 1914,
            "LockExecuteThreadToCPU": 1915,
            "SchedulerExecutionTimer": 1916,
            "IndexMemory": 1917,
            "MaxNoOfConcurrentOperations": 1918,
            "StopOnError": 1919,
            "SchedulerSpinTimer": 1920,
            "RealtimeScheduler": 1921,
            "LockMaintThreadsToCPU": 1922,
            "UndoIndexBuffer": 1923
        },
        "NDB_MGMD": {
            "HostName": 1924,
            "id": 1925
        },
        "ODBC": {
            "IANAAppCodePage": 1926,
            "Trace": 1927,
            "IANAAppCodes": 1928,
            "InstallDir": 1929,
            "TraceFile": 1930
        },
        "ODBC Connection Pooling": {
            "RecycleTime": 1931,
            "SQLLevel": 1932,
            "ErrorMode": 1933,
            "NoCatalogDB": 1934,
            "TranslationDLL": 1935,
            "MySQLTest": 1936,
            "DontOptimizeColWidths": 1937,
            "TranslationOption": 1938,
            "CharSet": 1939,
            "MySQLDSN": 1940,
            "NoDefaultFolder": 1941,
            "EnableDynamicCursor": 1942
        },
        "ODBC Data Sources": {
            "MyBadDSN": 1943,
            "MySQLDSN": 1944,
            "MySQLProduction": 1945,
            "MySQLTest": 1946
        },
        "ODBC Drivers": {
            "CPReuse": 1947,
            "InstallDir": 1948,
            "CPTimeout": 1949,
            "Pooling": 1950,
            "MySQL": 1951,
            "8": 1952,
            "Debug": 1953,
            ".": 1954,
            "0": 1955,
            "Driver": 1956,
            "ODBC": 1957,
            "CommLog": 1958
        },
        "TCP DEFAULT": {
            "SendBufferMemory": 1959,
            "ReceiveBufferMemory": 1960
        },
        "WinMySQLAdmin": {
            "QueryInterval": 1961
        },
        "WinMySQLadmin": {
            "Server": 1962,
            "log": 1963,
            "_": 1964,
            "error": 1965,
            "bin": 1966,
            "user": 1967,
            "password": 1968,
            "trust": 1969,
            "function": 1970,
            "creators": 1971
        },
        "client": {
            "cert": 1972,
            "pass": 1973,
            "database": 1974,
            "security": 1975,
            "mysql": 1976,
            "my": 1977,
            "sql": 1978,
            "_": 1979,
            "mode": 1980,
            "sets": 1981,
            "infile": 1982,
            "key": 1983,
            "set": 1984,
            "password": 1985,
            "dir": 1986,
            "max": 1987,
            "allowed": 1988,
            "packet": 1989,
            "local": 1990,
            "etc": 1991,
            "engine": 1992,
            "`": 1993,
            "cnf": 1994,
            "testWhileIdle": 1995,
            "use": 1996,
            "sock": 1997,
            "storage": 1998,
            "/": 1999,
            "socket": 2000,
            "-": 2001,
            "pipe": 2002,
            "no": 2003,
            "timeout": 2004,
            "loose": 2005,
            "default": 2006,
            "conf": 2007,
            "includedir": 2008,
            "connect": 2009,
            "ca": 2010,
            "tmp": 2011,
            "host": 2012,
            "slow": 2013,
            "query": 2014,
            "log": 2015,
            "ssl": 2016,
            "!": 2017,
            "integrated": 2018,
            "character": 2019,
            "beep": 2020,
            ".": 2021,
            "port": 2022,
            "file": 2023,
            "user": 2024,
            "protocol": 2025,
            "d": 2026
        },
        "client-server": {
            "cert": 2027,
            "default": 2028,
            "character": 2029,
            "`": 2030,
            "socket": 2031,
            "ca": 2032,
            "ssl": 2033,
            "-": 2034,
            "key": 2035,
            "set": 2036
        },
        "client2": {
            "socket": 2037,
            "port": 2038
        },
        "clinet": {
            "user": 2039,
            "database": 2040,
            "password": 2041
        },
        "embedded": {
            "conf": 2042,
            "mysql": 2043,
            "-": 2044,
            "symbolic": 2045,
            "includedir": 2046,
            "!": 2047,
            "etc": 2048,
            "federated": 2049,
            "skip": 2050,
            ".": 2051,
            "links": 2052,
            "/": 2053,
            "`": 2054,
            "d": 2055
        },
        "global": {
            "mysql": 2056,
            "_": 2057,
            "data": 2058,
            "3": 2059,
            "maximum": 2060,
            "banner": 2061,
            "org": 2062,
            "database": 2063,
            "flyway": 2064,
            "web": 2065,
            "n": 2066,
            "%": 2067,
            "spring": 2068,
            "36": 2069,
            "slave": 2070,
            "basename": 2071,
            "new": 2072,
            "generator": 2073,
            "mappings": 2074,
            "general": 2075,
            "log": 2076,
            "skip": 2077,
            "use": 2078,
            "sql": 2079,
            "comments": 2080,
            "Backend": 2081,
            "binlog": 2082,
            "format": 2083,
            "socket": 2084,
            "required": 2085,
            "environment": 2086,
            "'": 2087,
            "bin": 2088,
            "com": 2089,
            "services": 2090,
            "details": 2091,
            "ansi": 2092,
            "build": 2093,
            "name": 2094,
            "servlet": 2095,
            "SET": 2096,
            "profiles": 2097,
            "path": 2098,
            "request": 2099,
            "endpoints": 2100,
            "Frontend": 2101,
            "MYSQL": 2102,
            "ROOT": 2103,
            "PASSWORD": 2104,
            "platform": 2105,
            "size": 2106,
            "exposure": 2107,
            "port": 2108,
            "`": 2109,
            "open": 2110,
            "user": 2111,
            "endpoint": 2112,
            "enabled": 2113,
            "depends": 2114,
            "on": 2115,
            "include": 2116,
            "restart": 2117,
            "provider": 2118,
            "in": 2119,
            "charset": 2120,
            "3000": 2121,
            "app": 2122,
            "datasource": 2123,
            "lifetime": 2124,
            "minimum": 2125,
            "output": 2126,
            "}": 2127,
            "etc": 2128,
            "example": 2129,
            "tmpdir": 2130,
            "highlight": 2131,
            "hikari": 2132,
            "-": 2133,
            "msg": 2134,
            "thread": 2135,
            "ddl": 2136,
            "/": 2137,
            "external": 2138,
            "updates": 2139,
            "temp": 2140,
            "3306": 2141,
            "class": 2142,
            "timeout": 2143,
            "version": 2144,
            "main": 2145,
            "includedir": 2146,
            "view": 2147,
            "force": 2148,
            "!": 2149,
            "80": 2150,
            "components": 2151,
            "backend": 2152,
            "frontend": 2153,
            "management": 2154,
            "initialize": 2155,
            "Prisma": 2156,
            "datadir": 2157,
            "pool": 2158,
            "jpa": 2159,
            "properties": 2160,
            "security": 2161,
            "server": 2162,
            "batch": 2163,
            "schema": 2164,
            "level": 2165,
            "VITE": 2166,
            "API": 2167,
            "URL": 2168,
            "connection": 2169,
            "max": 2170,
            "dockerfile": 2171,
            "innodb": 2172,
            "file": 2173,
            "application": 2174,
            "autoReconnectForPools": 2175,
            "hibernate": 2176,
            "var": 2177,
            "show": 2178,
            "lib": 2179,
            "console": 2180,
            "context": 2181,
            "bind": 2182,
            "basedir": 2183,
            "mode": 2184,
            "auto": 2185,
            "id": 2186,
            "db": 2187,
            "encoding": 2188,
            "is": 2189,
            "same": 2190,
            "charSet": 2191,
            "exception": 2192,
            "pattern": 2193,
            "roles": 2194,
            "resolved": 2195,
            "http": 2196,
            "expose": 2197,
            "springframework": 2198,
            "logging": 2199,
            "validation": 2200,
            "dialect": 2201,
            "Docker": 2202,
            "Dockerfile": 2203,
            ".": 2204,
            "idle": 2205,
            "address": 2206,
            "client": 2207,
            "GLOBAL": 2208,
            "replicate": 2209,
            "group": 2210,
            "concat": 2211,
            "len": 2212,
            "d": 2213,
            "health": 2214,
            "buffer": 2215,
            "image": 2216,
            "Schema": 2217,
            "volumes": 2218,
            "DATABASE": 2219,
            "password": 2220,
            "driver": 2221,
            "multipart": 2222,
            "jdbc": 2223,
            "metadata": 2224,
            "defaults": 2225,
            "messages": 2226,
            "Compose": 2227,
            "expire": 2228,
            "logs": 2229,
            "days": 2230,
            ":": 2231,
            "logger": 2232,
            "ports": 2233,
            "]": 2234,
            "locking": 2235,
            "conf": 2236,
            "[": 2237,
            "5level": 2238,
            "{": 2239,
            "liquibase": 2240,
            "always": 2241,
            "active": 2242,
            "mvc": 2243,
            "autoReconnect": 2244,
            "default": 2245,
            "sync": 2246,
            "latest": 2247,
            "username": 2248,
            "url": 2249
        },
        "isamchk": {
            "conf": 2250,
            "mysql": 2251,
            "includedir": 2252,
            "my": 2253,
            "-": 2254,
            "sort": 2255,
            "_": 2256,
            "buffer": 2257,
            "!": 2258,
            "size": 2259,
            "key": 2260,
            "read": 2261,
            "etc": 2262,
            "write": 2263,
            "cnf": 2264,
            ".": 2265,
            "/": 2266,
            "`": 2267,
            "d": 2268
        },
        "manager": {
            "include": 2269,
            "mysql": 2270,
            "my": 2271,
            "password": 2272,
            "mysqld": 2273,
            "cnf": 2274,
            "monitoring": 2275,
            "/": 2276,
            "socket": 2277,
            "-": 2278,
            "interval": 2279,
            "bind": 2280,
            "default": 2281,
            "file": 2282,
            "!": 2283,
            "pid": 2284,
            "opt": 2285,
            "path": 2286,
            "bitnami": 2287,
            ".": 2288,
            "address": 2289,
            "port": 2290
        },
        "mariadb": {
            "wsrep": 2291,
            "_": 2292,
            "cluster": 2293,
            "address": 2294,
            "sst": 2295,
            "method": 2296,
            "innodb": 2297,
            "autoinc": 2298,
            "lock": 2299,
            "mode": 2300,
            "default": 2301,
            "storage": 2302,
            "engine": 2303,
            "name": 2304,
            "debug": 2305,
            "auth": 2306,
            "provider": 2307,
            "binlog": 2308,
            "format": 2309,
            "locks": 2310,
            "unsafe": 2311,
            "for": 2312
        },
        "my.cnf defaults": {
            "etc": 2313,
            "conf": 2314,
            "mysql": 2315,
            "includedir": 2316,
            ".": 2317,
            "!": 2318,
            "/": 2319,
            "`": 2320,
            "d": 2321
        },
        "myisam": {
            "etc": 2322,
            "conf": 2323,
            "mysql": 2324,
            "includedir": 2325,
            ".": 2326,
            "!": 2327,
            "/": 2328,
            "`": 2329,
            "key": 2330,
            "_": 2331,
            "buffer": 2332,
            "size": 2333,
            "d": 2334
        },
        "myisamchk": {
            "bdb": 2335,
            "mysql": 2336,
            "my": 2337,
            "sets": 2338,
            "ft": 2339,
            "_": 2340,
            "min": 2341,
            "word": 2342,
            "len": 2343,
            "sort": 2344,
            "buffer": 2345,
            "size": 2346,
            "set": 2347,
            "dir": 2348,
            "tokudb": 2349,
            "cache": 2350,
            "interactive": 2351,
            "read": 2352,
            "etc": 2353,
            "cnf": 2354,
            "skip": 2355,
            "key": 2356,
            "innodb": 2357,
            "flush": 2358,
            "method": 2359,
            "/": 2360,
            "socket": 2361,
            "-": 2362,
            "variable": 2363,
            "timeout": 2364,
            "conf": 2365,
            "includedir": 2366,
            "wait": 2367,
            "!": 2368,
            "write": 2369,
            "character": 2370,
            "file": 2371,
            "per": 2372,
            "table": 2373,
            ".": 2374,
            "datadir": 2375,
            "`": 2376,
            "d": 2377
        },
        "myisampack": {
            "-": 2378,
            "character": 2379,
            "sets": 2380,
            "dir": 2381
        },
        "mysql": {
            "innodb": 2382,
            "_": 2383,
            "lock": 2384,
            "wait": 2385,
            "timeout": 2386,
            "database": 2387,
            "back": 2388,
            "log": 2389,
            "set": 2390,
            "max": 2391,
            "allowed": 2392,
            "packet": 2393,
            "general": 2394,
            "tmp": 2395,
            "table": 2396,
            "size": 2397,
            "MySQL": 2398,
            "skip": 2399,
            "binlog": 2400,
            "format": 2401,
            "socket": 2402,
            "long": 2403,
            "query": 2404,
            "time": 2405,
            "bin": 2406,
            "prompt": 2407,
            "name": 2408,
            "host": 2409,
            "ssl": 2410,
            "thread": 2411,
            "stack": 2412,
            "key": 2413,
            "buffer": 2414,
            "cache": 2415,
            "port": 2416,
            "net": 2417,
            "read": 2418,
            "`": 2419,
            "user": 2420,
            "0": 2421,
            "interactive": 2422,
            "cert": 2423,
            "open": 2424,
            "lower": 2425,
            "case": 2426,
            "names": 2427,
            "mysql": 2428,
            "ProgramData": 2429,
            "rnd": 2430,
            "default": 2431,
            "storage": 2432,
            "engine": 2433,
            "warnings": 2434,
            "output": 2435,
            "etc": 2436,
            "tmpdir": 2437,
            "cnf": 2438,
            "error": 2439,
            "/": 2440,
            "-": 2441,
            "updates": 2442,
            "external": 2443,
            "no": 2444,
            "connect": 2445,
            "errors": 2446,
            "secure": 2447,
            "type": 2448,
            "includedir": 2449,
            "limit": 2450,
            "pool": 2451,
            "instances": 2452,
            "8": 2453,
            "!": 2454,
            "rehash": 2455,
            "character": 2456,
            "client": 2457,
            "priv": 2458,
            "datadir": 2459,
            "connection": 2460,
            "connections": 2461,
            "server": 2462,
            "my": 2463,
            "sets": 2464,
            "join": 2465,
            "testWhileIdle": 2466,
            "bind": 2467,
            "basedir": 2468,
            "auto": 2469,
            "ca": 2470,
            "lc": 2471,
            "resolve": 2472,
            "opt": 2473,
            "C": 2474,
            "queries": 2475,
            "not": 2476,
            "using": 2477,
            "indexes": 2478,
            "beep": 2479,
            "file": 2480,
            "per": 2481,
            ".": 2482,
            "address": 2483,
            "slow": 2484,
            "d": 2485,
            "sql": 2486,
            "mode": 2487,
            "infile": 2488,
            "sort": 2489,
            "dir": 2490,
            "password": 2491,
            "heap": 2492,
            "local": 2493,
            "flush": 2494,
            "method": 2495,
            "messages": 2496,
            "expire": 2497,
            "logs": 2498,
            "days": 2499,
            "results": 2500,
            ":": 2501,
            "at": 2502,
            "trx": 2503,
            "commit": 2504,
            "locking": 2505,
            "conf": 2506,
            "pid": 2507,
            "safe": 2508,
            "write": 2509,
            "Server": 2510,
            "definition": 2511,
            "collation": 2512,
            "sync": 2513
        },
        "mysql.server": {
            "use": 2514,
            "manager": 2515,
            "-": 2516,
            "user": 2517,
            "basedir": 2518
        },
        "mysql_cluster": {
            "ndb": 2519,
            "connectstring": 2520,
            "-": 2521
        },
        "mysql_hotbackup": {
            "interactive": 2522,
            "timeout": 2523,
            "etc": 2524,
            "conf": 2525,
            "mysql": 2526,
            "includedir": 2527,
            "-": 2528,
            ".": 2529,
            "!": 2530,
            "/": 2531,
            "`": 2532,
            "d": 2533
        },
        "mysql_hotcopy": {
            "-": 2534,
            "timeout": 2535,
            "interactive": 2536,
            "`": 2537
        },
        "mysql_upgrade": {
            "datadir": 2538,
            "basedir": 2539
        },
        "mysqladmin": {
            "cert": 2540,
            "default": 2541,
            "conf": 2542,
            "mysql": 2543,
            "-": 2544,
            "includedir": 2545,
            "my": 2546,
            "ca": 2547,
            "sets": 2548,
            "ssl": 2549,
            "!": 2550,
            "key": 2551,
            "dir": 2552,
            "set": 2553,
            "etc": 2554,
            "character": 2555,
            "`": 2556,
            "cnf": 2557,
            ".": 2558,
            "address": 2559,
            "/": 2560,
            "user": 2561,
            "d": 2562,
            "bind": 2563
        },
        "mysqlcheck": {
            "character": 2564,
            "sets": 2565,
            "-": 2566,
            "dir": 2567,
            "default": 2568,
            "set": 2569
        },
        "mysqld": {
            "server": 2570,
            "_": 2571,
            "audit": 2572,
            "file": 2573,
            "innodb": 2574,
            "lock": 2575,
            "wait": 2576,
            "timeout": 2577,
            "myisam": 2578,
            "max": 2579,
            "sort": 2580,
            "size": 2581,
            "length": 2582,
            "do": 2583,
            "cluster": 2584,
            "trust": 2585,
            "wsrep": 2586,
            "certify": 2587,
            "nonPK": 2588,
            "log": 2589,
            "archive": 2590,
            "\"": 2591,
            "back": 2592,
            "commit": 2593,
            "concurrency": 2594,
            "set": 2595,
            "not": 2596,
            "ndbcluster": 2597,
            "slave": 2598,
            "io": 2599,
            "capacity": 2600,
            "lc": 2601,
            "messages": 2602,
            "dir": 2603,
            "general": 2604,
            "for": 2605,
            "report": 2606,
            "bulk": 2607,
            "insert": 2608,
            "buffer": 2609,
            "parallel": 2610,
            "strict": 2611,
            "mode": 2612,
            "ndb": 2613,
            "binlog": 2614,
            "format": 2615,
            "load": 2616,
            "tmpdir": 2617,
            "user": 2618,
            "connections": 2619,
            "policy": 2620,
            "pipe": 2621,
            "skip": 2622,
            "networking": 2623,
            "additional": 2624,
            "mem": 2625,
            "pool": 2626,
            "table": 2627,
            "index": 2628,
            "ft": 2629,
            "word": 2630,
            "len": 2631,
            "id": 2632,
            "join": 2633,
            "ssl": 2634,
            "thread": 2635,
            "stack": 2636,
            "div": 2637,
            "precision": 2638,
            "increment": 2639,
            "memlock": 2640,
            "add": 2641,
            "plugin": 2642,
            "queries": 2643,
            "warnings": 2644,
            "priority": 2645,
            "open": 2646,
            "files": 2647,
            "limit": 2648,
            "timestamp": 2649,
            "tables": 2650,
            "change": 2651,
            "buffering": 2652,
            "language": 2653,
            "pushdown": 2654,
            "slow": 2655,
            "query": 2656,
            "use": 2657,
            "global": 2658,
            "control": 2659,
            "bin": 2660,
            "port": 2661,
            "optimizer": 2662,
            "trace": 2663,
            "relay": 2664,
            "space": 2665,
            "cache": 2666,
            "wlock": 2667,
            "invalidate": 2668,
            "throttle": 2669,
            "using": 2670,
            "indexes": 2671,
            "transaction": 2672,
            "isolation": 2673,
            "prealloc": 2674,
            "purge": 2675,
            "sporadic": 2676,
            "case": 2677,
            "sst": 2678,
            "method": 2679,
            "lower": 2680,
            "names": 2681,
            "mysql": 2682,
            "time": 2683,
            "delayed": 2684,
            "queue": 2685,
            "secure": 2686,
            "priv": 2687,
            "read": 2688,
            "rnd": 2689,
            "data": 2690,
            "home": 2691,
            "min": 2692,
            "default": 2693,
            "storage": 2694,
            "engine": 2695,
            "fast": 2696,
            "shutdown": 2697,
            "instances": 2698,
            "packet": 2699,
            "master": 2700,
            "info": 2701,
            "repository": 2702,
            "authentication": 2703,
            "recovery": 2704,
            "etc": 2705,
            "exclude": 2706,
            "lag": 2707,
            "collation": 2708,
            "cipher": 2709,
            "passwords": 2710,
            "error": 2711,
            "verbosity": 2712,
            "ignore": 2713,
            "admin": 2714,
            "external": 2715,
            "event": 2716,
            "en": 2717,
            "US": 2718,
            "include": 2719,
            "databases": 2720,
            "mirrored": 2721,
            "groups": 2722,
            "flush": 2723,
            "connect": 2724,
            "transport": 2725,
            "force": 2726,
            "invalid": 2727,
            "startup": 2728,
            "option": 2729,
            "group": 2730,
            "send": 2731,
            "statements": 2732,
            "replication": 2733,
            "delay": 2734,
            "require": 2735,
            "sp": 2736,
            "recursion": 2737,
            "depth": 2738,
            "neighbors": 2739,
            "character": 2740,
            "client": 2741,
            "percona": 2742,
            "sql": 2743,
            "safe": 2744,
            "updates": 2745,
            "threads": 2746,
            "enforce": 2747,
            "gtid": 2748,
            "consistency": 2749,
            "performance": 2750,
            "datadir": 2751,
            "alloc": 2752,
            "block": 2753,
            "connection": 2754,
            "locks": 2755,
            "scheduler": 2756,
            "expire": 2757,
            "logs": 2758,
            "seconds": 2759,
            "sets": 2760,
            "tickets": 2761,
            "allowed": 2762,
            "path": 2763,
            "exact": 2764,
            "tmp": 2765,
            "explicit": 2766,
            "userstat": 2767,
            "running": 2768,
            "logging": 2769,
            "strategy": 2770,
            "basedir": 2771,
            "autoextend": 2772,
            "<": 2773,
            "node": 2774,
            "address": 2775,
            "filesystem": 2776,
            "sleep": 2777,
            "ca": 2778,
            "only": 2779,
            "count": 2780,
            "schema": 2781,
            "consumer": 2782,
            "events": 2783,
            "history": 2784,
            "temp": 2785,
            "local": 2786,
            "infile": 2787,
            "galera": 2788,
            "on": 2789,
            "adaptive": 2790,
            "flushing": 2791,
            "per": 2792,
            "long": 2793,
            "old": 2794,
            "blocks": 2795,
            "repair": 2796,
            "short": 2797,
            "sync": 2798,
            "spin": 2799,
            "loops": 2800,
            "key": 2801,
            "write": 2802,
            "defaults": 2803,
            "low": 2804,
            "doublewrite": 2805,
            "definition": 2806,
            "replicate": 2807,
            "db": 2808,
            "net": 2809,
            "retry": 2810,
            "password": 2811,
            "interactive": 2812,
            "options": 2813,
            "status": 2814,
            "examined": 2815,
            "row": 2816,
            "type": 2817,
            "sysdate": 2818,
            "wild": 2819,
            "execution": 2820,
            "days": 2821,
            "results": 2822,
            "provider": 2823,
            ":": 2824,
            "init": 2825,
            "at": 2826,
            "trx": 2827,
            ">": 2828,
            "rotation": 2829,
            "autocommit": 2830,
            "zone": 2831,
            "bind": 2832,
            "builtin": 2833,
            "timezone": 2834,
            "record": 2835,
            "offset": 2836,
            "pid": 2837,
            "compressed": 2838,
            "protocol": 2839,
            "errors": 2840,
            "syslog": 2841,
            "tag": 2842,
            "d": 2843,
            "bdb": 2844,
            "database": 2845,
            "symbolic": 2846,
            "in": 2847,
            "arch": 2848,
            "auto": 2849,
            "launch": 2850,
            "accounts": 2851,
            "mmap": 2852,
            "locking": 2853,
            "fail": 2854,
            "function": 2855,
            "socket": 2856,
            "variable": 2857,
            "facility": 2858,
            "chroot": 2859,
            "named": 2860,
            "name": 2861,
            "host": 2862,
            "stats": 2863,
            "metadata": 2864,
            "heap": 2865,
            "connectstring": 2866,
            "checksum": 2867,
            "algorithm": 2868,
            "dump": 2869,
            "enable": 2870,
            "tls": 2871,
            "version": 2872,
            "support": 2873,
            "xa": 2874,
            "`": 2875,
            "cert": 2876,
            "handling": 2877,
            "primary": 2878,
            "image": 2879,
            "querie": 2880,
            "always": 2881,
            "auth": 2882,
            "instrument": 2883,
            "large": 2884,
            "prefix": 2885,
            "output": 2886,
            "links": 2887,
            "condition": 2888,
            "-": 2889,
            "/": 2890,
            "extra": 2891,
            "seeks": 2892,
            "now": 2893,
            "includedir": 2894,
            "start": 2895,
            "core": 2896,
            "incl": 2897,
            "users": 2898,
            "!": 2899,
            "page": 2900,
            "cleaners": 2901,
            "debug": 2902,
            "workers": 2903,
            "cach": 2904,
            "excl": 2905,
            "sys": 2906,
            "malloc": 2907,
            "prune": 2908,
            "level": 2909,
            "is": 2910,
            "res": 2911,
            "unit": 2912,
            "search": 2913,
            "rollback": 2914,
            "timestamps": 2915,
            "stopword": 2916,
            "testWhileIdle": 2917,
            "show": 2918,
            "creators": 2919,
            "si": 2920,
            "unsafe": 2921,
            "handshake": 2922,
            "same": 2923,
            "resolve": 2924,
            "rotations": 2925,
            "recover": 2926,
            ".": 2927,
            "concat": 2928,
            "internal": 2929,
            "disk": 2930,
            "monitor": 2931,
            "tokudb": 2932,
            "analyze": 2933,
            "causal": 2934,
            "reads": 2935,
            "dirty": 2936,
            "pages": 2937,
            "pct": 2938,
            "preload": 2939,
            "sock": 2940,
            "utc": 2941,
            "current": 2942,
            "concurrent": 2943,
            "loose": 2944,
            "autoinc": 2945,
            "conf": 2946,
            "grant": 2947,
            "federated": 2948
        },
        "mysqld-safe": {
            "-": 2949,
            "log": 2950,
            "error": 2951
        },
        "mysqld.server": {
            "socket": 2952,
            "datadir": 2953,
            "port": 2954
        },
        "mysqld1": {
            "max": 2955,
            "_": 2956,
            "connections": 2957,
            "server": 2958,
            "set": 2959,
            "allowed": 2960,
            "packet": 2961,
            "tmp": 2962,
            "table": 2963,
            "size": 2964,
            "skip": 2965,
            "binlog": 2966,
            "format": 2967,
            "socket": 2968,
            "bin": 2969,
            "basedir": 2970,
            "bind": 2971,
            "id": 2972,
            "lc": 2973,
            "thread": 2974,
            "stack": 2975,
            "key": 2976,
            "buffer": 2977,
            "query": 2978,
            "cache": 2979,
            "innodb": 2980,
            "file": 2981,
            "per": 2982,
            "datadir": 2983,
            "address": 2984,
            "port": 2985,
            "slow": 2986,
            "log": 2987,
            "user": 2988,
            "pool": 2989,
            "open": 2990,
            "explicit": 2991,
            "defaults": 2992,
            "for": 2993,
            "timestamp": 2994,
            "sql": 2995,
            "mode": 2996,
            "dir": 2997,
            "heap": 2998,
            "tmpdir": 2999,
            "-": 3000,
            "messages": 3001,
            "external": 3002,
            "expire": 3003,
            "logs": 3004,
            "days": 3005,
            "flush": 3006,
            "at": 3007,
            "trx": 3008,
            "commit": 3009,
            "locking": 3010,
            "type": 3011,
            "limit": 3012,
            "pid": 3013,
            "character": 3014,
            "collation": 3015,
            "sync": 3016,
            "error": 3017
        },
        "mysqld2": {
            "max": 3018,
            "_": 3019,
            "connections": 3020,
            "server": 3021,
            "set": 3022,
            "allowed": 3023,
            "packet": 3024,
            "tmp": 3025,
            "table": 3026,
            "size": 3027,
            "skip": 3028,
            "binlog": 3029,
            "format": 3030,
            "socket": 3031,
            "bind": 3032,
            "basedir": 3033,
            "id": 3034,
            "lc": 3035,
            "only": 3036,
            "thread": 3037,
            "stack": 3038,
            "key": 3039,
            "buffer": 3040,
            "query": 3041,
            "cache": 3042,
            "innodb": 3043,
            "file": 3044,
            "per": 3045,
            "datadir": 3046,
            "address": 3047,
            "port": 3048,
            "slow": 3049,
            "log": 3050,
            "user": 3051,
            "bin": 3052,
            "pool": 3053,
            "open": 3054,
            "explicit": 3055,
            "defaults": 3056,
            "for": 3057,
            "timestamp": 3058,
            "sql": 3059,
            "mode": 3060,
            "dir": 3061,
            "heap": 3062,
            "tmpdir": 3063,
            "-": 3064,
            "relay": 3065,
            "messages": 3066,
            "external": 3067,
            "expire": 3068,
            "logs": 3069,
            "days": 3070,
            "flush": 3071,
            "at": 3072,
            "trx": 3073,
            "commit": 3074,
            "locking": 3075,
            "type": 3076,
            "limit": 3077,
            "pid": 3078,
            "read": 3079,
            "character": 3080,
            "collation": 3081,
            "error": 3082
        },
        "mysqld_multi": {
            "max": 3083,
            "_": 3084,
            "binlog": 3085,
            "size": 3086,
            "wait": 3087,
            "timeout": 3088,
            "mysqld": 3089,
            "mysqladmin": 3090,
            "server": 3091,
            "id": 3092,
            "relay": 3093,
            "log": 3094,
            "user": 3095,
            "format": 3096,
            "bin": 3097,
            "`": 3098,
            "password": 3099,
            "interactive": 3100
        },
        "mysqld_safe": {
            "innodb": 3101,
            "_": 3102,
            "lock": 3103,
            "wait": 3104,
            "timeout": 3105,
            "bdb": 3106,
            "max": 3107,
            "connections": 3108,
            "err": 3109,
            "server": 3110,
            "table": 3111,
            "locks": 3112,
            "my": 3113,
            "event": 3114,
            "scheduler": 3115,
            "log": 3116,
            "files": 3117,
            "in": 3118,
            "group": 3119,
            "back": 3120,
            "commit": 3121,
            "concurrency": 3122,
            "data": 3123,
            "file": 3124,
            "path": 3125,
            "set": 3126,
            "not": 3127,
            "malloc": 3128,
            "tag": 3129,
            "adaptive": 3130,
            "hash": 3131,
            "index": 3132,
            "skip": 3133,
            "strict": 3134,
            "mode": 3135,
            "lib": 3136,
            "socket": 3137,
            "variable": 3138,
            "bind": 3139,
            "support": 3140,
            "fake": 3141,
            "option": 3142,
            "id": 3143,
            "additional": 3144,
            "mem": 3145,
            "pool": 3146,
            "size": 3147,
            "chroot": 3148,
            "name": 3149,
            "resolve": 3150,
            "div": 3151,
            "precision": 3152,
            "increment": 3153,
            "usr": 3154,
            "stats": 3155,
            "on": 3156,
            "metadata": 3157,
            "queries": 3158,
            "warnings": 3159,
            "open": 3160,
            "limit": 3161,
            "myisam": 3162,
            "recover": 3163,
            "options": 3164,
            "using": 3165,
            "buffer": 3166,
            "thread": 3167,
            "nice": 3168,
            "old": 3169,
            "blocks": 3170,
            "time": 3171,
            ".": 3172,
            "address": 3173,
            "port": 3174,
            "slow": 3175,
            "query": 3176,
            "`": 3177,
            "user": 3178,
            "d": 3179,
            "lower": 3180,
            "case": 3181,
            "names": 3182,
            "mysql": 3183,
            "sql": 3184,
            "home": 3185,
            "dir": 3186,
            "interactive": 3187,
            "local": 3188,
            "etc": 3189,
            "dirty": 3190,
            "pages": 3191,
            "pct": 3192,
            "engine": 3193,
            "mysqld": 3194,
            "cnf": 3195,
            "indexes": 3196,
            "passwords": 3197,
            "syslog": 3198,
            "error": 3199,
            "flush": 3200,
            "method": 3201,
            "storage": 3202,
            "/": 3203,
            "-": 3204,
            "at": 3205,
            "trx": 3206,
            "secure": 3207,
            "autoinc": 3208,
            "default": 3209,
            "conf": 3210,
            "includedir": 3211,
            "!": 3212,
            "pid": 3213,
            "connect": 3214,
            "character": 3215,
            "federated": 3216,
            "collation": 3217,
            "priv": 3218
        },
        "mysqld_safe-ssl": {
            "cert": 3219,
            "etc": 3220,
            "conf": 3221,
            "`": 3222,
            "mysql": 3223,
            "includedir": 3224,
            "ca": 3225,
            ".": 3226,
            "ssl": 3227,
            "!": 3228,
            "/": 3229,
            "-": 3230,
            "key": 3231,
            "d": 3232
        },
        "mysqldump": {
            "config": 3233,
            "quote": 3234,
            "triggers": 3235,
            "max": 3236,
            "_": 3237,
            "connections": 3238,
            "server": 3239,
            "transaction": 3240,
            "my": 3241,
            "sets": 3242,
            "order": 3243,
            "quick": 3244,
            "allowed": 3245,
            "keys": 3246,
            "set": 3247,
            "gtid": 3248,
            "packet": 3249,
            "defaults": 3250,
            "names": 3251,
            "socket": 3252,
            "variable": 3253,
            "bind": 3254,
            "sysconfig": 3255,
            "table": 3256,
            "host": 3257,
            "add": 3258,
            "open": 3259,
            "files": 3260,
            "limit": 3261,
            ".": 3262,
            "address": 3263,
            "port": 3264,
            "user": 3265,
            "purged": 3266,
            "`": 3267,
            "drop": 3268,
            "extended": 3269,
            "d": 3270,
            "innodb": 3271,
            "buffer": 3272,
            "pool": 3273,
            "size": 3274,
            "mysql": 3275,
            "locks": 3276,
            "disable": 3277,
            "sql": 3278,
            "mode": 3279,
            "charset": 3280,
            "dir": 3281,
            "password": 3282,
            "etc": 3283,
            "lock": 3284,
            "engine": 3285,
            "primary": 3286,
            "mysqld": 3287,
            "insert": 3288,
            "cnf": 3289,
            "storage": 3290,
            "/": 3291,
            "-": 3292,
            "compress": 3293,
            "routines": 3294,
            "default": 3295,
            "conf": 3296,
            "file": 3297,
            "includedir": 3298,
            "extra": 3299,
            "slow": 3300,
            "query": 3301,
            "log": 3302,
            "comments": 3303,
            "!": 3304,
            "net": 3305,
            "write": 3306,
            "timeout": 3307,
            "single": 3308,
            "events": 3309,
            "character": 3310,
            "by": 3311,
            "tables": 3312,
            "error": 3313
        },
        "mysqldump_testing": {
            "user": 3314,
            "`": 3315
        },
        "mysqlhotcopy": {
            "wait": 3316,
            "_": 3317,
            "timeout": 3318,
            "my": 3319,
            "mysql": 3320,
            "interactive": 3321,
            "etc": 3322,
            "engine": 3323,
            "`": 3324,
            "cnf": 3325,
            "skip": 3326,
            "storage": 3327,
            "/": 3328,
            "-": 3329,
            "d": 3330,
            "bind": 3331,
            "secure": 3332,
            "default": 3333,
            "conf": 3334,
            "file": 3335,
            "name": 3336,
            "includedir": 3337,
            "resolve": 3338,
            "!": 3339,
            ".": 3340,
            "address": 3341,
            "priv": 3342
        },
        "mysqlimport": {
            "character": 3343,
            "sets": 3344,
            "-": 3345,
            "dir": 3346,
            "default": 3347,
            "set": 3348
        },
        "mysqlshow": {
            "character": 3349,
            "sets": 3350,
            "-": 3351,
            "dir": 3352,
            "default": 3353,
            "set": 3354
        },
        "ndb_mgm": {
            "-": 3355,
            "string": 3356,
            "connect": 3357
        },
        "ndbd": {
            "-": 3358,
            "string": 3359,
            "connect": 3360
        },
        "odbc": {
            "Trace": 3361,
            "ForceTrace": 3362,
            "TraceFile": 3363
        },
        "root@host backup": {
            "max": 3364,
            "_": 3365,
            "allowed": 3366,
            "packet": 3367,
            "old": 3368,
            "passwords": 3369,
            "socket": 3370,
            "user": 3371,
            "datadir": 3372
        },
        "safe_mysqld": {
            "id": 3373,
            "err": 3374,
            "file": 3375,
            "server": 3376,
            "-": 3377,
            "_": 3378,
            "log": 3379,
            "pid": 3380,
            "error": 3381,
            "open": 3382,
            "files": 3383,
            "limit": 3384,
            "socket": 3385,
            "datadir": 3386,
            "bin": 3387
        },
        "server": {
            "slow": 3388,
            "general": 3389,
            "_": 3390,
            "log": 3391,
            "warning": 3392,
            "file": 3393,
            "-": 3394,
            "error": 3395,
            "queries": 3396
        },
        "wampmysqld": {
            "innodb": 3397,
            "_": 3398,
            "lock": 3399,
            "wait": 3400,
            "timeout": 3401,
            "buffer": 3402,
            "pool": 3403,
            "size": 3404,
            "myisam": 3405,
            "max": 3406,
            "sort": 3407,
            "file": 3408,
            "connections": 3409,
            "server": 3410,
            "read": 3411,
            "rnd": 3412,
            "table": 3413,
            "cache": 3414,
            "data": 3415,
            "home": 3416,
            "dir": 3417,
            "log": 3418,
            "arch": 3419,
            "error": 3420,
            "set": 3421,
            "path": 3422,
            "allowed": 3423,
            "packet": 3424,
            "engine": 3425,
            "group": 3426,
            "tmp": 3427,
            "skip": 3428,
            "key": 3429,
            "binlog": 3430,
            "format": 3431,
            "storage": 3432,
            "extra": 3433,
            "socket": 3434,
            "-": 3435,
            "bin": 3436,
            "basedir": 3437,
            "bind": 3438,
            "id": 3439,
            "flush": 3440,
            "at": 3441,
            "trx": 3442,
            "commit": 3443,
            "additional": 3444,
            "mem": 3445,
