{
    "dfs.support.append = true": 0,
    "mapred.max.split.size = 134217728": 1,
    "dfs.name.dir = /mnt/hadoop/name": 2,
    "dfs.nameservices = ns1,ns2": 3,
    "dfs.name.dir = /mnt/hadoop-data": 4,
    "dfs.namenode.rpc-address.mycluster.nn1 = nn.domain:8020": 5,
    "dfs.replication = 2": 6,
    "fs.default.name = hdfs://localhost:9000": 7,
    "fs.default.name = hdfs://<machine1 ip>:9000": 8,
    "mapred.child.env = LD_LIBRARY_PATH=/home/ngc/hadoop-0.21.0/lib/native/Linux-amd64-64": 9,
    "yarn.nodemanager.local-dirs = /tmp/nm-local-dir": 10,
    "fs.checkpoint.period = 3600000": 11,
    "dfs.datanode.du.reserved = 0": 12,
    "dfs.domain.socket.path = /var/hadoop/dfs/secure_datapath.sock": 13,
    "mapreduce.framework.name = yarn": 14,
    "fs.checkpoint.dir = file:/home/ubuntu/hadoop-2.6.5/dfs/namesecondary": 15,
    "mapred.job.tracker = hadoop01:9001": 16,
    "dfs.namenode.servicerpc-address.mycluster.nn1 = 10.232.98.61:9820": 17,
    "dfs.namenode.shared.edits.dir = qjournal://server1:8485;server2:8485;server3:8485/edits": 18,
    "yarn.nodemanager.log-dirs = /tmp/logs": 19,
    "mapreduce.tasktracker.http.address = 127.0.0.1:50060": 20,
    "yarn.resourcemanager.address = 10.232.98.61:8032": 21,
    "dfs.http.policy = HTTP_ONLY": 22,
    "mapreduce.jobtracker.address = 10.232.98.62:9001": 23,
    "http.policy = HTTP_ONLY": 24,
    "fs.trash.interval = 0": 25,
    "dfs.https.address = 0.0.0.0:50470": 26,
    "mapred.system.dir = /user/history/mapreduce": 27,
    "yarn.resourcemanager.scheduler.address = 0.0.0.0:8030": 28,
    "dfs.namenode.name.dir = file:/home/ubuntu/hadoop-2.6.5/dfs/name": 29,
    "fs.defaultFS = hdfs://master:9000/": 30,
    "mapred.tasktracker.http.address = 10.232.98.64:50060": 31,
    "<project xmlns=\"http://maven.apache.org/POM/4.0.0\" ...>": 32,
    "yarn.resourcemanager.hostname = 127.0.0.1": 33,
    "mapreduce.map.memory.mb = 4096": 34,
    "dfs.replication = 1": 35,
    "hadoop.tmp.dir = /tmp/hadoop-${user.name}": 36,
    "fs.defaultFS = hdfs://cloudera:8020": 37,
    "mapreduce.map.java.opts = -Xmx3072m": 38,
    "<property>": 39,
    "oozie.service.WorkflowAppService.system.libpath = /user/${user.name}/share/lib/": 40,
    "java.binary.path = /usr/java/jdk1.7.0_25/bin/java": 41,
    "dfs.name.dir = /var/hadoop/dfs/name,/var/hadoop/dfs/name.backup": 42,
    "<VirtualHost *:80>": 43,
    "RewriteEngine on": 44,
    "REDIRECT_HTTP_ACCEPT=*/*, image/gif, image/x-xbitmap, image/jpeg": 45,
    "NameVirtualHost *:443": 46,
    "<IfModule !mod_php4.c>": 47,
    "<Directory \"/livehelp\">": 48,
    "ProxyPass /proxy/other http://not.under.my.control/": 49,
    "RewriteRule ^(.*)$ /index.php/$1 [L]": 50,
    "NameVirtualHost *:80": 51,
    "<IfModule dir_module>": 52,
    "<VirtualHost 1.2.3.4:2130>": 53,
    "<IfModule log_config_module>": 54,
    "<VirtualHost *:443>": 55,
    "error_reporting = None": 56,
    "LogLevel low": 57,
    "</VirtualHost>": 58,
    "<IfModule mod_auth_digest.c>": 59,
    "<VirtualHost *:8888>": 60,
    "<Proxy *>": 61,
    "<Location /svn>": 62,
    "AllowOverride None": 63,
    "<Directory /usr/www/myhost/pri>": 64,
    "Order deny,allow": 65,
    "Require valid-user": 66,
    "AuthType Basic": 67,
    "<Location \"/private\">": 68,
    "Allow from all": 69,
    "<IfModule mpm_prefork_module>": 70,
    "NameVirtualHost *:9000": 71,
    "SSLCipherSuite ALL:!aNULL:!ADH": 72,
    "<IfModule ssl_module>": 73,
    "SSLProtocol ALL": 74,
    "RedirectMatch temp ^/.+$ http:": 75,
    "# Used for Database Authentication": 76,
    "AddHandler cgi-script .to": 77,
    "<VirtualHost *:9000>": 78,
    "innodb_data_file_path = ibdata1:10M:autoextend": 79,
    "[mysqld]": 80,
    "[client]": 81,
    "[client] user = myusername password = mypass": 82,
    "#": 83,
    "Prisma Schema---------": 84,
    "# The following options will be passed to all MySQL clients": 85,
    "user = mysql": 86,
    "[mysqladmin]": 87,
    "SET GLOBAL group_concat_max_len=15360": 88,
    "# /etc/my.cfg": 89,
    "# Replication setup": 90,
    "[root@host backup]#cat /etc/my.cnf": 91,
    "# The MySQL database server configuration file.": 92,
    "dfs.support.append": 93,
    "mapred.max.split.size": 94,
    "dfs.name.dir": 95,
    "dfs.nameservices": 96,
    "dfs.namenode.rpc-address.mycluster.nn1": 97,
    "dfs.replication": 98,
    "fs.default.name": 99,
    "mapred.child.env": 100,
    "yarn.nodemanager.local-dirs": 101,
    "fs.checkpoint.period": 102,
    "dfs.datanode.du.reserved": 103,
    "dfs.domain.socket.path": 104,
    "mapreduce.framework.name": 105,
    "fs.checkpoint.dir": 106,
    "mapred.job.tracker": 107,
    "dfs.namenode.servicerpc-address.mycluster.nn1": 108,
    "dfs.namenode.shared.edits.dir": 109,
    "yarn.nodemanager.log-dirs": 110,
    "mapreduce.tasktracker.http.address": 111,
    "yarn.resourcemanager.address": 112,
    "dfs.http.policy": 113,
    "mapreduce.jobtracker.address": 114,
    "http.policy": 115,
    "fs.trash.interval": 116,
    "dfs.https.address": 117,
    "mapred.system.dir": 118,
    "yarn.resourcemanager.scheduler.address": 119,
    "dfs.namenode.name.dir": 120,
    "fs.defaultFS": 121,
    "mapred.tasktracker.http.address": 122,
    "xmlns=\"http://maven.apache.org/POM/4.0.0\"": 123,
    "yarn.resourcemanager.hostname": 124,
    "mapreduce.map.memory.mb": 125,
    "hadoop.tmp.dir": 126,
    "mapreduce.map.java.opts": 127,
    "property": 128,
    "oozie.service.WorkflowAppService.system.libpath": 129,
    "java.binary.path": 130,
    "<VirtualHost": 131,
    "RewriteEngine": 132,
    "REDIRECT_HTTP_ACCEPT=/,": 133,
    "NameVirtualHost": 134,
    "<IfModule": 135,
    "<Directory": 136,
    "ProxyPass": 137,
    "RewriteRule": 138,
    "error_reporting": 139,
    "LogLevel": 140,
    "/VirtualHost": 141,
    "<Proxy": 142,
    "<Location": 143,
    "AllowOverride": 144,
    "Order": 145,
    "Require": 146,
    "AuthType": 147,
    "Allow": 148,
    "SSLCipherSuite": 149,
    "SSLProtocol": 150,
    "RedirectMatch": 151,
    "AddHandler": 152,
    "innodb_data_file_path": 153,
    "user": 154,
    "Prisma": 155,
    "SET": 156,
    "[root@host": 157
}